{"label": 0, "rating": 3.0, "title": "In the Mindset of a Ballerina", "text": "Meg Howrey's \"the Crane's Dance\" allows the reader passage to the labyrinthine mind tunnel of a principal dancer in a prestigious New York City dance company.  Main character Kate's first person narrative twists and turns acting as a 24/7 commentary on \"a day in the life\" of a ballerina.  While this would certainly appeal to anyone who has secretly or outwardly coveted tutus, point shoes or just has a gold ballet slipper charm on a nostalgic bracelet, Howrey adds mental stress to Kate's already precariously balanced sense of physical and psychological well-being by injecting a more-talented yet less stable sister for whom Kate feels a mixture of envy, compassion and guilt.<br /><br />All of the siblings of the Crane family have risen to be some sort of performance stars.  Brother Keith, a professional tennis player, calls his family from tennis circuit destinations from around the world.  Gwen, the other ballerina, dances with such ease, she immediately is placed in a starring role.  In fact, she seems to do everything with her own particular effortless grace, including moving in on Kate's boyfriends, sleeping with them, and calling them her own.  Is there any wonder that Kate would feel some impetus to not only be successful but to excel beyond normal expectations?  Kate's opportunity to become a principal comes only when Gwen's instability challenges her very sanity; Gwen is hospitalized and Kate takes her place on the stage.  Her success is tinged with feelings of regret, guilt and the sense of being second best.<br /><br />As Kate goes about her daily routine of classes and performances, her mind floods with thoughts of her sister.  She knows she should view her with compassion yet her need to be a star in her own right revels in her sister's absence.  When Kate hurts her neck while performing in Swan Lake (which will call to mind [[ASIN:B0041KKYEM Black Swan]]), her subsequent dependence on drugs along with the normal stresses of sustaining the athleticism of her ballet, the knowledge that a career of dance is ephemeral and her insecurity with herself reign supreme in her mind and she begins to spiral down the same black hole as her sister.<br /><br />Howrey, once a member of a ballet company herself, presents the disjointed world of ballet and performance art in general, for the competitive microcosm that it is.  However difficult it may be to follow Kate's narrative at times as it wanders with her mind in a circuitous Crane's Dance (Howrey's allusion to Theseus's movements in and out of the Minotaur's Labyrinth), her voice rings true and a view of this world from the inside is revealed warts and all.  In terms of a compelling story, however, the disjointedness of Kate's emotional unravelling as detailed by her mind calling up past and present moments can be confusing and does stop the flow of the actual plot.<br /><br />Kate's relationship with a young ballerina wannabe is especially poignant; she is flattered by Bryce's fascination with her, but is reluctant to push her into a life of grueling routine, insecurity and ephemeral success.<br /><br />Bottom line?  \"The Crane's Dance\" by Meg Howrey gives an insider's perspective of ballet.  Impeded by her sister's emotional collapse, main character Kate finds the strenuous world of dance overwhelming.  At times, Howrey's narration seems disjointed even when it follows the track of the main character's mind. Recommended for ballet lovers.<br />Diana Faillace Von Behren<br />\"reneofc\"", "images": [], "asin": "0307949826", "parent_asin": "0307949826", "user_id": "AHMSKOYKE32N5P6E7AK7PQXGPA7A", "timestamp": 1340552480000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "I haven't felt inspired to make anything from this book.", "images": [], "asin": "1623363586", "parent_asin": "1623363586", "user_id": "AFXHLXJ5SXVRXKJAMWJ776OHTE6Q", "timestamp": 1468969368000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Hated it.", "text": "Scheming, chauvinistic.", "images": [], "asin": "0736937900", "parent_asin": "0736937900", "user_id": "AGUWXCJNMHG6OS5A4AXTVRHF67KA", "timestamp": 1476332182000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Good", "text": "Slow moving until the end.", "images": [], "asin": "0062659065", "parent_asin": "0062659065", "user_id": "AHRDOVV46GFQURG7NCKCC6YIMNEA", "timestamp": 1606847468451, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "but I was so disappointed. The writing was messy and unoriginized", "text": "I couldn't wait to read this book, but I was so disappointed. The writing was messy and unoriginized. The good reviews can be credited to the her instragram followers who  probably wouldn't know a good book if it fell on their head.  The actual stories are funny, but they are dragged out to much. The book lacked depth and was very  superficial.<br />The book is to expensive for how much content it has, most new authors would only charge 4 or 5 dollars.  Her giant ego felt like she could  price price gouge people because of her established fan club.", "images": [], "asin": "1101907045", "parent_asin": "1101907045", "user_id": "AEG4S3L6YCQ3BR7PYTID5UFSQ3VQ", "timestamp": 1463319789000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Good read though", "text": "Not sure this is helpful.  Good read though.", "images": [], "asin": "1621572420", "parent_asin": "1621572420", "user_id": "AHDCXZE46QIILK7JWVE6QTDRZSXQ", "timestamp": 1413662008000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I thought the character development was good, the story line was unique", "text": "I'm claustrophobic so this book freaked me out a bit.  I thought the character development was good, the story line was unique, but I liked the Silo series of Howey's much better.", "images": [], "asin": "1494904489", "parent_asin": "1494904489", "user_id": "AGLVRNWP4LDBK5KNLFNDAFC4UVRA", "timestamp": 1454341956000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not a good book", "text": "Not a good book", "images": [], "asin": "B082HS7291", "parent_asin": "B082HS7291", "user_id": "AHHDO2FMGH4ST2DNZZ22XKKUYN2Q", "timestamp": 1598564862611, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not His Best Work", "text": "I have always been a fan of Jerry Spinelli's books!  I've read them all, some of them several times.  In the past, I used 4th Grade Rats as a \"read aloud\" to my students at the beginning of the school year. I was excited to see the prequel come out late last summer, and couldn't wait to read it to my new 3rd grade students.  It was a disappointment, but I must admit that my students enjoyed it.", "images": [], "asin": "0545387728", "parent_asin": "0545387728", "user_id": "AFYTRFPG3GUUMJG7ETKN5UBFZ47A", "timestamp": 1362592756000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "Bought used and did not come with cd. Bummer", "images": [], "asin": "1865153044", "parent_asin": "1865153044", "user_id": "AHT7BB2C7FNWRA6S4PNL6UNWRRCQ", "timestamp": 1444725489000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting but flawed", "text": "Kudos to the designers of this book's cover.  It drew me in, sparked a question in my mind so that I tracked this book down and read it.<br /><br />WRITING STYLE:<br />Simplistic.  Too detailed in some places, not detailed enough in others.  There were parts that seemed superfluous, and sections where the drama was HIGH but the writing wasn't good enough to capture the moment, which is a darn shame because Ms. DiDonato has accomplished some simply amazing things.<br /><br />As for the book in it's entirety:<br />For me this book seemed to fall into 3 parts.  The first part was interesting, but not riveting stuff.  It served it's purpose though as it formed the background for the second part which had me on the edge of my seat.  This section dealt with the most difficult parts of Tiffanie's surgeries and I found it an inspiring example of human courage and strength.<br /><br />This was followed, unfortunately, by a poorly crafted description of her life after The Big surgery.  I found part of this so vaguely described that it wasn't 'satisfying'.  While another part was so oddly personal that it bordered on creepy --to me, at least: others might find it >>><br /><br />>>>SPOILER ALERT  SPOILER ALERT>>><br />...endearing that she went shopping with her mother for sexy outfits and that she got carried away with fantasizing about her night-to-come in the dressing room.<br /><br />>>>END OF SPOILER<br /><br />In the end I concluded that I like Tiffanie.  That she had guts and that self-promotion was all apart of the package and that I was good with that.  BUT I almost wish this book had been from her mother's perspective.  For if Tiffanie was iron, her mother was steel.<br /><br />Honestly, as a mother I don't know if I could have been as strong as Mrs. DiDonato.  Holy cow, I can't imagine what it must take to watch your child suffer and struggle like that; and to have to tell her to \"suck it up\", when she must have been melting inside.  Talk about tough love.<br /><br />Three Stars.  Amazing story that could have been better edited.", "images": [], "asin": "0452298113", "parent_asin": "0452298113", "user_id": "AHFRAASH4BVPTCCUGNHH5APBSR4A", "timestamp": 1358909505000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "No depth", "text": "I did not like the majority of the questions--they were too shallow.", "images": [], "asin": "0307719774", "parent_asin": "0307719774", "user_id": "AEM5HEPJVIDZLUQ3MOCWH7CX2HBA", "timestamp": 1582355525823, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "I can't use a book that relies on a command of script other than English.", "images": [], "asin": "0070690383", "parent_asin": "0070690383", "user_id": "AEIRORFGVV3DA2CNKCJ4VOFL5FZQ", "timestamp": 1468614064000, "helpful_vote": 4, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "This is a great work of art.", "text": "Yes, I know that.  However, the wonderful intelligence that informs the writing is drowned in the hesitations, and excessive refinement of every aspect of the novel.", "images": [], "asin": "0393978818", "parent_asin": "0393978818", "user_id": "AGHTAYV35VMMGCLPQ55O7IVTE3NQ", "timestamp": 1365088186000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Too small", "text": "The pics are nice but it's super small. I returned It. Not what I expected.", "images": [], "asin": "1530855985", "parent_asin": "1530855985", "user_id": "AGFW6VRVRWCDDFOIW4KBE4NYUAFA", "timestamp": 1488836377000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Buyer Beware", "text": "Here is a prime example of the great service Amazon provides and what can happen when you do not use it. This book is horrible, and I have downloaded the April 9, 2002 code updates which still do not work.  Had I a read the reviews at Amazon I would have saved myself some money and valuable time.", "images": [], "asin": "0764548360", "parent_asin": "0764548360", "user_id": "AG5HKFIWKUAZK2FHKXBFSGKB333Q", "timestamp": 1019446424000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Welcome to hell", "text": "This book is ABSOLUTE HELL!!! Good luck trying to understand it, the steps are stupid, and the examples are a joke. If it gave a link to videos that actually showed you what to do I’d be happy, but nope. Overall, if your teacher recommends buying this book for class good luck, cause I hate it, it still haunts my dreams.", "images": [], "asin": "0335249493", "parent_asin": "0335249493", "user_id": "AF3ET2BA537ZFBWCT622D5A7TE2Q", "timestamp": 1644020232173, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Slow and not believable (even for fiction)", "text": "I really hate leaving bad reviews. As a writer I strive to support authors, but the ratings on this novel led me completely astray. I didn't finish the book, it was slow, but just interesting enough for me to plod through. I did not see it as a thriller in any sense, and to be dubbed a thriller I would imagine it should be thrilling in the first half, which I did not think it was. As the book passed the second half, the main character began to do things that were unbelievable, even for a fictional character, therefore it became an unrealistic book for me.", "images": [], "asin": "1594633665", "parent_asin": "1594633665", "user_id": "AFACQS4HLC4DGTOKMUIMOWY377EA", "timestamp": 1441827329000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Sad", "text": "This book is depressing. Plain and simple. Not what I expected but wanted to read it with my girls before we saw the movie. The movie had a much more positive spin with jokes. First time I've ever thought the movie was better than the book!", "images": [], "asin": "0143129066", "parent_asin": "0143129066", "user_id": "AEUEW647PI5HWGRUBFTZDPYOGLSA", "timestamp": 1480438625000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Sophomoric and Painful", "text": "I had high hopes for this book.  They were dashed.  It's mostly a series of \"tests\" to determine what to do and \"letters\" about surreally unbelievable situations.  For this book, \"white trash\" implies that burglary is the preferred career, everybody has four or more husbands/wives over time and innumerable dalliances beyond, and any carnal urge results in children who must be taught how to burgle.<br /><br />It's just not funny, and has nothing in common with Jeff Foxworthy or David Barry writing about similar topics.", "images": [], "asin": "0767922077", "parent_asin": "0767922077", "user_id": "AFXRDEVBGBQT3YV5J5OHSUT6H6BA", "timestamp": 1166901570000, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Disappointing...", "text": "What this book does not tell you is how to fight demonic possession which I was expecting. It is sort of vague in that there is no proof of how the allegations mentioned were made. Meaning the sources of where these allegations were derived are not made clear. Another thing  that bothered me about this book is that it depicted God as some type of celestial Dictator Ala Papa-Doc in Haiti,  who sometimes used his boogeymen to straighten out individuals against his rule. If Satan is under the complete dominion of God, then why is his name Satan which means \"adversary\". I'm sure that God prevents Satan and his demons from inflicting more harm than they wish to, but to say they are under the complete dominion of God is confusing and misleading. Maybe I'm not spiritually developed enough to understand the meaning of this book, but it left me with more questions than I had before reading it.", "images": [], "asin": "B09TMT4B9X", "parent_asin": "B09TMT4B9X", "user_id": "AFAPY6Q67HMIBQTTW53CM3N47SMQ", "timestamp": 1653064044249, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "When I received the book I was happy but when I open the book the words were ...", "text": "When I received the book I was happy but when I open the book the words were small it was disappointed it was the right book. My husband have too use minifind glass.", "images": [], "asin": "0965153398", "parent_asin": "0965153398", "user_id": "AG3ESO5SLMYRNEHAATHZWVMXVE4Q", "timestamp": 1491494830000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three stars", "text": "Predictable but I enjoyed it anyway. A little too much \"romance\" for me. I enjoyed the characters and I'm trying to figure out who the next couple will be.", "images": [], "asin": "B00818J18A", "parent_asin": "B00818J18A", "user_id": "AFVYRFAYPLY4ZUBPUSDHJ24Q4SVA", "timestamp": 1460741534000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Boring", "text": "Yeah....what to say.  If you know what a computer is, how to use it, and if you know what century we are in, then this book is really not for you.  I would say it is more for the pre-service librarians that are clueless when it comes to 21st century learning and its best practices.", "images": [], "asin": "0838985076", "parent_asin": "0838985076", "user_id": "AEFFUL3CK5RGV2FDYLSKUA2TOSNA", "timestamp": 1362505795000, "helpful_vote": 5, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not as described", "text": "I was so excited to get the book. When I opened it, the inside of the book was good but the cover was missing and there was water damage on the edges of the book.  The book was going to part of my new collection.  Had to return for a refund.", "images": [], "asin": "1400031141", "parent_asin": "1400031141", "user_id": "AHGQRE6Q5TGMGYSCSQXENAN3VPTQ", "timestamp": 1650541757068, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Awful", "text": "Excruciating Dull, main character is bitchy, not interesting. Other characters one dimentional, boring.", "images": [], "asin": "B075G1GS58", "parent_asin": "B075G1GS58", "user_id": "AGLPXW26GPHNHGMSM3H5OYDVMTLA", "timestamp": 1519873483477, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Going To Try Again", "text": "This was my first Eloisa James book. I didn't like it. Some stuff was so far fetched...which isn't always a bad thing...it just didn't add anything to the plot or the story. The book drags in several places. The characters just weren't defined enough for me to really get a bead on their personality or character. I didn't feel anything for the characters. I didn't sense their love for each other.<br /><br />It definitely wasn't a page turner but I did finish it so it wasn't too horrible. If I hadn't read the reviews for Eloisa James on Amazon, there is no way I would try another of her books. However, it sounds like I should give her another shot. So I will. Fingers crossed!", "images": [], "asin": "0062021737", "parent_asin": "0062021737", "user_id": "AFYXEDYF72R34CVVL47G4ULFTB7A", "timestamp": 1346785168000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Cute and informative but no surprises", "text": "I guess for being a person interested in such things, I knew most of these answers already. But it’s really a good resource to explain things to kids and those who have these questions without having to word them yourself.", "images": [], "asin": "039365270X", "parent_asin": "039365270X", "user_id": "AF44C2IUCNFBYCGHDMB2CBQ25DEQ", "timestamp": 1642564775116, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "This is useless.", "text": "Don't waste your money. You need the eyes of an eagle to read this. So it takes a while to find what your looking for. So much for Quick Reference.", "images": [], "asin": "1939791073", "parent_asin": "1939791073", "user_id": "AEARZMUKLHZI5AEQKNQ34KXMPZMA", "timestamp": 1401916208000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "Hideous. These are ANCIENT AND INEDIBLE. Will never order again", "images": [], "asin": "B003NTTEC0", "parent_asin": "B003NTTEC0", "user_id": "AH5B3KHK7GM63CB5W6MWAHLRXAIA", "timestamp": 1513722237271, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Really?", "text": "what a disappointment. This was the stupidest book I ever read.", "images": [], "asin": "1517527740", "parent_asin": "1517527740", "user_id": "AE4VDUS22PQQM5D6W7WVWYWRYCEQ", "timestamp": 1472861334000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Could this be Castle's Ghost Writer?", "text": "Not dazzling, but I was intrigued by the possibility that Tom Straw might possibly be the official &#34;Ghost writer&#34; for Richard Castle.  I saw similar elements in the story construction.", "images": [], "asin": "0786718781", "parent_asin": "0786718781", "user_id": "AHLYQAIACCXEALZRY3XTIBWORQZA", "timestamp": 1413930718000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good but a little annoyed", "text": "I'm a little annoyed that this only has one new short story.  What is the deal with all of these publishing companies releasing already written material and re-packaging it as \"new\" (I'm looking at you Nora Roberts)?<br /><br />I'm a huge fan of the series and couldn't wait.  So a few months ago I pre-ordered the book and when I saw that it had downloaded immediately went to read it.<br /><br />Here's the deal - it's 3 previously published short stories (which I've already bought) with only 1 new one.  When you read the book description now it clearly states that, but when I pre-ordered it the description DID NOT say 3 previously published novellas.<br /><br />$7.99 for 1 novella is a bit much.  Even if it had 2 new stories and 2 old ones, that might have been fine.  I'd rather have bought Galen's story as a stand alone novella for $2 or $3.<br /><br />That being said:<br />Galen and Jessamy's story was interesting to get the back story, but it didn't really pull at me like some of Singh's other stories have done.  I liked Jessamy, but found her to have a bit of the \"waiting lady in distress\" thing which I'm not the biggest fan of.  I think where Singh shines is in full length novels (I also read her Psy series) because she had a chance to fully develop her characters and story.  In novellas she tries, but I can almost feel where she would have written more in but didn't do to space constraints (like when Jessamy goes back to the Refuge).  Keeping all that in mind, I enjoyed Galen's story but can't wait till the next full installment of the actual series.", "images": [], "asin": "B005GSYYT4", "parent_asin": "B005GSYYT4", "user_id": "AGK5M6H5BWDXF7GQNGHK44Y4X43Q", "timestamp": 1330608991000, "helpful_vote": 75, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Fairly written, but biased review of an American racing empire gone sadly wrong.", "images": [], "asin": "0393600076", "parent_asin": "0393600076", "user_id": "AH5HEN2Z5KLTDYEJLTP7LXYFUPPA", "timestamp": 1405081666000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Masterfully crafted but light on content", "text": "This short novel is undoubtedly worth the read and demonstrates the stunning power of Shirley Jackson's prose, but my expectations were quite high - perhaps unrealistically so - and were not met. I try to steer away from plot synopsis and spoiler material in my reviews, and this will be no different, but there are some 'twists' here that simply weren't twists for me. Had some of these moments taken me by surprise, I can imagine that my feelings for the novel would be much stronger. A good twist really forces you to re-consider everything you've read up to that moment, and in a sense, lengthens the intellectual content. And while someone said in another review that this book is the perfect example of an unreliable narrator, I disagree. The narrator here, Mary-Catherine Blackwood, is indeed totally unreliable, no question, but this is a known quantity from the start. Trusting a narrator of this caliber is foolish and would obviously lead you down the wrong path. Not trusting the narrator, which I didn't from the get go, makes for a less passive read, but alas, a clearer one in which the surprises aren't surprises. The book is excellently written, not a single passage or line of dialogue struck me as off, but when I came to the end, it was to a conclusion that I really felt hadn't diverged at all from the one in my mind.", "images": [], "asin": "0143039970", "parent_asin": "0143039970", "user_id": "AFA25ISRNCAKMURYNDLKCO2I5WQQ", "timestamp": 1532518543837, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "Print too small for elementary school students.  I expected separate books.", "images": [], "asin": "069220248X", "parent_asin": "069220248X", "user_id": "AHM23PDW36PIZYLWOO44XUI5CRQQ", "timestamp": 1463785014000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Same nothing special", "images": [], "asin": "1935223631", "parent_asin": "1935223631", "user_id": "AENSJNNQJYG2LL6CRQTTQXTRFQEA", "timestamp": 1455647019000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Call me shallow....", "text": "But I get a book to get away from social injustices while I am wrapped in a story that tantalizes my imagination, and was very disappointed that the actual story of the Oracle was  covered in less than one CD, and that is a stretch.  I love ancient intrigue, but am finding less and less of it in Cussler's books.  May have to look for a new author to love......…….", "images": [], "asin": "0525539611", "parent_asin": "0525539611", "user_id": "AGQRNZYFNBIANP6X7FGKF6CEQXWQ", "timestamp": 1560991008896, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "obviously I am not purchasing it to enjoy it.", "text": "It's a text book, obviously I am not purchasing it to enjoy it.", "images": [], "asin": "1285094069", "parent_asin": "1285094069", "user_id": "AESH4HLYPHFBWHNGWWDQ2P3WYJUA", "timestamp": 1480972542000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I love the Fever series", "text": "I'm torn, I love the Fever series. I've read it too many times to count.  This book just seemed &#34;choppy&#34;.<br />Even leaving Dani's age out of it, it didn't have the same flow, easy read the Fever series had.  A good story<br />in and of itself, but had it not been loosely attached to the previous series I'd not have finished it.<br />That being said, I've still pre-ordered Burned and am hoping for an &#34;easier to get through&#34; read  =)", "images": [], "asin": "0440246415", "parent_asin": "0440246415", "user_id": "AFDYRZMTDGCGTYJEB5YQAR7HSM3Q", "timestamp": 1419977558000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Interesting subject, thinly composed.", "text": "This book piqued my interest in Military Working Dogs, but the book is not well written, as mentioned by another reviewer, and very thinly composed.  I recommend Top Dog or Soldier Dogs and skipping this book.", "images": [], "asin": "1250009464", "parent_asin": "1250009464", "user_id": "AEIMPFCDKUKETLEQEK2WN3XA5E7Q", "timestamp": 1534890038802, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Don't waste your money", "text": "If the review would have said this is a POCKET sized book (6 in x 4 3/8 in) with text size smaller then 10pt I would never have purchased it.  I really did expect a full sized book . . . It is difficult to read, the photos are barely usable because of their small size.  Don't waste your money.", "images": [], "asin": "0415833515", "parent_asin": "0415833515", "user_id": "AGBM734HPW5NHIAXCYBA5WTMXWCA", "timestamp": 1425710457000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Accessible and simple", "text": "I really like the format this book takes. Each page is simply presented with a single subject, which is important with any program as complex as Photoshop Elements. Unfortunately, I think the book has been simplified a bit too much. It can get you started editing and organizing your photos but won't take you far. There's just not enough here, and what is can sometimes be of questionable use. For example, the section on sharpening photos ignores, Photoshop's build in sharpening tools and explains a somewhat complicated and trial and error process using layers, blending modes and the High Pass filter. That used to be the best way to sharpen in Photoshop but is not a beginner friendly approach.", "images": [], "asin": "0240814452", "parent_asin": "0240814452", "user_id": "AELYPIYCIZUCXZC2VCOGB6IKFHJQ", "timestamp": 1310536350000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Should have read the reviews about the quality", "text": "Update: This rating now IS for the story. Sanderson is good at paying off things you didn't even know he was seeing up and nothing else. Didn't care about the characters, found the story boring for 95% of the books, and tbh, there wasn't really any world building. I can't picture the world and it doesn't feel real or alive.<br /><br />As for the quality, my pages STILL have not fallen out (so that's something), thankfully. However, the pages are VERY thin, and the writing goes into the crease which makes it difficult to read since the book is very tightly bound. I would not recommend reading this at all.", "images": [], "asin": "125026717X", "parent_asin": "125026717X", "user_id": "AEX667OZ7HUTS7GAERHG6EFD6FSA", "timestamp": 1639069855534, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Disappointing", "text": "I thought this would contain more examples, but it has more pages spent on nothing but explanation. I guess it would work for beginners. I wish there would have been more sample pages.", "images": [], "asin": "1497204178", "parent_asin": "1497204178", "user_id": "AHIQ5OIU6U5WXTR3LAJPXXPPICRA", "timestamp": 1641156974550, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Schmidt was juiced?", "text": "Steroids have been around for 50 years.  The Steelers of the 70s were reportedly on 'roids.  Schmidt is a competitor, albeit a gentleman competitor.  Draw your own conclusions.  It's not inconceivable, though the evidence will never come to light, that the superstars of the 60s and 70s, if not the 50s, were juiced.  I have not read this book; probably a hagiography.", "images": [], "asin": "0060854995", "parent_asin": "0060854995", "user_id": "AH7ZES2DTJZAMNI333OWGJBRWJTQ", "timestamp": 1159624979000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Interesting Story", "text": "I was most interested in the sideshow elements, but this is a solid overall book. Held my interest and had some good information about both the sideshow and the photographer. Kind of slow at times, but worth a read for fans of carnival performers, photography, or historical collections.", "images": [], "asin": "B01MUC25AR", "parent_asin": "B01MUC25AR", "user_id": "AHSWX3OQOBWDA5XFJSMF4MWQQYMA", "timestamp": 1565064239147, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Uninteresting True Crime", "text": "This book was full of repetitions and annoyances. I've listed my annoyances.<br /><br />Did anyone ask Peggy Sue why she was trying to contact Russel to give him Brenna's Christmas present? Russel was staying with Brenna, so why would he have to drive out somewhere to meet Peggy Sue to get the present? Why did Peggy Sue not want to give it to Brenna herself? Which Brenna later claimed that she did receive the gift on Christmas Day (but who brought it?).<br /><br />p 188 \"I fought back and sassed my half sister, Sue.\" Should be stepsister.<br /><br />p 189 \"Peggy was a chubby child, and Doris watched her closely, fearful that her beautiful baby girl might truly become fat. Peggy was allergic to eggs and chocolate, and she had to be on a special diet. Instead of milk, she drank Strawberry Quik.\" Strawberry Quik  is a flavored powder (full of sugar) which is mixed with milk, so yes, Peggy Sue did drink milk. Not sure what Strawberry Quik had to do with her \"special diet\" or how it helped her from becoming \"truly fat.\"  \"Peggy had sugar-free candy because she was allergic to chocolate.\" There are MANY candies which do not contain chocolate. Maybe Doris gave her sugar-free to keep her from becoming \"truly fat.\" And could none of the other children have Strawberry Quik, only Peggy?<br /><br />p 194 Jimmie and Doris divorced (when?) and both remarried in 1984. Amy was so upset about divorce she lost control of mother's car on the way to high school one morning and wrecked it. Amy was four in 1963, so she would have been eighteen in 1977. So it had to have happened 1975-1977 - was that when the divorce was?<br /><br />p 195 \"Rob....joined the navy right out of high school.\" \"...shortly after he was mustered out of the service...\" why was he mustered out?<br /><br />p 200 Sweet Sue's wedding - \"her half sisters were happy to attend.\" They were STEP sisters. Only Peggy Sue was Sweet Sue's half-sister.<br /><br />p 215 \"On Sept 15, 2004 Brenna Douglas came into the Island County Sheriff's office in Langley carrying a huge wicker basket...She explained that this was the gift she received from Peggy Thomas...she thought she got it on Christmas Day\"  The police interviewed her right after the murder so what took her so long to bring this basket to them? Was it really THE present? Who did she say BROUGHT her the gift?<br /><br />p 170 Jimmie was a big rugged man with wavy, red blond hair....\"<br />p 187 \"He [Jimmie] had always had flaming red hair...\"<br />Was it red blond or was it flaming red?<br /><br />p 194 \"Shortly after High School Graduation Amy married Mr. DeBoer...\" She couldn't even find out Mr. DeBoer's first name?<br /><br />According to Ann Rule, Peggy's second husband Kelvin Thomas, despite cheating on Peggy, \"always had her back.\" How so? Because he showed up at her hearing?<br /><br />One wedding photo of Peggy Sue and Mark Allen: According to Ms. Rule, Mark had a \"What have I done?\" look on his face and Peggy Sue looked \"triumphant.\" To me, Mark Allen looked tired, perhaps intoxicated, and about ready for a nap. Peggy Sue looked as though she were posing for a wedding photo, trying to look sweet and demure.<br /><br />The repetitions: Over and over we are told that Brenna says she has more friends than Russel and Ms. Rule tells us this is not true. Over and over we must be told that Jean Huden took drugs. Over and over we must be told that there were SIX children from the first marriage of Peggy Sue's father, and her mother had TWO, so that made EIGHT children.<br /><br />The book is poorly written and confusing. Some of the paragraphs have sentences that don't even belong in those paragraphs, or the sentences themselves were confusing. There are a lot of exclamation points used in the dialogue, and in Ms. Rules own observations or opinions. Some of content, especially Peggy Sue's resume, appears to be lifted straight from newspaper articles. It would be interesting to find out the neurosis that possessed Peggy to destroy her marriage to Mark Allen. That was like killing the goose that laid the golden egg. It must have been control and power that she wanted, and she had such a huge ego she thought she could have all that and the money too. Unfortunately for her, Mark Allen did not care to be controlled.<br /><br />I don't know if Russel was a bad guy or not. His wife said he was. His mother did not seem impressed with him. He threw a fit because his store did not have Mountain Dew and he wore a kilt to work one day and a sarong on another day, seeming to think that would be okay in a business environment. He was definitely different.<br /><br />Just because it happened in Washington state, doesn't mean there needs to be a book about it. There needs to be a definite motive and the victim needs to be someone people can relate to and/or care about.", "images": [], "asin": "1416544623", "parent_asin": "1416544623", "user_id": "AH74YZQJEUF55CYLLS5FIGGEXKLQ", "timestamp": 1398709984000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Good content, horrible grammar", "text": "The content is relative to the CEH exam, and is very helpful. I have learned a good deal about the certification requirements. But the typos and grammar are so bad that I've had to read sentences multiple times to try and determine their meaning - oftentimes, I'm left not really knowing for sure. I don't think it was written by a native English speaker, as evident by the lack of articles such as &#34;a&#34; and &#34;the.&#34; This book needs some major rounds of proofreading and correction.<br /><br />Additionally, don't plan on taking any of the sample tests to prepare you for the actual test. For example, one of the sample questions is (paraphrased) Which DNS record reveals information about the mail server (MX)? The answer (MX) is in the question! And some questions are very nebulous, with no definitive answers anywhere in the text. I'm considering this book a basic overview of the information before I really start studying.", "images": [], "asin": "172379841X", "parent_asin": "172379841X", "user_id": "AGKDI7BUVULHJQZDCIZ3UN5FE6WA", "timestamp": 1540340729515, "helpful_vote": 11, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "good recipes, the print needs to be embiggened.", "images": [], "asin": "0998739952", "parent_asin": "0998739952", "user_id": "AH2ZTRKXBZOCI5VSC6ZGSH6NHBDQ", "timestamp": 1527461773692, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "I do not waste time with books I do not", "text": "Deleted the book after a few chapters.  I do not waste time with books I do not like", "images": [], "asin": "B078RH9PLG", "parent_asin": "B078RH9PLG", "user_id": "AEFEZIYEZG7XTSPDTFIUQXWMGEDQ", "timestamp": 1523234947211, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Great content, awkward format", "text": "A cd rom, really? This is a requirement for a college biology course needed for graduation. This is for an online course, so if you think about it I I'm having to switch between the university's online website where I have to answer the questions found in the CD ROM and then switch back to the cd ROM.  The material content is interesting and very well done but the format just doesn't work.  It also displays in a small box on the screen which is roughly about 5 x 7. There is no way to enlarge it.  Through the drop-down menu for each chapter and it makes researching material cumbersome.  This is not great when reading 36 pages flipping back-and-forth from box to box in order to find the material.", "images": [], "asin": "049500992X", "parent_asin": "049500992X", "user_id": "AFATOWO2MFS5RKQBBM3EQB76MJXQ", "timestamp": 1425013011000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not worth the money", "text": "The book is nicely photographed, written in a lively manner.  I don't think I learned anything from it other than that I'm already<br />enjoying almost all of what Watson thought was wonderful and worthy enough to include in his book.  Perhaps it is written<br />for young people just starting out.", "images": [], "asin": "145490724X", "parent_asin": "145490724X", "user_id": "AGFK74EJEHNMCKSP7INRVQ7IQVVA", "timestamp": 1411303293000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Make your own patterns from blocks not made from your measurements. What could go wrong? Everything!", "text": "My first look through the book told me something was really off because in every image the fit was off.<br /><br />The beginning of the book provides some very basic information and tells you to make the patterns using the pattern blocks provided. Pattern blocks are foundation pattern pieces used to create very other pattern imaginable. Each designer or home sewer who has learned pattern drafting knows these blocks are unique to the designer or the individual. They are based on dress form or body measurements. So unless you are exactly the same size and shape her blocks are based on you will not get a good fitting garment. The models in the book didn’t.<br /><br />The sewing is sloppy in places. I just can’t understand how bad sewing gets into a book on sewing.<br /><br />Most of the book is instruction on how to make the garments she designed. First you draft her pattern which is what should be in the book to begin with. Then the sewing instructions.<br /><br />At the end of the book there is a chapter on alterations. It’s really hard to alter activewear because it’s surged and cover stitched. But really, if you were using a block based on your measurements there would be little or no alterations needed.<br /><br />Is some good information in the book that can be found elsewhere on the internet or in other books. The draft your own patterns are nothing special. The book is a sad mash of methods. Either teach how to make blocks and style them OR provide the patterns you show in the book. Sloppy sewing is never acceptable!", "images": [], "asin": "1446306704", "parent_asin": "1446306704", "user_id": "AETIQFQNT4JXA46EQHIS3BEBKBMQ", "timestamp": 1563030948358, "helpful_vote": 39, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "I completely lost interest after the first third as it turned into a bit of a romance novel.", "text": "I completely lost interest after the first third of this audiobook as it turned into a bit of a romance novel.<br />The beginning was interesting, though I already have a ton of compassion for anyone of any age who is suffering. I don’t need a novel to wake me up. It just didn’t hold my interest. I strongly suggest you read the other three star reviews before embarking on this.", "images": [], "asin": "0345525558", "parent_asin": "0345525558", "user_id": "AHVSKOZXKLW3C4UQA3ACRWHBHFBA", "timestamp": 1595783792067, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "okay", "images": [], "asin": "168323037X", "parent_asin": "168323037X", "user_id": "AGCDPBODNSQLYYEJZ6XD6GFXRWMA", "timestamp": 1467575762000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I am not sure anything about this book is accidental Three Stars", "text": "It is a very short and quick read. I felt that some of the sentences were incomplete or did not make sense and that is was hastily written. The story is about Jane Watson, an interior decorator who has many sexual conquests. MF, MFMM and so on. I get from the story that she is a nymphomaniac. She seems not to get enough sex. It also appears that she not the type to engage in exclusive relationships. None the less, Jane has had some bad experiences when it comes to men. They would appear perfect for her until they were not. After she put herself in a particularly difficult situation involving two brothers that did not work out so well, she swore off men completely and went to exclusive clubs for women only. There she got to explore another side of her sexual autonomy. When her best friend sees that Jane needs a little help to overcome her loathing of men, she gives her a dare. Which Jane accepts. While Jane is in her girlfriend's home, she is sexually entertained by three men. This experience allows her to overcome her disgust of men. She is able to reconcile with her past encounters with men. This was a bit disappointing as this is the first time I have read anything from this author. I received an Advanced Readers Copy of this book and am voluntarily leaving a review.", "images": [], "asin": "B07G5Y8M53", "parent_asin": "B07G5Y8M53", "user_id": "AHTJLXSFOXVNA5WLBJZ5L6BYTHDA", "timestamp": 1533477256265, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "very hard to follow purpose of story", "text": "I found the story very confusing to follow since it jumped around so much. By the end I would have expected these twisted story lines to have come together for the reader. It did not for me.", "images": [], "asin": "B00K0WNB86", "parent_asin": "B00K0WNB86", "user_id": "AGKXPOM2CWROHXZ5N7Q45ZK6GI4A", "timestamp": 1420330199000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Boring", "text": "This was quite boring at the very beginning. Each chapter got more and more depressing with no aparent rhyme or reason. the distinctions between classes of people were clearly made, but why in the world would youkill everyone off? I found the narrator to be one dimensional and not descriptive enough to be a complete story teller to show both sides. I usually pass my books on to other friends when I find them entertaining. This will go in the basement boxed up with a few others not be be taken out again. Not recommended. If I could give it a 1/2 star it would be more appropriate for this book, closer to a no star.", "images": [], "asin": "1594488800", "parent_asin": "1594488800", "user_id": "AGK4BSYBLHRF5GE7T65SVE6POZKA", "timestamp": 1277578651000, "helpful_vote": 11, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Just a picture book", "text": "&#34;Illustrated&#34; here means taking a bunch of pictures with expired copyright and print them with some un-insightful text.<br /><br />I mean it isn't bad per se. But if you want to make a picture book it should be a coffee table format book.", "images": [], "asin": "1780192878", "parent_asin": "1780192878", "user_id": "AGU5MI6WTF5G4TTXZODETTEIMQ7Q", "timestamp": 1418268417000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not quite what I'd hoped for...", "text": "I was hoping for something that would inspire me. I wanted this book to be either very much \"What the Bleep\" and science-ish, or very spiritual. Instead, it's sort of a series of lectures that cover a lot of ground. For me, it was too general and somewhat repetitive.<br /><br />Frankly, I think my expectations were too high. Others might absolutely love this book, especially if they've attended her lectures or read some of her other materials.<br /><br />She was an innovative researcher and a caring, understanding voice in a field where that's definitely needed. But for me... this book just didn't live up to some of her interviews.  It was okay, but only okay.", "images": [], "asin": "1401910602", "parent_asin": "1401910602", "user_id": "AFVV3PU2DXKRDEJ4DO22IMOFX2UQ", "timestamp": 1663012746651, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not really helpful", "text": "It tells a lot about what the author when through, but very minimal information about what to do about it. The information about what to do could have easily been posted on the web as a short article for free and isn't even that helpful.", "images": [], "asin": "0615395465", "parent_asin": "0615395465", "user_id": "AFFVDDFI7M3NHLKY7ZEW5NLOF5LA", "timestamp": 1298913529000, "helpful_vote": 13, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Even at a dollar this is over priced.", "text": "I love Poe, he is one of my favorite authors. But c'mon people the copyrights on his works have long since expired. You find everything here for free elsewhere on the web or heck even in your local library. You are paying a dollar to the publisher for what exactly? They ran spell check on a collection of works that had already been edited by someone else? In the print world there was a cost to print the book, but here they are just profiting from someone else's labor.<br /><br />I don't want to get nuked by Amazon for pointing out the alternatives here... but you can download these books elsewhere for free.", "images": [], "asin": "B0041T5AOW", "parent_asin": "B0041T5AOW", "user_id": "AF6GUIMIUQ2VQXOIKMDYGM622V6Q", "timestamp": 1361425999000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "As Painful as Being Slashed with a Samurai's Sword", "text": "I picked up this book because the idea of a mystery set in 17th century Japan sounded intriguing but reading it became a dreadful ordeal. Despite the veneer of historical accuracy the language and dialogue used is ridiculously modern. Sano, the novel's samurai detective follows his 'hunches'. Did anyone use the word hunch in 17th century Japan. The book just felt false to me. I felt like I was putting on the cloak of Japan during this period instead of really being immersed in it. A mystery novel like &quot;The Fig Eater's by Jody Shield's truly made me  feel like I was existing in the historical period  she was writing  about. Now if we could get Rowland's plotting together with  Shield's feel for history we could get an outstanding mystery novel.", "images": [], "asin": "0312192525", "parent_asin": "0312192525", "user_id": "AFQ6GBLHZLQKWNOTOWRSP7QD6RKA", "timestamp": 990288099000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Not at all satisfied", "text": "I bought both Inky books and they arrived today.  I looked through them very excited but after perusing every page, I returned both books.  I have been coloring for awhile and I'm used to better quality..  The paper is inferior and some of the pictures look as though they ran out of ink leaving the lines gray (in the middle of an object??<br /><br />Very sad because I wanted to love them.", "images": [], "asin": "1518839290", "parent_asin": "1518839290", "user_id": "AG5H67EJAC77TTTBQ2J7WXLA23DA", "timestamp": 1447790714000, "helpful_vote": 9, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "... let me start by saying the narrator's voice was annoying. I can't stand hearing a grown woman speak ...", "text": "I had the audiobook version and let me start by saying the narrator's voice was annoying. I can't stand hearing a grown woman speak in a baby voice. I wish audiobook would give you the option to choose out of three different voices. I didn't like this narrator's voice in leaving time either it's so annoying. The main character is obnoxious and I truly disliked her. Chick is clueless throughout the whole book. This is the type of book that you have to pray you didn't lose brain cells while reading.", "images": [], "asin": "1476789630", "parent_asin": "1476789630", "user_id": "AH5GTXATL7WHGRLAMCMHLDERAEAQ", "timestamp": 1450224495000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Three Stars", "text": "Just not quite enough to keep my interest", "images": [], "asin": "B0072JJTIG", "parent_asin": "B0072JJTIG", "user_id": "AG6SD4XQUOOTEEOEKLK26Q5KZ66A", "timestamp": 1406613373000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Dated.", "text": "When canned soup and hamburger helper were the new things, this cookbook would have been relevant.  Tupperware parties and church pot luck dinners are well supported in these recipes.  But there is little in this book relevant to modern cooking or Cajun for that matter.  A great piece of nostalgia.", "images": [], "asin": "0961302682", "parent_asin": "0961302682", "user_id": "AFHWKR6ZBC7N7XUQW3VEFU5SW2SQ", "timestamp": 1672512262398, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Gone Girl? No Way!", "text": "Try not to Breathe by author Holly Seddon a fast paced mystery surrounding a girl in a coma for more than a decade and a journalist trying to find out how she got there.<br /><br />The next Gone Girl?  Absolutely not.<br /><br />Amy Stevenson is a typical teenager - until she is brutally attacked and left for dead.  She survives but is in a coma.  Amy serves as one of the novel’s narrators and the reader is privy to her private thoughts and hopes to gain clues about her attacker.<br /><br />Our other narrators include Amy’s boyfriend, at the time of her attack, and a journalist, Alex Dale.  The story unfolds as each character lends their own insight on Amy’s attack.<br /><br />This book, in my opinion, commits the major sin of any mystery novel - it leaves out all the mystery.  If you’re looking for twists and turns hiding around every page turn - it won’t happen.  The story is pretty straight forward from beginning to end and the reader easily sees what’s coming.<br /><br />Amy’s Voice could be a strong addition to the story telling but it completely misses the mark.  Most of her narration is irrelevant as she doesn’t realize she’s in a coma at all and spends her chapters wondering where people are and why she’s sleeping so much.  It’s a major disappointment to not have Amy’s character be a stronger voice.  Most of her chapters could be edited out and not have effect on the outcome of the novel.<br /><br />Alex Dale is a highly dysfunctional alcoholic.  She’s lost her unborn child, husband, and job due to her addictions.  Alex is grasping every last straw on a road to redemption and feels a connection to Amy and her untold story.  Alex is such an alcoholic that she wears diapers to bed because she blacks out so completely at night that she wakes to having wet the bed.  Yet she’s supposed to be able to launch an investigation into a 15 year old case and solve Amy’s case.  Not. Gonna. Happen.<br /><br />The one redeeming quality of the novel is actually the writing.  For a story that misses it’s mark - it’s actually well written.  Every novelist has a novel that fails to deliver and I’m hoping this is Holly Seddons.  I would look forward to reading another of her works with hope that the story was a better one.<br /><br />Try Not to Breath is buzzing about the literary world with a lot of hype in its wake.  Sadly, it just doesn’t deliver. The characters are improbable and unlikable. The story has a lot of potential but it never quite makes it to the goal of being an interesting and well told. In the end this one lands on solidly on the list of books to miss.", "images": [], "asin": "1101885866", "parent_asin": "1101885866", "user_id": "AHWEM7E2PYGW6QCATOWYGZZJ7QPA", "timestamp": 1457036194000, "helpful_vote": 6, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Save your money", "text": "poorly indexed and poorly composed.", "images": [], "asin": "0071776079", "parent_asin": "0071776079", "user_id": "AEDX7ZEIQHPD3BYTLCHCLBGAUGEQ", "timestamp": 1449601537000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Didn't like Bridget, but still a good story.", "text": "Bridget is not a nice girl. There's no way around it, she's just mean and shows no redeeming qualities. I didn't like her and, unlike other heroines in similar books, she didn't grow on me at all. I liked her time in limbo and how she had to come face to face with the consequences of her actions, but the ending was a little rushed for me and seemed too easy.<br /><br />It's a little strange to read a story where you don't particularly like the main character, but enjoy everything else about the book. I liked the idea of limbo and being judged. I also liked the secondary characters, even though stepmother Meredith and ex-boyfriend Liam were unbelievably understanding and kind to Bridget. Would have liked to have seen more of Michelle, one of Bridget's friends, and wish she had a larger part.<br /><br />Gave this one a 3/5 as I liked the story well enough, just not the main character. Also didn't care for the ending, which tied things up too neatly.  Actually wished the book could have been longer so we could see more of Bridget's possible redemption and get a better feel for her motivations.", "images": [], "asin": "0373210280", "parent_asin": "0373210280", "user_id": "AET2QAIIPGMOLRSHAS7FHUPB472A", "timestamp": 1296858534000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Don't read unless you want to be disappointed at the end! No closure with this book!", "text": "Ugh! I started out not invested in these characters, but as the book went on that changed. I started caring about some of the characters in this book only to be left hanging at the end. Be warned that you are left not knowing what happens to a couple of the main characters at the end. I hate when novels do not explain what happens to their characters at the end and leave you with everything unanswered! There are a bunch of weird sexual affairs between all these characters on Red Mountain and the ending is a huge disappointment! I am not sure why this book received so many good reviews. Huge disappointment!!", "images": [], "asin": "0991301889", "parent_asin": "0991301889", "user_id": "AE6JI37Y5PXVAICYLYNRSFYVE4BA", "timestamp": 1522325567229, "helpful_vote": 392, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "lots of technical detail gets in the way of the story", "text": "I bought the book for the overall and personal stories.  Half the book is so technical I just skipped over those sections.", "images": [], "asin": "1617564125", "parent_asin": "1617564125", "user_id": "AHVF65WDKPB6SYTKZZNYRN7MLRKA", "timestamp": 1381273889000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Its good writing, just not my thing.", "text": "Interesting book I guess, and obviously much lauded by many. But its just not for me. I cant really recommend it.", "images": [], "asin": "1781330026", "parent_asin": "1781330026", "user_id": "AEBRN6DMK62MRILSWLLKSQLNOCDQ", "timestamp": 1356000584000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Too Much Freedom?", "text": "This is a review of the unabridged 19 audio cd version of Jonathan Franzen's novel, FREEDOM.<br /><br />Listening to the stories of Walter and Patty Berglund--and the stories of their children, Joey and Jessica, as well as their friend Richard--took longer than usual. It took longer, not because there are 19 cd's in this set, but because I kept pausing in my listening, taking a break from dialogue that was mundane and tedious.<br /><br />The author's examination of American middle-class life, and the struggles of his characters to live with their past mistakes, and with their changing society, was for this listener, an exercise in patience, because the characters simply did not engage me on an emotional level.<br /><br />The characters (one and all) came across as secretly spiteful individuals who, beneath their achieving, bourgeois exteriors, suffer from some sort of low-grade depression, and who take their \"struggles\" in life entirely too seriously.<br /><br />All in all, I thought the story an ultimately sad examination of the question: \"What is the price of too much freedom?\"<br /><br />There have been some very thoughtful, detailed (some glowing), reviews of the book, and perhaps the nuances in the printed novel would have made it more enjoyable for me. But for this version, I can only give three stars.", "images": [], "asin": "1427210497", "parent_asin": "1427210497", "user_id": "AGDYFDP4Q23S6M3U2W3QS5KBDROQ", "timestamp": 1286115110000, "helpful_vote": 4, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Book arrived with a torn dustjacket but shipping envelope was undamaged", "text": "Book itself was not damaged, nor was the packaging.  Only the paper dustjacket was torn.", "images": [], "asin": "0670024570", "parent_asin": "0670024570", "user_id": "AFV4PK4KFACEM7EJALHL325EZ4RA", "timestamp": 1561613402725, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Book was outdated and had an unpleasant smell", "text": "I thought I was receiving their new cookbook, but this cookbook was published over 10 years ago.  The book smelled funny also, and I literally had a wear a mask while handling it.  I returned this book for a refund.", "images": [], "asin": "1467539678", "parent_asin": "1467539678", "user_id": "AGTO3NU3V23ABMOK6XXAAEAWI7CQ", "timestamp": 1650670908241, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Strange story", "text": "Was a bit surprised with this story. What started out like gang buster kind of whispered at the end. It was ok. Not great though.", "images": [], "asin": "B00LWDQO90", "parent_asin": "B00LWDQO90", "user_id": "AEGEVVFBRK2CGZOB7IUHI7WUAQZA", "timestamp": 1426829659000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "boring", "text": "Too boring", "images": [], "asin": "0764956280", "parent_asin": "0764956280", "user_id": "AENSJNNQJYG2LL6CRQTTQXTRFQEA", "timestamp": 1431705262000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great Ending... if you can get through it.", "text": "You can read any number of the reviews before mine and get a good synopsis of what happens, so I'll spare you that again. It's also a movie, so if you're not one to read, you can watch it and honestly get the entire book + some.<br /><br />I went into this book probably with higher hopes than were satisfied, thanks to several friends who read it and said I absolutely MUST read it. Post apocalyptic? CHECK. Bond between father and son? YEP. Cannibalism? ... Kinda...<br /><br />The writing is an acquired taste. In fact, I started it, then put it down for a couple of weeks, then picked it back up and finished it. If you're a fairly decent reader with good apprehension, you can knock this out in a couple of hours easily. And that's even re-reading a few spots where you just go &#34;huh....?&#34; The writing is good in that it is very poetic in the way he describes the character's feelings and what they are seeing. But it is not &#34;writing&#34; as you might be accustomed to in a novel. The author skips out on quote marks when character's are talking, so there's not a lot of warning that you are shifting into &#34;conversation&#34; mode. Which is ok and easy to adjust to. But he also selectively leaves out punctuation. And that gets a bit annoying. There are lengthy descriptions of some things that you might not find important, and short anti-climactic run ins with danger where you wish he'd elaborated.<br /><br />And as for the cannibalism... the movie goes into more detail on that than the book. I was hoping for some Swan Song-esque violent run ins with gangs. I got &#34;Oh gosh... there are some people. Let's hide. Okay. We hid. They left. We can go.&#34;. If you want your characters to ever be in any peril, other than potentially starving to death, this might not be the type of novel you are looking for. It just doesn't really get the heart-rate up as you panic on behalf of the characters. It feels a little like &#34;Cast Away&#34; did to me; Yes, it's entertaining, but honestly it's also a bit boring.<br /><br />I WILL SAY that I cried like a damn baby at the end. Oh my goodness. The end really hit me harder than I thought it would. Probably because I have a kid, but I just seriously lost it. Which is why it's getting 3 stars. It was a great, well written ending.<br /><br />All in all, I don't regret reading it. I'm actually pretty glad I got past my initial opinion of it and gave it a second shot. It's a good way to kill a couple of hours. But I can't say I'll be reading anything else by this author. I love poetry, I love novels... but I guess I just don't like the two to mix. (You got poetry in my novel... you got a novel in my poetry..)", "images": [], "asin": "0307387895", "parent_asin": "0307387895", "user_id": "AHIJA3XH3TPW3QUJXMZ3MFGRUT5A", "timestamp": 1457663026000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "He doesn't like the book", "text": "Bought for my 6 year. He doesn't like the book. It is more for an older child.", "images": [], "asin": "0486472035", "parent_asin": "0486472035", "user_id": "AH2YRCQ2OXEX54UQIN6BYLKQHGBA", "timestamp": 1454790553000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "TIT FOR TAT", "text": "The paperback version is 428 pages full of revenge, retaliation & retribution. Only the final 47 pages are noteworthy. It's a family drama, FULL of angst.<br /><br />Melanie & Abigail were friends in college but they haven't kept in touch. Their lives went in very different directions. Out of the blue, Abi emails Mel & they reconnect. They haven't seen each other in 17 years. Abi had emigrated to America, after graduation. But, she's returning home to England because she & her husband are divorcing and there's nothing keeping her in the States. Mel invites Abi into her home to stay as long as she likes.<br /><br />Abi has no children & fears she's missing out on motherhood. Abi's husband didn't want kids. She had agreed but now she regrets it. Mel became pregnant when she was only 19. Her son (Liam) is the reason she never completed her degree. When she was 27, she met her husband (Ben). Liam was almost 6. Liam had clearly been wanting a dad. Ben was more than willing to be that. Together, Ben & Mel have 2 daughters. Imogen, who is 8 & Lilly, who is 6.<br /><br />Liam & Mel talk about most things freely; alcohol, drugs, sex. But, she's never told him who his biological father is. It was a one-night stand; a one-time fling leading to an unexpected pregnancy. She knows his name. But, she chooses not to tell anyone. No one knows, except the guy she slept with.<br /><br />There's nothing discreet about Abi. She's prone to walking around semi-clad. She has tried to seduce Ben. He's not the type to flirt or experiment with infidelity. He wants her to leave. After all, she's been staying with them for weeks. He frequently hints that he could help her look for an apt. She walks around the house partially clothed, she smokes, she hogs the bathroom & now, she's shagging Liam.<br /><br />She goes into great detail about where they meet up & what they do. She's been spending afternoons in bed with their son, when he's supposed to be in school. This is not what any mother would want. She's 38. He's 17. He's having an affair with a woman more than twice his age. They flaunt their togetherness. They're flagrant, blatant, immodest & brazen. It's causing distress & turmoil. Mel tells Abi she has to leave. Liam moves out, too.<br /><br />Yaddah, yaddah, yaddah...And, so the saga continues. It definitely was NOT my cuppa. I tend to read mostly suspense novels & psychological thrillers. This is neither.", "images": [], "asin": "0778369218", "parent_asin": "0778369218", "user_id": "AHHBAGQYRP4XWVCDF6LWHCGQHOQQ", "timestamp": 1554761508628, "helpful_vote": 24, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good on pyschology of men vs. women (if overly simplistic), weaker on selling", "text": "I ordered this book because the premise and \"pitch\" fascinated me.  The author seemed to imply science behind purchase behaviors of men and women.  What she delivered was far less substantial than what was promised in my humble opinion.  She provides an acceptable analysis of the motivations and behaviors of men and women, but the transition to how to execute against the insights was either fundamentals of understanding your consumer (basic stuff for most marketers), or somewhat over-stereotyped.<br /><br />At the end of the day, it started out as an interesting Men Are From Mars, Women Are From Venus type of ride (as other posters have mentioned), but ended with the \"Gendercyle Selling\" discussion, which I found marginally insightful.  I find books such as \"Why We Buy\" by Paco Underhill more helpful as a fundamental text on shopper behavior.  This book walked the line between pop psychology and oversimplified selling insights.", "images": [], "asin": "1595551050", "parent_asin": "1595551050", "user_id": "AEZ7XOPLPIDM4DLKWQPND46PGODQ", "timestamp": 1247749041000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A Short Read", "text": "Just finished reading this book because we are a large family with a laundry room a bit on the small side. I basically understood, examine your space, look for unused space, get organizing storage, and keep it clean. There are some products suggestions and such that were helpful. Get your stools short people (me), because one thing she suggests is to go vertical in a smaller room, it's a great idea for utilizing space though. Worth a read. I got this book as a free download so I can't complain and I appreciate the suggestions.", "images": [], "asin": "B00DZYBE1C", "parent_asin": "B00DZYBE1C", "user_id": "AEPLVHTXFFVSUDIC6AFKXH5DQ3OA", "timestamp": 1422237327000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "A Reboot", "text": "SPOILERS<br /><br />I bought this book because it's considered to be one of Christie's 10 Best. But I wasn't far into it before I suspected that it was a reboot of Death on the Nile, only told from the male's viewpoint. By the time I got a third of the way into it, I was sure. I finished it anyway because why not? But it was a lazy effort and not what I would expect from Agatha Christie (the &#34;Bad Seed&#34; element was pretty lame as well).<br /><br />Why anyone who had read or seen Death on the Nile would be surprised by any of this is a mystery in itself. There was even a bit of Poe's Tell Tale Heart thrown in for good measure.<br /><br />Okay if one has never read or seen any of the plays/books mashed together to create Endless Night. Otherwise, a pass, and hardly one of her 10 Best.", "images": [], "asin": "0062073516", "parent_asin": "0062073516", "user_id": "AHLSE6WRM5SFQ2HA3WUBYS3XIB5A", "timestamp": 1412541879000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "If you like the fisherman story don't buy this", "text": "Poor translation of 1001 arabian nights", "images": [], "asin": "0192750135", "parent_asin": "0192750135", "user_id": "AGV6VY535AMB6TDHCDQJZB3K2GIA", "timestamp": 1629076287460, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It's an ok story. You're not going to learn anything about opening a place.", "images": [], "asin": "0470068671", "parent_asin": "0470068671", "user_id": "AEH3JENY3JOSRLBQVDJ5O5CLHRQQ", "timestamp": 1526661427367, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "National Jester, National Treasure", "text": "Shales and Miller provide extensive, rarely seen detail of what goes on behind the scenes of America's most influential and enduring comedy television show. This hefty volume includes commentary from almost all the surviving writers, cast members and many guest hosts. Also, much space is devoted to memories of John Belushi, Chris Farley, Phil Hartman, and others who had not survived to 2003 when this book was published. This book's style may not be the easiest to follow, although I had no real problem. I think it highlights the transitions from one era to the next, for example, the age difference between Nealon, Hartman, etc. and Sandler, Farley, Spade, and Rock in the early nineties exposes a generation gap. What is fresh and hilarious to some is merely \"juvenile\" to others.<br /><br />The most prevalent feeling I came away from reading this was probably envy. These people got to be part of a small fraternity/sorority that everyone else envies. Bill Murray is quoted saying,\" Having the experience was probably the greatest thing.\"  Instead reading this book is the closest thing to being a fly-on-the- wall I'll ever experience. The show is a pop culture icon, and since it debuted in 1975, there's much territory to cover.  The book allots large space for the first legendary cast and especially Lorne Michaels. You might argue with that, but I won't. Shales and Miller definitely give you and appreciation for Michaels, love him or hate him his show has stood the test of time.<br /><br />The book is long. It deserved more editing in my opinion, although any fan could pick out cast members, characters, or even eras that deserved more space. It's a dilemma, with so much material, what to include or leave out. Saturday Night Live has constantly reinvented itself and remains relevant even today; there's never been anything else quite like it on TV.", "images": [], "asin": "0316735655", "parent_asin": "0316735655", "user_id": "AGZITV7VCIL4HKIHXNYYWUIJ3MMA", "timestamp": 1299695390000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Not Jodi Picoult’s best", "text": "I wanted to like this book. I have read every one of Jodi Picoult’s books and have loved each one. I struggled and struggled with this one though. It felt too contrived, too far fetched, too predictable, too Danielle Steele-ish. Not her best book at all.", "images": [], "asin": "198481835X", "parent_asin": "198481835X", "user_id": "AHRS5MEL4WY7DT6JS4HZKYHMALGQ", "timestamp": 1609549763819, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Just okay", "text": "This book for us was just okay. It was kind of difficult to read it. WIth many of the children's books, we like the kids to read with us, and I think it would be a long time before a child could read this (probably when they were no longer interested). A theme of the book seemed to be excluding the brother and that just bothered me a bit. I do like the idea of a special daddy and daughter day but it just didn't really work for us. My husband felt the same way.", "images": [], "asin": "1506718086", "parent_asin": "1506718086", "user_id": "AGZZXSMMS4WRHHJRBUJZI4FZDHKQ", "timestamp": 1605556382818, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Handy at times", "text": "A barely adequate handy guide that shows most of what you probably already know (but might forget).", "images": [], "asin": "1939791928", "parent_asin": "1939791928", "user_id": "AEBYFEZHOZ3PZ3WLVXGDEROE4KIA", "timestamp": 1514048018452, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Piano book for Adults", "text": "It is an okay book for a great musician. It has great songs in it but it is for a more experienced musician. Nice.", "images": [], "asin": "0739015478", "parent_asin": "0739015478", "user_id": "AGY4IVVPV7TABO4FLTD24SKXOJLQ", "timestamp": 1412099602000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Thanks to Minotaur Books for my Goodreads drawing copy.", "text": "Retired Paterson (NJ) canine unit investigators Simon Garfunkel & his handler Corey Douglas are hired by the PPD, along with the rest of their PI investigative team, to look into 4 cold cases.  In the 1st one they re-open, they uncover a serial killer. German Shepherd Simon provides the protection as the team's investigators are targeted.", "images": [], "asin": "B092T96DBY", "parent_asin": "B092T96DBY", "user_id": "AHZDVWFWT4QH4YENCWP75UJ3JGIQ", "timestamp": 1647632590709, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Not as compelling as her first book", "text": "I am a clinical psychologist, and I really enjoyed author Gretchen Rubin's first book THE HAPPINESS PROJECT.  I appreciated the organization (addressing a different area each month) as well as the foundation in research on happiness and well-being.<br /><br />I was hoping that Rubin's next book, BETTER THAN BEFORE, would be a sort of follow-up.  In some ways, it is, this time with Rubin more specifically addressing how to manage habits in order to be more happy and satisfied.  Unfortunately, I didn't like this book nearly as much; in fact, I found it was a slog to get through the whole thing.<br /><br />My major problem with this book is something Rubin addresses in her \"A Note to the Reader\" at the start of the book.  She says \"I see habits through the lens of my own experience, so this account is colored by my particular personality and interests.\"  And that is just it--i.e., Rubin's \"study\" of habits is almost wholly based on what has worked for HER and for people she knows.  Her prior book utilized over-frequent quotes from her blog; this one relies on anecdotal stories from her family and friends.<br /><br />Rubin attempts to make her theories adaptable to all by coming up with a theory of what she calls \"the four tendencies,\" or basically, four different approaches to habits.  She calls these the Upholder, Questioner, Obliger, and Rebel.  I didn't find this model, which Rubin refers to throughout the book, to be at all helpful.  Whereas Rubin may find herself  solidly in the \"Upholder\" category, I personally was divided between Upholder and Questioner, and I didn't really respond to the suggestions for either.<br /><br />Using this basic framework, Rubin goes on to create many, MANY more almost arbitrary categories.  Are you a Lark or an Owl (again, I'm in-between).  A Mararthoner, Sprinter, or Procrastinator?  Underbuyer or Overbuyer?  Simplicity Lover or Abundance Lover?  Finisher or Opener?  Familiarity Lover or Novelty Lover?  Promotion-Focused or Prevention Focused?  Small Steps or Big Steps?  And ALL of that is only in the second chapter!  It felt very bogged down, confusing, and often irrelevant, at least for me.<br /><br />Rubin goes on to address the importance of monitoring habits and to discuss the foundation for creating habits.  There are some solid, general tips in this section.  But eventually, she falls back into creating forced categories, such as the series of \"loopholes,\" or exceptions to habits.  Again, there are some good ideas here and there, but they tend to get lost among the clutter.<br /><br />One of Rubin's chapters is called \"Data Point of One.\"  This is probably the best way to view this book--that is, as one person's experience, with suggestions that may or may not relate personally.  Given both that I don't see an overall general application to Rubin's theories and that I really didn't enjoy this book overall, I wouldn't recommend it.", "images": [], "asin": "0385348614", "parent_asin": "0385348614", "user_id": "AFIJLAW3HIOMRUFSWNH54IJ3XQAA", "timestamp": 1537281790800, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Don't bother!", "text": "Very disappointed in this book and the sequel.  Not worth the read.", "images": [], "asin": "0812983459", "parent_asin": "0812983459", "user_id": "AH3YGS2RS6C52FOUZQUS2SFFL6YA", "timestamp": 1454472479000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "not what I was looking for", "text": "I regretted purchasing the book because I was looking for the author's concrete, systemic suggestions of what to do in a time of the dollar's demise.  I was hoping for something like model portfolios or suggested portfolios and felt that in lieu of that the author's emphasis was on why we are in trouble and what the situation is.  I was in the market for what to do about it.  The other information I can easily find on Austrian School websites.", "images": [], "asin": "0470287241", "parent_asin": "0470287241", "user_id": "AFR23CZ5EQTHXFZEMAWFF2WD3SMA", "timestamp": 1212508871000, "helpful_vote": 16, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Buyer Beware!", "text": "Do not buy this book if you already own &#34;Manga Mania Bishoujo&#34; by Christopher Hart! &#34;Bishoujo Beauties&#34; is simply an abridged version and has no new information. &#34;Manga Mania Bishoujo&#34; is MUCH better!", "images": [], "asin": "0385346034", "parent_asin": "0385346034", "user_id": "AFDAIC7GVBC52NRQSDYWMRB3KFNA", "timestamp": 1417836267000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Was happy that this one was free", "text": "Storyline was interesting; characters were somewhat interesting. It moved back-and-forth too many times to really be able to keep track of what was going on. I actually skipped chapters to finish out one story line, then went back and started another story line.probably won't read any other of the books in the series. Was happy that this one was free.", "images": [], "asin": "B00C2WDD5I", "parent_asin": "B00C2WDD5I", "user_id": "AFHTKSEFXDRHXPJOJHMKANMRRB5Q", "timestamp": 1417375650000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Terrible", "text": "This book is a joke. Kids are kids  I found this book disgusting.", "images": [], "asin": "1499807317", "parent_asin": "1499807317", "user_id": "AEU65UDK2ZBDTYRQXJLJ6J6GGOJA", "timestamp": 1657318323242, "helpful_vote": 12, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "its ok", "text": "love it it is exactly what I thought it would be and in great condition .  I will be back for more.", "images": [], "asin": "0980194199", "parent_asin": "0980194199", "user_id": "AGEM7LCQINMDNUTUZW5WRIOO5S7A", "timestamp": 1397121199000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Waste of time", "text": "A list of methods with no substance.", "images": [], "asin": "B01B42KZAW", "parent_asin": "B01B42KZAW", "user_id": "AGRH2LAMMJ32BZLWHG4KQCCBW7UA", "timestamp": 1466872285000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "It is beautifully printed, however", "text": "This is okay as an inspirational book for journaling but not what I thought it would be. It is beautifully printed, however, which is important.", "images": [], "asin": "0811848620", "parent_asin": "0811848620", "user_id": "AGKLK33F6S25KWJIWTLDHHIIPBSA", "timestamp": 1431897325000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Just ok", "text": "Very very small book.", "images": [], "asin": "0486286045", "parent_asin": "0486286045", "user_id": "AGJLYVRHMNDAAZXETGEQGYCHNGRA", "timestamp": 1602821023325, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting plot, surprises, but...", "text": "3 + 1/2 stars actually. It was a bit slow getting through the first third.  We go back and forth through time with the two main ladies which would've been so much better if we could get more in depth with each character.  One of the interesting parts is that we travel back to just after the time of Henri VIII, Anne Boleyn, etc. and women pretty much controlled by the males in their families or marriage.  Mary Seymour's painting is found and it is declared to be a rare portrait of Anne Boleyn because Seymour had been historically missing, presumed dead as a child and not many even knew she ever existed.  But, our current day traveler, Alison, sees it and knows the truth of it because she has been searching for years to find clues that Mary promised her back in time, to leave... Alison, thinking she would still be able to go back in time is trapped in the present looking for a way back to find someone she loved dearly.  There is barely any sex/romance in this but the plot twists are very interesting, surprising!", "images": [], "asin": "1525805991", "parent_asin": "1525805991", "user_id": "AEUDZQDVSZYCHEXQSXLB6NWQTMHA", "timestamp": 1529594466030, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Not what I expected. . .", "text": "I read all the reviews for this book, and thought it would be helpful.  However, I think that this book was helpful for people who are beginning to explore a new relationship.  I in no way think this book is helpful if you have been in a long term relationhip with someone, married, or especially when children are involved.  I believe that she had some very valid points, however, to me it was \"common sense\".  I think this would be ok for a teenager, but in a real complex realtionship, good luck.", "images": [], "asin": "0974145742", "parent_asin": "0974145742", "user_id": "AH3N7PCWWFV5HZ5T2MI4FLY5JYLQ", "timestamp": 1327596661000, "helpful_vote": 5, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Quiz Not Available", "text": "I wanted to take the quiz which is described in the free preview, so I bought the book but the quiz is not available online anymore.  I feel ripped off.", "images": [], "asin": "0446698857", "parent_asin": "0446698857", "user_id": "AG7CHFDFDRNAK3ZNVQ3PRDDO5ABA", "timestamp": 1536526992387, "helpful_vote": 26, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Filthy book, would not recommend it to anyone. Awful language!", "text": "In addition to being full of horrible profanity, the reader on this audio book is recurrently loud then soft spoken, so we were constantly adjusting the volume.", "images": [], "asin": "142337486X", "parent_asin": "142337486X", "user_id": "AHVM226DDPQF3KKXOMLJ3DSOLMGA", "timestamp": 1234364043000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not reusable", "text": "Not reusable", "images": [], "asin": "0312520166", "parent_asin": "0312520166", "user_id": "AGS2WAWRRME4MWPS65Q44426EOUQ", "timestamp": 1594734744306, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "WARNING - War Porn Ahead", "text": "I was so hopeful but what a disaster!  Where to begin?  While it won't win any prizes there are few editing problems - some a/an, verb agreement and case issues.  One huge fault is the lack of a central character.  Instead, it's (literally) hundreds of  Russians, Germans, Scots, Americans, British, French, etc who we meet then say goodbye as they die quickly.  The best parts were the Kremlin and spy scenes  - respites from the endless slaughter.  The REAL problem was war porn - a verbal onslaught of 3rd Battalion, 4th Regiment, 5th Calvary, 6th Brigade, 7the Artillery, units, corpsman, every military rank in existence and detailed descriptions of any weapon used in WW2.  Some may want to dwell on the 20 caliber, 50 mm, 7.2 sites, 50 round, double magazine, FMG-33 X5 British launcher but few want such a description of every single weapon.<br /><br /> Fully 75% of the book is repetitious battle that leaves the reader clueless.  They've never heard of these hamlets (much less streams, hills, valleys, mountains, forests) and have no idea where they are.  Instead of a war theater map with cities we get rough, hand-drawn maps of battles with tiny markings representing action....(&#34;A&#34; - T-94 charge halted by &#34;Black Nights&#34;).  Worse, every single battle is the same - Russians attack outnumbered allies, a slaughter ensues ending in hand to hand combat. This is followed by NKVD executions and a troubled Ike absorbing the news.", "images": [], "asin": "1468145134", "parent_asin": "1468145134", "user_id": "AGO6M4RSQ5YTFXHZBI7YSNGWMUPA", "timestamp": 1445775300000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Will not bother to finish", "text": "I love a book I can’t put down, this book I don’t want to pick up. A real disappointment. I am beyond the point of hoping it will get better.", "images": [], "asin": "B07ZCWWL47", "parent_asin": "B07ZCWWL47", "user_id": "AEOIEDCQ45MZG6EHUEYTJ5OMYRNQ", "timestamp": 1599922829729, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not the best of Tina’s", "text": "An OK read just not as good as the 1st 2 books in the series. Still better than 90%+ of what is available to read.<br />Very few grammatical errors. Good editing but could be better.<br />I did purchase #4 & expect it to be as good as the 1st 2.<br /><br />Honestly everyone should give Tina Wainscott books a try. I believe they would be surprised & pleased with what they find. I was.", "images": [], "asin": "B081DCN64N", "parent_asin": "B081DCN64N", "user_id": "AGMCQXZYNDWXITND7B2MZT6XFPLA", "timestamp": 1595829429321, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not what I expected", "text": "I just received this book in the mail and I am severely disappointed. Pinkalicious is a huge hit in our home, even with my 1 year old son! I really wish I would have read the reviews on here before I ordered the book. After I received the book, I read it as I do all books before I read them to my children. There is no way that I am going to give this to my children or read it to them. It is incredibly negative, gives out negative messages, such as \"Pink is a lonely color.\" \"Pink has no purpose\" \"Pink ice cream is for sissies!\" (when her brother wants a pink ice cream cone)  among other comments, these are just a few I've included. I will be dropping this book off at the goodwill.<br /><br />I also acknowledge that on the cover, after I received it I saw the age group says 5-8. This is something I overlooked before I ordered it. Since my daughter is only 3, it is not appropriate, and I am not sure if it would even be appropriate for her when she is 5.", "images": [], "asin": "0061244058", "parent_asin": "0061244058", "user_id": "AEYDGEQZL5SM23QU4X6RXKXWQ7TA", "timestamp": 1321652878000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "She write funny books but my son does not like the books", "text": "She write funny books but my son does not like the books. Now, I bought the entire series because I like them. But unfortunately my children don't seem to gravitate towards them. It may be that the pictures are not drawn very nice. My kids seem to like vibrant color picture that are more realistic. The rhyme of the stories are funny though. I laugh myself when I read them, but I'm alone on this.", "images": [], "asin": "0671449036", "parent_asin": "0671449036", "user_id": "AHIY3DTYZ6YGRWX3EGWSNQCCZ6DQ", "timestamp": 1443124628000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Some Nice Variations - CD did not work", "text": "The difficulty wasn't as high as I had hoped but there are some nice variations. The CD that came along with the book did not play in a CD player.", "images": [], "asin": "0825890381", "parent_asin": "0825890381", "user_id": "AEON2EGEWJCAZHK7GDI2YHYQ6I4A", "timestamp": 1386259821000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Did not grab my interest", "text": "Did not grab my interest. I did not care what bad things were happening to the \"hero\" . I was bored with the content.", "images": [], "asin": "B004W0BNOG", "parent_asin": "B004W0BNOG", "user_id": "AG6Z5CCXFCU7N2GEMNQS4E7B5AYA", "timestamp": 1453360949000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Pretty good view of the realities of porn", "text": "So here we have the terms &#34;ethical porn&#34; and &#34;responsible viewing pleasure&#34;.  Bottom line is this book takes all the taboos about porn and even sex and tosses them aside.  All things like you are sick if you watch a lot of it are explained off in realistic ways.  Sex is good and sex is healthy and porn can be a mere thing of enjoyment, or education or sexual exploration.  I loved so much about this book, agreed with most of it and found it very refreshing to have sex and porn discussed so openly and realistically outside of societal judgements.  But I did have one major issue that hindered most of the book for me as it popped up in the beginning.  Writer David J. Ley Ph.D. does not believe in sex addiction or porn addiction. I whole-heartedly disagree.  Yes I believe he is correct when he says often the answer is the problem and answer is not addiction but you.  Simply, you like sex.  That can be true for many but there are also those where the pull to porn or acting out sexually is not really about sex but rather other issues like past abuse and much danger can come to them in life without addressing and understanding these issues.  So I found Ley basically took some taboo subjects and in a fun way gave men permission to enjoy their porn and sex.  Sadly I felt he neglected those with underlying issues who use sex and porn as an outlet.  Unless I missed that somehow.  Fun read but merely that for me.", "images": [], "asin": "0996485236", "parent_asin": "0996485236", "user_id": "AHWYSJIMUEIUBSBWKASEA5WOSCGA", "timestamp": 1487518163000, "helpful_vote": 8, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Could have been amazing...", "text": "Could have been amazing. The author takes every opportunity to bash Donald Trump. It gets old. Fast. Ironically, everything he describes is exactly what our Democrat Governor Sissolak (Nevada) is doing during Covid-19. The joke is on the author.", "images": [], "asin": "0804190119", "parent_asin": "0804190119", "user_id": "AFMPCSGT3JPAT4VWGDJL2PQIDNUA", "timestamp": 1589782553893, "helpful_vote": 36, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Disappointing", "text": "Backyard Birds of Florida? What about the water birds? Those are the ones I was interested in identifying and learning more about. Most of the birds in the book I already have information about in other bird books. Was very disappointed that the book didn't include at least some of the water birds I frequently see at a small lake near my house. Does have nice photos and is well organized -- just short on Florida birds", "images": [], "asin": "1423603524", "parent_asin": "1423603524", "user_id": "AEYRK6RHCYZHAXVBEH5UNZ3RB5JQ", "timestamp": 1266548220000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting world, meh heroine", "text": "Roanhorse incorporates the Navajo heritage into a modern fantasy setting.  Thats pretty much her big hook. This is 'American Gods: Native American Edition' mashed up with a Buffy clone.  The book follows the main character who is... surly and unlikeable.  She's basically using Wolverine's old vibe.  There aren't a lot of other characters and they are, largely, bland and unremarkable.  There are a couple of big exceptions, but... it wasn't a fun read.  It compares badly with Dresden Files and even Laurell K Hamilton.  There are far better examples of modern fantasy, notably Tim Power's 'Declare', Sean Stewart's 'Perfect Circle', Daryl Gregory's 'We Are All Completely Fine', and 'Finch' by Jeff Vandermeer, which is a little less fantasy and more horror.", "images": [], "asin": "1534413502", "parent_asin": "1534413502", "user_id": "AEYC2KAUTCSLYZXAMLAZGOW23RBA", "timestamp": 1595112633974, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "\"Interesting concept but left me wanting more\"", "text": "I picked up this book because I thought the concept was interesting, and after reading the first chapter I was hooked, and decided to buy it. I liked the setting of the book - late 1800's in San Francisco, but after finishing the book, I was disappointed with the ending. I felt like I was left with a lot of questions that could have been answered in a simple epilogue of sorts. But overall, it was a different read, and I'm glad that I read something out of my normal genres. Hope that  helps!", "images": [], "asin": "0374128715", "parent_asin": "0374128715", "user_id": "AH6AHWNBLU6TEASQNGEP4OAE525A", "timestamp": 1111358935000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Don't bother.", "text": "You get what you pay for.  I read this for free on Kindle Unlimited, and I did not find it helpful, enlightening or well written.  Don't bother with this one.", "images": [], "asin": "B014HW36UW", "parent_asin": "B014HW36UW", "user_id": "AHZNAULETLLMSLJKXDIFCZJ62EAA", "timestamp": 1466800763000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Nice Illustrations", "text": "Nice illustrations but the writing isn't the best.", "images": [], "asin": "0142413933", "parent_asin": "0142413933", "user_id": "AGRRBYLRDUTWDWGURRCBER4WWUIQ", "timestamp": 1498347700253, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "very explicit, unecessary scenes", "text": "So disappointing. The first 4 books were great and pretty clean. There was nothing explicit in them. Very unexpected turn. This book is all about all the main characters dying to have sex. And it gets very explicit. It's like the first 4 books were written by one person and this one was written by a completely different person. I returned the book and will not continue the series. I wish the author would've maintain the writing style from beginning to end.", "images": [], "asin": "1619636093", "parent_asin": "1619636093", "user_id": "AG7Y5GYKUOGGBGPU3FNYVCZVL35A", "timestamp": 1547000010402, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "This book sucks - boring boring boring!", "text": "I couldn't finish it.  I've read all of Flint's books, but Virginia DeMarce has to go.  Nothing freaking happens...  she just name drops people left and right without giving any reason to give a crap who they are.", "images": [], "asin": "1439133670", "parent_asin": "1439133670", "user_id": "AFG5VPXP4YA6XGWIIA3CW7HFFF2A", "timestamp": 1369106407000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "This would be a good book if it were updated and in color.", "text": "This is okay but with all the full color books out now it is disappointing to see these black and white photos.", "images": [], "asin": "0713525061", "parent_asin": "0713525061", "user_id": "AF2Z667TEVYMHVAONOW5CJISWMIA", "timestamp": 1524006137180, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Nice Enough, But Moves Way Too Slow", "text": "Haven Terra is living the typical teenager's life. Great school, great friends, great \"family\"...life is good. Except for the fact that she was abandoned as a baby, left with scars on her chest and back. Luckily Haven was taken in and cared for by Joan, a nurse, and her coworkers. When Haven and her best friend Dante, along with classmate Lance, are whisked away for a once-in-a-lifetime internship at a soon to be opened hotel/nightclub in the Chicago, it's a dream come true.<br /><br />Once the internship begins, the fact that something is \"off\" is quickly evident. Maybe it's the fact that The Outfit, the beyond glamorous staff, act like freakish robots? Or the mysterious book that seems to be communicating with Haven? But how about the fact that Aurelia, her boss, and Lucian, Aurelia's next in command, act plain creepy? When Haven discovers the secrets behind this dangerous group, she faces it head on, determined to save herself and those she loves.<br /><br />Once again, I find myself at odds, opinion-wise, between myself and so many other readers. The cover is beautiful, with the right amount of foreshadowing. A cover like that is sure to put a book on my radar. And a lot of bloggers I know have read ILLUMINATE and have given it glowing reviews. So I was excited to read this one. I was primed and ready to love it. But, it just didn't happen, for several reasons.<br /><br />First, I didn't feel a \"hook\", a strong plot line that grabbed my attention and demand that I read this book. I knew what the hook was supposed to be. It's actually spelled out in the synopsis. The framework was laid out so slowly that I became bored. I knew danger was coming, but I honestly just wanted Haven to get a clue and get on with it. There wasn't this big \"aha\" moment, where things suddenly got real. Everything Haven learned was through eavesdropping and thinly veiled hints during conversations.<br /><br />Another aspect to the story that did not connect with me was the love interest. Upon arrival at the hotel, Haven meets Lucian. Lucian is of course, impossibly gorgeous, wealthy, charming...you know what I'm saying. I just didn't get it. I don't care how hot I am for a guy, if he always cancels dates, disappears for days, and asks me to give him my soul, that's a huge dealbreaker. But maybe that's just me. Not Haven. She falls hard for Lucian and keeps seeing him despite his efforts to damn her for eternity. Sigh. And yes, it may be possible that the devilish Lucian will have a change of heart. Even so, that's a bridge too far to cross, in my opinion.<br /><br />My biggest issue with ILLUMINATE is the fact that the story moved so slowly. Much of the \"action\" was Haven running errands delivering chocolate, or learning the various duties of her position. She did lurk through the tunnels and crawlspaces of the hotel, but not a lot came of it. The revelations, what there were of them, came so slowly that I found myself easily distracted from the story. Even the big events didn't wow me.<br /><br />I know I sound like a complete grouch after writing this (grumble, grumble). That is never my intention. I wanted to love ILLUMINATE. The author does have a nice writing style. The words and dialogue flowed extremely well. The book had some beautiful passages. I liked Haven, Lance and Dante, for the most part. Overall, though, I found ILLUMINATE to be too long and too slow to suit my tastes.<br /><br />Favorite Quote:<br /><br />\"After a thing like that, worry becomes more than a reflex; it becomes an umbrella shadowing daily life, hovering closer every time someone gets home late or doesn't call when they say they will.\"<br />(pg.5, ARC)", "images": [], "asin": "0547626142", "parent_asin": "0547626142", "user_id": "AGCJDIFFVTYXRE32FSBTYU447K2A", "timestamp": 1330402892000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "The Cat Who Should Retire", "text": "Hardcore mystery fans may find it a bit of a stretch, but if your taste runs to expertly written and very light fiction, you can't do better than Lillian Jackson Braun's \"The Cat Who...\" series. Her detective, reporter James Qwilleran, investigates crimes with the aid of his Siamese cats--and the solutions to the crime inevitably rest more upon intution than actual deduction. The premise sounds farfetched, but Braun's work is usually less fanciful than you might expect, and she presents her eccentric characters and stories with great charm.<br /><br />Unfortunately, the series has been in marked decline for some time now, and THE CAT WHO WENT BANANAS is a case in point.  On the surface, the plot has possibilities: Qwilleran's interest in a local theatre group's production of THE IMPORTANCE OF BEING ERNEST opens a path to death that may or may not be accidental.  Unfortunately, the plot goes nowhere and, although the conclusion certainly points to a specific person as a killer, there is no actual resolution per se.  To make matters worse, the prose lacks Braun's light, bemused touch.  While I think it possible that the book has been written from Braun's basic ideas, I think it very unlikely that Braun herself wrote it.  It reeks of \"ghosts.\"<br /><br />This is a tremendous pity, a disservice to both Braun and the reader.  Newcomers to the series should look to earlier works, such as THE CAT WHO CAME TO BREAKFAST or THE CAT WHO MOVED A MOUNTAIN--but the later titles in the series should be avoided like the plauge.<br /><br />GFT, Amazon Reviewer", "images": [], "asin": "0515139785", "parent_asin": "0515139785", "user_id": "AEIMW2BKNTFJK7NFEWHVASC4LEYA", "timestamp": 1189194292000, "helpful_vote": 6, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Realistic", "text": "A very interesting story about life in a Chinese village around the time of the cultural revolution.<br /><br />It runs the gamut of emotions from tender love to gross incidents.<br /><br />Managing the names were difficult for me at times.", "images": [], "asin": "B00EBO2CQ6", "parent_asin": "B00EBO2CQ6", "user_id": "AHAGWUSNW4PLAGRNJUKK7VSE4A5A", "timestamp": 1642992300730, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "organization", "text": "This book is organized by the color of the plants' colors, so if you're trying to identify a plant that's not blooming, it's very difficult to find.  But otherwise a useful book.", "images": [], "asin": "0025288504", "parent_asin": "0025288504", "user_id": "AFEUXFPQ3FWDKDMSKO775AIRVN5A", "timestamp": 1332620869000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Boring, not what I hoped for", "text": "Content was repetitive, boring. Did not give me the good, new, interesting ideas I was hoping to use in those moments when I run out of things to do to keep him stimulated and learning.", "images": [], "asin": "0876592957", "parent_asin": "0876592957", "user_id": "AEQN66JITNGQOFFIOQALUM5PIB3Q", "timestamp": 1220815090000, "helpful_vote": 7, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Thus author is always good.....this one did not disappoint!", "images": [], "asin": "B003F3PKU4", "parent_asin": "B003F3PKU4", "user_id": "AGBETQDQW6MQZ64KZM7C65X53B2A", "timestamp": 1493429359000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "cant finish the book :-(", "text": "I just couldnt finish the Book.  She went on and on about the Person who pushed her. I love true stories, just not this one :-(", "images": [], "asin": "B00MJD9XO0", "parent_asin": "B00MJD9XO0", "user_id": "AELXTIP72UT7QZ37IJ25HQRRJTRA", "timestamp": 1427489175000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Forget this one", "text": "It wasn't very good.<br />It did have a good lead about another book which is GREAT...WHAT EVERY BODY IS SAYING BY JOE NAVARRO", "images": [], "asin": "1683784391", "parent_asin": "1683784391", "user_id": "AH2LTGGKSL7PWCWTLJ7PIG3W5GRQ", "timestamp": 1498442203395, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Ok", "text": "Drags a bit. Lots of cliffhanger like complications that go  nowhere. Only really gets going about 3 chapters from the end  .", "images": [], "asin": "B00A7H2CZM", "parent_asin": "B00A7H2CZM", "user_id": "AGT6CTSYOYLLT5DP4RB6LNJDTVDA", "timestamp": 1623599276568, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "too old to be viable prospecting tool", "text": "it is amazing how few of these businesses are left ... not a viable prospecting tool.", "images": [], "asin": "1600731023", "parent_asin": "1600731023", "user_id": "AE3NXCX2LJKHMNRERT3ASNAI5TSA", "timestamp": 1448849876000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "No CD", "text": "The book of music arrived OK, but I had to down load the accompaniments!  That is NOT going to work because I will have to stop and start in different places to adequately practice certain parts of measures over and over!", "images": [], "asin": "0634049704", "parent_asin": "0634049704", "user_id": "AEZWFZKHK7VL53XKTWGK4D7FKZLA", "timestamp": 1566704153322, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "questionable", "text": "There were some things I didn't understand.  How did the killer and his mentor go, in less than 2 days, from identifying who to kill to doing the killing, each time?<br /><br />And why wasn't there a run on flea-killing products in addition to the run on black paint?<br /><br />Some of the other things I thought strange could have been a French thing, like not knowing having seen the personnel records of subordinates, not locking your door when going to bed [in either sense], etc", "images": [], "asin": "0743284011", "parent_asin": "0743284011", "user_id": "AFEUXFPQ3FWDKDMSKO775AIRVN5A", "timestamp": 1409167913000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Scattered and uninteresting story line", "text": "I couldn’t make it past page 55. They story sets off in an odd direction and is poorly constructed. The characters are completely unlikable and not relatable. The main character sets off in one chapter how much he loved his wife just to describe his affair with his boss (which he didn’t even like) in the next. Skip this one.", "images": [], "asin": "1542040515", "parent_asin": "1542040515", "user_id": "AHTJV6X6TFULVOIAJV6PQUTXP4TA", "timestamp": 1567915844835, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "A bit disappointing!", "text": "When you have a title like \"Magic Realist Oil Painting\", that is what one might hope to expect, but was not my experience with this book. It should be called mediocre realism in oil painting!  I did like how the author provided step by step illustrations for how he approached and dealt with specific problems in various paintings, however. Painters may find some useful information, but it is not going to be magic.  The quality of the illustrations could be a whole lot better also.", "images": [], "asin": "0823029581", "parent_asin": "0823029581", "user_id": "AHPXRL2V2SJNDWPON4KQHIBAFIOQ", "timestamp": 1303064112000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Require Econ textbook for MBA", "text": "This is required by my professor for the Economics class I am in for my MBA.  I find it to be a lot of definitions and not as much substance.  I have found that some of the abbreviations used in the textbook are not standard therefore when my professor speaks about certain formulas there can be confusion.  Overall the book is better for reference rather than learning the material in my opinion.", "images": [], "asin": "0393912779", "parent_asin": "0393912779", "user_id": "AHHFIETMQDCZ5BKJ73UAHTF24TGA", "timestamp": 1539107903978, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "far too many children", "text": "The Crystal Star opens with a bang, of sorts. The children of Han and Leia have been kidnapped while Leia is out on a diplomatic mission. Leia feels that somehow the Dark Side of the Force must be involved, though the diplomats she is meeting with suggests that it is just the local custom of kidnapping for social status and that it is part of a local tradition. Leia feels otherwise and she is right. The children are kidnapped by the Lord Hethrir who takes the children and tells them their parents are dead. Somehow he is able to block their limited and young ability to use the Force. Meanwhile Han is on vacation with Luke. Luke is searching for missing Jedi and their travels take them close to a planet which is slowly dying and turning to crystal. This is messing with Luke's ability to sense with the Force and Vonda McIntyre gives the reader a very different spin on Luke Skywalker. Rather than the hero, we have a despondent and sluggish man who is not thinking rationally. It is a different spin on Skywalker and may be disappointing to many readers. Luke is less of a presence in this novel anyway as the focus is more on the kids in captivity and Leia's attempts to rescue them. Luke and Han are almost a side plot which eventually gets pulled into the main storyline as it all comes together in a mess of villainy.<br /><br />My biggest problem with The Crystal Star is that it focused far too much attention on the Solo children. Sure, they will eventually become major players in the Star Wars Universe and sure, the readers needs to be introduced to the characters so they don't just show up one novel as fully formed characters who we have not had the chance to get to know, but I think Anakin is three years old, which would put Jacen and Jaina around five. Unless Anakin is only two. I'm not sure, but they are a bit too young to get such a large role. Roger MacBride Allen did a far better job with the children in the Corellian Trilogy which was only set a year or so after this novel. They're no Ender Wiggin, I'll say that much.<br /><br />After the children my complaints have to do with the storytelling. There is nothing wrong with having Luke's mission go poorly, but everything felt rushed. Leia spent so much time wanting to find her children but not really following them until all of a sudden she knows exactly where they are and the kids and everyone end up in the same place with Han and Luke. Sorry, I guess that is a bit of a spoiler, but come on now. Really? The novel might have been better served by focusing soley on Leia and the children with perhaps a cameo at best of Han and Luke. Not the wasted chapters with no real story development, though we do get a bit of Han's past came to light.<br /><br />Bottom Line: Even fans of the Star Wars novels should skip this one. It does nothing, or little to build on future stories (a minor character or two from this book may appear in future volumes as Jedi) and it does not resolve any ongoing storylines. The book is essentially self-contained and reading a basic summary would be just as enjoyable as reading this novel.<br /><br />-Joe Sherry", "images": [], "asin": "0553571745", "parent_asin": "0553571745", "user_id": "AFQDQUAB7UXDT6EMXBTJ3VUOUKFQ", "timestamp": 1160703226000, "helpful_vote": 12, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "SEX Positions?!?!?!?!  Really? Beware", "text": "It says this is for teens and adults, this word search.  It had all kinds of reasonable subjects that looked fun, plants, animals, sports, tv... and this -- sex positions?!  I just happened to flip it open.  I am pretty mad about it.  Sex positions really????  For teens?  I have a 13 year old for whom I was buying it.  Disgusting and really not needed for a word search book. No warning, no nothing.  I am so mad -- jerks!  It should be pulled or have warning placed on it. Zero on this product.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/61rnJ+Lj8vL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/61rnJ+Lj8vL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/61rnJ+Lj8vL._SL256_.jpg"}], "asin": "B09Y5XVN76", "parent_asin": "B09Y5XVN76", "user_id": "AF6HIIHMCF6N2HCEH5F5GFEK2NCQ", "timestamp": 1667852100286, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "A weird dark volume!??", "text": "Simply one of the strangest dark volumes I've attempted to read.  Starts off rational enough and then goes &#34;down the rabbit hole&#34; and never looks back.  A waste of brain energy to try and follow the trail of conspiracy that it tries to convey.  After 2 days sent the book back.  I enjoy a conspiracy (legitimate) as much as anyone but this one is plain &#34;out yonder somewhere&#34;, simply impossible to engage with the book.  First book I've ever returned....", "images": [], "asin": "0929385225", "parent_asin": "0929385225", "user_id": "AGB772F5LFGAVLN6XT4R64DDDOAA", "timestamp": 1397450871000, "helpful_vote": 9, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I was hoping to get recipes for the kinds of ...", "text": "I was hoping to get recipes for the kinds of foods I cook...fried chicken, etc.  I didn't see one recipe that I was excited about trying.", "images": [], "asin": "1942268386", "parent_asin": "1942268386", "user_id": "AGKDKT733TVYCDXGF7A627TS2RQA", "timestamp": 1490915555000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It’s ok", "text": "Seems ok.  Stickers are ok", "images": [], "asin": "0486286045", "parent_asin": "0486286045", "user_id": "AFTZWAK3ZHAPCNSOT5GCKQDECBTQ", "timestamp": 1656081252746, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "How to Housebreak Your Dog in 7 Days (revised)", "text": "This did not work for us; would not recommend purchase.", "images": [], "asin": "0553382896", "parent_asin": "0553382896", "user_id": "AHPL4K6B4WWRQ7T3LL6VRZTXFGNA", "timestamp": 1502100976878, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Full of unpleasantness", "text": "Can't remember when I have read a book with more unpleasant, unsympathetic characters.  Dahlia is a total whiner, hates everybody, especially her family and her doctors, and just seems to wander aimlessly  through life, using men, doing drugs, taking advantage of her wealthy father, and generally bitching and moaning about everything, even before she is diagnosed with cancer.  Just can't bring myself to finish.  I am at the point of saying, \"Just go on and die, Bitch!\"", "images": [], "asin": "B00155EZRI", "parent_asin": "B00155EZRI", "user_id": "AFT6NKVPX6IKUPEMEIRLMICXAJEA", "timestamp": 1645107548267, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "21 month old daughter not interested", "text": "My daughter has been interested in the alphabet since she was 11 months old honestly, can recite up to the letter G but this book doesn't seem to grab her attention. I personally think it's a well illustrated book and has a cute story that should grab a child's attention. This may be just a matter of time for her.", "images": [], "asin": "068983568X", "parent_asin": "068983568X", "user_id": "AGYGSW3DK3F3FUYZ3UL67D6Z5U6Q", "timestamp": 1151236464000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Bad", "text": "Not for me, if you are expecting to see awesome photos you will be disappointed", "images": [], "asin": "0811851176", "parent_asin": "0811851176", "user_id": "AFYYBTQF6546TZYQ7TOST5G6PK7A", "timestamp": 1642478644280, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not worth remembering", "text": "The book is very slow and deliberate in approach, and it’s not surprising that the end leads to nothing.  The book is about things coming to an end and memories of those things coming to an end as well. That’s it!  There is nothing else taking place here, despite what others may say in their reviews.", "images": [], "asin": "1101911816", "parent_asin": "1101911816", "user_id": "AFAOY6VOFHANZBM4LAB2WLC7HB5A", "timestamp": 1669571237813, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Wrong size", "text": "Tiny book size. My fault. I should have read the fine print", "images": [], "asin": "0849948797", "parent_asin": "0849948797", "user_id": "AFPIMFIKAUJWERSI2GM6MJOGQVBA", "timestamp": 1559056756807, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A Decent Read", "text": "Not quite a 4 star read for me. Entertaining and I am looking forward to book 2 hoping she grows as an author.", "images": [], "asin": "B01MF8B19T", "parent_asin": "B01MF8B19T", "user_id": "AGBNP7BNNIQ2HLIYYLQKYXFQHQDQ", "timestamp": 1477940365000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "educational but out dated", "images": [], "asin": "0736092269", "parent_asin": "0736092269", "user_id": "AFWWZHEBW26MNNJDNCKMWLHKUX6A", "timestamp": 1458935951000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not inspiring to females", "text": "This book is trying too hard to be cute and fantastical and ends up obnoxious. All of the characters have the same voice.", "images": [], "asin": "1250010195", "parent_asin": "1250010195", "user_id": "AEN5TB4F7S4WP6D75B6RHGV7JDHQ", "timestamp": 1481932032000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "not great", "text": "disappointing", "images": [], "asin": "0821779575", "parent_asin": "0821779575", "user_id": "AEPXQJ7UVH537LYAKR4ABCUXOJLA", "timestamp": 1421958978000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It would have been helpful if the person selling had ...", "text": "It would have been helpful if the person selling had described this book as one for young people. It is written at a level a 3rd grader could read. I wanted something more substantial.", "images": [], "asin": "1432958704", "parent_asin": "1432958704", "user_id": "AFU73XRYYAEWOAY2EA3ZPDO7CVTA", "timestamp": 1524757325804, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "The books was ok. It was a very short ...", "text": "The books was ok. It was a very short book with larger print. The editing was not done careful enough though.", "images": [], "asin": "3935636229", "parent_asin": "3935636229", "user_id": "AG6O4ZXUWRZSOAHFVPCLYDIEH4VQ", "timestamp": 1465590800000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "HAS NO INDEX...", "text": "I hate giving bad reviews, but this book was a huge disappointment;<br />How can you publish a how-to reference book WITHOUT AN INDEX?!!?<br />Enough said. Sorry.", "images": [], "asin": "0989906795", "parent_asin": "0989906795", "user_id": "AEKSHW34GS3LIP77PMBNK52WHIWA", "timestamp": 1556522113474, "helpful_vote": 18, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Very happy", "text": "It's a really nice book 😊", "images": [], "asin": "1695979567", "parent_asin": "1695979567", "user_id": "AGYSYIPZ2IP6ZKTA52UBOKNCA27Q", "timestamp": 1594105413243, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Disappointing waste of money", "text": "They arent really mazes...more follow the path of each animal to the end type thing...no thinking. The mazes go across 2 pages and are pri ted and bound poorly so the maze lines don't line up at all. My son had so much trouble doing the first one due to thus, he has no desire to do the rest of the book", "images": [], "asin": "1629792004", "parent_asin": "1629792004", "user_id": "AHFFEWJIZOULKRC34O7E6D3KZYDA", "timestamp": 1465645114000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "terrible", "text": "This book is riddled with misinformation. The humor is often in bad taste, there's even a blip in it about using your savings on prostitutes.  I wish I hadn't wasted my money.", "images": [], "asin": "1467941166", "parent_asin": "1467941166", "user_id": "AHVOUZV3URZUATE2FRTLON3T2QKQ", "timestamp": 1344777573000, "helpful_vote": 6, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Questionable choices of what to see, where to eat", "text": "This book was disappointing. It missed great places to visit and things to do while providing some pretty boring and mediocre items. By half-way through my vacation in Norway, I tossed the book into the trash. It was just added weight with no value.", "images": [], "asin": "1786575647", "parent_asin": "1786575647", "user_id": "AHQWXSBC73LYINZHRHS2UYMMQVCA", "timestamp": 1532986281223, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A crumbling marriage set against a historical backdrop", "text": "I have mixed feelings about this book.  On the one hand, the author effectively uses a historical backstory to add interest and to enhance the plot, but on the other, the present-day characters are unlikeable and their seem fairly stereotypical.  Francie and Colt Hart have been married for 7 years, but their bickering has become commonplace.  On a rare weekend drive from their home in NYC to the \"country\"--aka rural Pennsylvannia--they spy an old house with which they both fall in love:  Francie, because it appeals to the poet within, and Colt, because it is a status symbol.  They purchase the house and prepare to move in, but they soon find themselves in trouble with Francie's brother, a new neighbor, and a long-lost relative of Colt's as well.<br /><br />Francie, Colt, and Francie's brother Michael are all irritating characters; it is difficult to root for any one of them in this story.  Each experiences a transformation that is not quite believable given the circumstnaces.  This is even more true for their neighbor, Randy, who acts in a manner which is completely out of character--although this is acknowledged within the book, it still seems unreasonable.  More interesting and engaging are the house's original occupants, the Musgroves, who built Adencourt one hundred and fifty years before.  The author weaves the tale of the Musgroves into that of the Harts through occasional \"historical digressions\" as well as hints sprinkled throughout the house.  This aspect makes the novel readable, making the book worthwhile for the patient and tolerant reader.", "images": [], "asin": "0066211379", "parent_asin": "0066211379", "user_id": "AFIJLAW3HIOMRUFSWNH54IJ3XQAA", "timestamp": 1105108901000, "helpful_vote": 6, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Out of the 8 books we read all semester this was my second favourite. It was an interesting read told in a ...", "text": "Had to read this for my Asian Literature class. Out of the 8 books we read all semester this was my second favourite. It was an interesting read told in a style I wasn't familiar with.", "images": [], "asin": "080483265X", "parent_asin": "080483265X", "user_id": "AHMBHH2ADLZB6T6HYZCILHSAMDWQ", "timestamp": 1485979007000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Was okay, just not one of my favorites.", "text": "Was okay, just  not one of my favorites.", "images": [], "asin": "1939215625", "parent_asin": "1939215625", "user_id": "AHZJ5ITG6V6RQOIJCSL4CSN7YGGA", "timestamp": 1522162878748, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Some Useful information", "text": "Although a lot of what is written you can find on line at Amazon. There are a couple of items --TV for example, it doesn't tell &#34; howto&#34;. I tried to find out what is on Channel 5 in my town, and Alexa doesn't understand. There are some useful tips in it as well. However, there are other publications that are less expensive and I dare say have the same amount of information.", "images": [], "asin": "1532921845", "parent_asin": "1532921845", "user_id": "AFOIRKN6ZMNVYZDD5WUWX7JUOLQA", "timestamp": 1485296295000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Thank goodness this wasn't my Christmas", "text": "Set on the romantic island of Nantucket off the coast of Massachusetts at Christmas time featuring a 3 year old, an abandoned dog, newlyweds and a couple expecting their second child, you would expect a terrific story. hmmmm, What I got was Kennedy, married and 8 months pregnant with her 2nd child. And for some god forsaken reason she wants to inflict on her father the pain of remarriage to her mother - her cold as ice mother - who left their marriage for another man. Oh, and BTW he is already happily newly married to a lovely woman.<br /><br />The novel just lost me there. Also it was about 100 pages shorter than I thought it needed to be a deep satisfying read.<br />Nicole, is a 50 something widow newly married to Sebastian who needs to stand up for herself<br />Sebastian is a 60 something retired Attorney who needs to convict his daughter for immaturity<br />Kennedy is his daughter who really needs to be swept out to sea<br />Katya is the exwife who needs to go to sea with her daughter<br />Snix-Pooh is the dog who needs a new name<br />Max is the tiny tot who needs to get dialogue suited to his age and not someone much older", "images": [], "asin": "1469295857", "parent_asin": "1469295857", "user_id": "AFWVN52MRBWOTIK7UGXBWGOY4HBA", "timestamp": 1387260751000, "helpful_vote": 16, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A good read but not one you'll remember", "text": "The Radix is a good read. simple, fast action plot, not a plethora of characters that you need to track. the plot is somewhat prediuctable once you get into the flow.", "images": [], "asin": "B003IS76DA", "parent_asin": "B003IS76DA", "user_id": "AGSCD574I6CCUDZBQHGDRG3REIOQ", "timestamp": 1363130264000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not What I Expected?", "text": "The question mark in the title of my review is intentional. I just finished, ‘White Like Her,’ & well, it took quite a while. I typically get through a book in about 3 hours, but this one just didn’t grip me like most tend to do. It wasn’t bad by any means... it was just rather dry. Perhaps a bit too drawn out with the ins/outs of research? I can’t put my finger on it yet.<br /><br />Note, I’ve not seen more than a couple episodes of Genealogy Roadshow. I’ve not seen the episode in which the author appears, so I have not a preference towards what aired vs. what’s in the book. Moving on...<br /><br />I found the story’s premise an interesting one. Being a Greek who is the fairest member of the family has put me on the receiving end of the, ‘What are you?’ question—especially as an awkward looking child. It bothered me then, especially since I didn’t understand what was being asked.<br /><br />Unfortunately, genealogy itself bores me to tears. I’ve actually attempted to do research, however, as a screenwriter, I tend to gravitate towards stories that jump off the page. I was unable to feel that, save for very specific parts of this book. I felt the author’s longing for questions that will forever go unanswered, at least by the woman she’d most like to answer them. And yet, just like the author, we’re left with enough speculation about people we’ll never know.<br /><br />Trying to follow the family tree of so & so & why they’re important to a person’s personal narrative is likely incredibly interesting to people naturally interested in genealogy, but for someone like me, speculation & bits & pieces of stories fall flat.<br /><br />The author makes some excellent points about the way Americans look at & discuss race. The book also raises plenty of questions that likely will cause the majority of readers to consider as they relate to their own lives & what they (believe?) know vs. the whole truth. In this way, I absolutely find great value in White Like Her.<br /><br />As a memoir that feels as though it breathes new life in to family members long deceased, well, it didn’t strike that chord for me. As an only child with one parent in their final months - year of life & the other affected by Parkinson’s disease, I have been more interested in family memoirs now more than ever before. I wouldn’t change having read this, but I also can’t say I recommend it above many others.<br /><br />If you love genealogy, this is probably a great choice. If you don’t & you’re not interested in trying to follow stories about how someone’s mother passed for white, left her relatives to do so & later her daughter ends up on a quest to tell you why she’s looking for information on her 3rd great grandparent (and giving you seemingly every detail), leave it on the shelf. It may be interesting to some, but most likely the, ‘some,’ are likely to be related to you. As it’s not my family, nor am I genealogy obsessed, there was too much tedium & not enough meat for my liking.", "images": [], "asin": "B0752WC1CY", "parent_asin": "B0752WC1CY", "user_id": "AFZGH7RCBMR4SFJAH4WDTRQXA7LQ", "timestamp": 1519517332752, "helpful_vote": 10, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Some good writing but not detailed enough for the price", "text": "I would give Economism 4 stars for content; I am taking off one star because is it was too short.  Advertises as 256 pages but there are only about 160 pages. That criticism said,  I still recommend reading it. It's a valuable argument on an important subject. The chapter on health care was terrific.", "images": [], "asin": "1101871199", "parent_asin": "1101871199", "user_id": "AELOWOWNVQ3SO7JG5HA2OZFRJAFQ", "timestamp": 1484327407000, "helpful_vote": 4, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "average", "text": "wasn't what I was after but my fault for not reviewing harder. next time i'll spend more time in review", "images": [], "asin": "0393730425", "parent_asin": "0393730425", "user_id": "AF2G35AGOGNNG7RBZBIVTUMXUCNA", "timestamp": 1358645513000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "NOT A GHOST OF A CHANCE FOR 5 STARS", "text": "This book needed ...  Maybe I should just stop there.  First, it needed a decent proof reader.  Or at least author who cared enough about his readers to reread the final manuscript.  The proofing is horrible.  Sentence structure is generally decent.  Story line?  Definitely out there.  But my main problem was having the timeline skipped around to where I was totally lost.  I don't like being lost.  Therefore, this is a three-star book.  At best!  But with such poor, if sny, proofing, another star down!", "images": [], "asin": "B00DIJYFBA", "parent_asin": "B00DIJYFBA", "user_id": "AH3EKTPRWIFUKUGEHMH3VTQJ32UQ", "timestamp": 1540807567036, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Just when I've gotten away, they pull me back in again", "text": "Like many in California Lane Roanoke has gone there to escape an unhappy family situation in a small town in a less glamorous state. For many their flight was fueled by boredom, or a desire for adventure and the family conflict was caused by controlling parents or an objectionable romance. Lane Roanoke's flight was caused by much more compelling reasons so when she was summoned back to the family farm she would have refused if her grandfather had not told her that her cousin, Allegra was missing. After Lane returned and began searching for Allegra she found only more dark secrets about her family and the repercussions of those secrets to other innocent lives.<br /><br />There are many excellent aspects of this novel. The characters are interesting, and Lane in particular is quite appealing. The descriptions of the isolated town and claustrophobic small town in Kansas is quite well done. The basic premise of the story is distasteful but is understandable given the setting and characters. The author has used the currently popular technique of telling parallel stories from different points of view and in different times skillfully to tell this story.<br /><br />Unfortunately there are also some problems with this novel as well. It seemed obvious to me what was going on in this family long before the novel got there making most of the book rather anti climatic. I also felt there were numerous plot holes in this story. I won't go into details about them because doing so would disclose the plot but others around this family would notice oddities, and it seems unlikely that Lane and her mother would have kept silent for so long.<br /><br />This is still a good read, and well worth overlooking these flaws but it could have been much better.", "images": [], "asin": "1101906669", "parent_asin": "1101906669", "user_id": "AHXWUCTMVBQXDVMDFPA3NO43QF2Q", "timestamp": 1485878884000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "5 Star book, 2 stars deducted for Authors comments in Afterword", "text": "This is an amazing book, very well written and a beautiful story. I thoroughly enjoyed the book, but was so let down by the author's comments in the Afterword (like another reader has said).  It is so sad that our country has degenerated into an environment where nothing is free from political statements. A person's politics are their own business, and should be kept that way. To even suggest that America is currently on a path similar to Nazi Germany is ludicrous. Anyway, I truly did enjoy the book - a combination very touching love story, suspense novel, and history all rolled into one. I couldn't wait to read it every day until I finished it. Highly recommend - except for the Afterword.", "images": [], "asin": "B078JG8M8P", "parent_asin": "B078JG8M8P", "user_id": "AFJWNWYIZBGEASM7UK42OQ2FAOAA", "timestamp": 1553281925074, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It's a textbook...", "images": [], "asin": "0077366743", "parent_asin": "0077366743", "user_id": "AGAIMGSDDKSYGNGSZFC6GUEDRD5Q", "timestamp": 1492540849000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Students can write in journals withot using this book.", "text": "Nothing new; teachers have been having students write in journals for 45 years.", "images": [], "asin": "0325005117", "parent_asin": "0325005117", "user_id": "AEOV4IREUVOHXGBFAOTSHZ6KOATA", "timestamp": 1423860390000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Just Okay", "text": "E.L Doctorow was best known for his historical novels. But the nuance and depth demonstrated in is novels is not present in this rather disappointing collection of short stories. although most of the entries are longer than the average short story, the characters are, for the most part, one dimensional and behave and speak improbably. the stories were okay but I found no stand outs. If you are new to Doctorow, skip these and read his novels. If you are a Doctorow fan, you will probably already be familiar with most of these tales. It is an acceptable collection but not his best work.", "images": [], "asin": "0399588353", "parent_asin": "0399588353", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1470857023000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Lots of yummy recipes just a little to many calories for me", "text": "I only rated this a little low because some the recipes aren't for us.  Lots of calories and carbs.  But they all look wonderful.  Just not so much for our household.  But it has helped to understand this new kitchen appliance and has great tips.", "images": [], "asin": "1623156122", "parent_asin": "1623156122", "user_id": "AHQ3D3YGCPVW2QSQJW4ZPTDZBYJQ", "timestamp": 1484241029000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Confused? You will be...", "text": "Three stars for the illustrations, but zero for the text. Frankly, the text flow makes no dang sense whatsoever. While I accept that there could be some terribly terribly deep and clever secret to the content and sequencing of the text, it is clearly way over my head.<br />The other books in the series are fine, and all deserve 5 stars, but this one should never have slipped past quality control. If you want to wrestle with the Zen-like quality of the non-logic, go right ahead and buy it. If you don't care whether it makes any sense and just want it for the excellent pictures, go right ahead and buy it. Otherwise, give this puppy a miss. Life is confusing enough.", "images": [], "asin": "1570822662", "parent_asin": "1570822662", "user_id": "AEK27DQ54G7PIWW627UHT72TFX4A", "timestamp": 1017731985000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "nice horse pictures", "text": "I love horse & this book has some nice pics but I am a beginner & haven't learned the making fur or animal hair technique  yet.  Whn I do I will dig into this book, hope u can have fun & make master pieces with this!", "images": [], "asin": "0486444651", "parent_asin": "0486444651", "user_id": "AEAJJTYNMR64RK4DY4YUWQKRHJVQ", "timestamp": 1565440438174, "helpful_vote": 13, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Very childish looking", "text": "The artwork was more of a childish looking coloring book. I wasn't really impressed with the artwork at all. That's why I sent all the books back that I bought from this other. I was not impressed at all!", "images": [], "asin": "0976355523", "parent_asin": "0976355523", "user_id": "AFJCQUIY2ZMNYDHRA56AX7ZQLDDQ", "timestamp": 1462324869000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Run of the Mill", "text": "I did finish the book but it was so predictable! No at all a cant put down type of book.", "images": [], "asin": "B00KSPBU74", "parent_asin": "B00KSPBU74", "user_id": "AHISYWMMQ56S6QWLN6F5IXUF4GQQ", "timestamp": 1562644583657, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not a clean copy ... propaganda!", "text": "As many pointed out, this is not a clean copy of the Constitution ... but a right wing extreme group's publication that lumps constitution with out of context religious quotes.", "images": [], "asin": "0880801441", "parent_asin": "0880801441", "user_id": "AE4FYCP4KDF5SLQ5EOIKEXM4XZIQ", "timestamp": 1470705830000, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A good introduction but there are caveats", "text": "I was looking forward to this second edition (2019) of a fine book first published in 2005, but I was disappointed.  The additions/revisions are too insubstantial and perhaps incorporated rather unskillfully to warrant the new edition. Archaeology is proceeding apace on all populated continents, so I would suggest locating a volume whose roots are more recent if you seek a flavor for discoveries in the field.", "images": [], "asin": "0198831749", "parent_asin": "0198831749", "user_id": "AFEZ5USUDVJLGSOB5SVVBUOLVNAQ", "timestamp": 1585606456889, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "average", "images": [], "asin": "0979728304", "parent_asin": "0979728304", "user_id": "AFAG3BNQ3D7QHNYSFXATZZFV6EDQ", "timestamp": 1407780296000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "No good", "text": "Not my step by step,lots of steps missing", "images": [], "asin": "0071463380", "parent_asin": "0071463380", "user_id": "AG6VAR5L6HKCXQRESUBNIY5N3NXA", "timestamp": 1564861197749, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Warped", "text": "Cute book, but unfortunate It came warped so sent it back.", "images": [], "asin": "1846431220", "parent_asin": "1846431220", "user_id": "AFNLYAB7JW4S7HGCMZOD73H2YF3A", "timestamp": 1630362141048, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Read it for the Golf Course Images", "text": "I just finished reading this book. It took me longer than it should have, in light of the suggested reading time of 5.5 hours. When I'm in the midst of a story that's really working for me, it doesn't take that long. I'm giving it three stars because it was good, but I didn't think it was a terribly clever read. I thought it started badly.  Paragraph one should come with a spoiler alert. I spent at least half the book waiting to see what would happen to Merit Badges after I found out that she was going to pay the price for the signature on the contract with the Russian.  It was just a matter of how many pages I had to turn to get my reward. And that's a shame, because I really like the legal aspect of the book, and I definitely loved the golf interest. But I found myself trying to speed through. Also, the book started badly because I thought the main character had a stupid name. Apparently somebody in publishing likes it because there's a whole series of books with Merit in them. That being said, I thought the main character was well developed and generally a pretty smooth character. I enjoyed some of the less easily anticipated turns in the story - such as who the &#34;Enforcer&#34; turned out to be.  And I also appreciated the main character being an intelligent woman who was not really judged by the younger man she kept company with. I thought the title of the book was smart, appealing and a great indication of what the book is really about.  Mark Green's flashback was a flashback for me too.  Did I read that twice? It felt like the 18th hole was a rerun. Did Betty and Bob Tom (another stupid name) ever hook up? Where did that go? If you like golf, you'll be more interested in that aspect of the story then some of the other parts.", "images": [], "asin": "B07DV1RZP8", "parent_asin": "B07DV1RZP8", "user_id": "AEXLVXSUSWXJOYNKQPJYY5SW2ABQ", "timestamp": 1530193878335, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "SOOOO Misleading!", "text": "There are indeed a number of gorgeous hats to LOOK AT in this book. There are only 10 of them TO KNIT. Why? The author picked her favorite 10 from the 1000 she shows and gives the patterns for those. As it happens, I hated all the ones she picked. Regardless of whether you agree with the author's taste or not, it is almost deceitful not to say that you are only giving patterns for 1% of the hats whose pictures you show in the book. I was going to buy this from amazon. Luckily I stumbled upon it in a physical bookstore. Was that lucky or what! Saved myself and amazon the trouble of me buying it and having to return it (as I certainly would have done after I'd seen what was (or wasn't!)inside).", "images": [], "asin": "1592536107", "parent_asin": "1592536107", "user_id": "AHLHKUT2Q7RYDHM3FWFVBPXGYO3Q", "timestamp": 1300585801000, "helpful_vote": 20, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Pretty Book, Ugly Message", "text": "Although this is a pretty book, featuring art work in warm, vibrant colors normally associated with Mexico, the message is objectionable. The free form verse is based on statements made by the artist Diego Rivera which they concede may or may not be true. The author advances Rivera's embrace of communism  and violence as the only alternatives to  vicious and tyrannical  leadership. The tacit approval of terrorism is genuinely offensive, especially in light of the brutality experienced at the Boston Marathon. The verse brags on page 20 that he \"blew up trains\" and bemoans his failed assassination attempt on the then Mexican president. Moreover his treatment of women leaves much to be desired. Apparently it is fine to lie and cheat and have multiple affairs while married. Rivera certainly was not designed for fatherhood, telling his partner at one point he will throw the child out the window if it disturbs him.<br /><br />It is a pity that this book is not focused on what made him famous, his art. It is unfortunate that the author did not use his life as an opportunity to discuss the more challenging elements including politics, poverty and morality. Instead there is just blanket approval.  The verses focus on many ugly things, the deaths of babies, throwing the baby artist in a dung bucket. Instead of focusing on matters relevant to children today such as the importance of following dreams, making a difference, being kind, not judging on appearances, the author opts for pro left propaganda. This is not a book I would give to children.", "images": [], "asin": "0761453830", "parent_asin": "0761453830", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1369347636000, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A Thoughtful Discussion", "text": "The last time I went to my primary care physician I told her I'd been sick with the flu for a few days but had cured myself by taking capsules of oregano oil. I was completely well when I saw her so imagine my surprise when a few days later my local pharmacy called me to inform me that I should pick up my prescription. I had not asked for one so I thought this was very strange. I told them to cancel the order for antibiotics since I didn't need them. The only reason I went to my doctor in the first place was because I needed a refill for my thyroid mediation which I ordered through a website. So what was my doctor thinking? I have no idea! So when I was offered a copy of this book I said yes, because obviously my doctor and I are having communication problems.<br /><br />This book encourages the patient/reader to be a self-advocate. This book is about patient empowerment. It immediately addresses the frustration most of us feel when we go to the doctor and can't talk about all our issues. The author also explains what patients want from a doctor. I especially liked that he says patients want doctors to give them hope. There is also some information on why patients should be more willing to talk about embarrassing or difficult issues.<br /><br />If you are interested in this book then I can also recommend another excellent book on the subject: [[ASIN:0981524036 The Take-Charge Patient: How You Can Get the Best Medical Care]]<br /><br />~The Rebecca Review<br /><br />I received this book free for review. This review is my honest opinion.", "images": [], "asin": "1442220503", "parent_asin": "1442220503", "user_id": "AGWDYYVVWM3DC3CASUZKXK67G6IA", "timestamp": 1377884170000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "I would avoid this book.  Tries to cover every topic, but not enough details", "text": "They give you an introduction to just about every thing you can think of in ASP.NET.  The big problem though is the chapters do not give nearly enough details.  They give you an overview, maybe 1-2 very simple examples, and that's it!  If you are creating a web app for business purposes you will surely encounter many ASP issues that are NOT addressed in this book.  In the end, you will end up buying 2-3 more books to make up for the lack of details in this one, therefore I would advise to pass on this book.", "images": [], "asin": "0471785989", "parent_asin": "0471785989", "user_id": "AFCLDMCZG2LIECLGEHIFPASTT3BQ", "timestamp": 1197218128000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Very Very Sad....", "text": "I was sooo looking forward to this novel. I had read the previous 4 books and loved them! They were amazing and I couldn't put them down. Imagine how hurt I was when I picked up Hunted and could barely get through the first two chapters. The pace was slow. The time line was way too short. They went from escaping HON to going back the very next day? And to make matters worse...Erik turns into a complete jerk, and Heath comes back and is imprinted with Z again?! The only good part of the whole novel was the last few chapters. Although I found the ending to be quite upsetting since they didn't tell you anymore about Z and the gang. I really hope Tempted gets back on track with the other four, and that Hunted was just an in between book to make readers happy that they didn't have to wait so long. I really hope Z gets this guy crap taken care of, and we get to read more about her and her friends lives now that Kalona and Neferet are gone.", "images": [], "asin": "031237982X", "parent_asin": "031237982X", "user_id": "AE2UCHVJQ7C4N3R5RVDIBW4HCHIA", "timestamp": 1243394534000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Watching paint dry.", "text": "This tome is required reading for class I am taking, and reading it is roughly equivalent to watching paint dry. Is fairly easy to understand, and covers material, but every section is split into the risk, controls, and security subheadings, and it becomes tiresome.  Also, if you understand that a &#34;computer year&#34; is roughly equivalent to 25 &#34;people years&#34;, then the six-year-old book is very dated with its 150 computer-year age.  Come on, schools of America, update your courses.", "images": [], "asin": "0471485799", "parent_asin": "0471485799", "user_id": "AHQDBLYCVCUZAFEQ7SUJE7LTLNNQ", "timestamp": 1385004374000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Clean romance", "text": "This is a nice story and had some unexpected turns of events so it wasn't all predictable.  I felt like some of the dialog was stilted or unnatural but I'm not sure if it was the writing or the audio presentation or both that made it feel that way.  I think the narrator did well as a narrator of the story in general but not as well delivering the dialog in the story.  It is a quick read or in my case, listen.<br /><br />Some religious themes<br /><br />No sex, language or violence<br />*I received a complimentary audiobook and voluntarily chose to review it.", "images": [], "asin": "B09H1GLWMR", "parent_asin": "B09H1GLWMR", "user_id": "AGVJKRKBAQ7FYSGF2Y5XA3WPCZNA", "timestamp": 1633633939863, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "So many cards and so many facts!", "text": "It is difficult to put back once your kids take out all the cards like the other reviews said lol! My 8 yrs old daughter loves it she has aspergers and with all these facts to memorize she couldn't be any happier.  :) it's worth it..recommend for the older kids.", "images": [], "asin": "1626863113", "parent_asin": "1626863113", "user_id": "AFCWNGUXIO3VLV56O6XJ7PVG62MQ", "timestamp": 1454196081000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "its oky", "images": [], "asin": "0143108999", "parent_asin": "0143108999", "user_id": "AE6BQHYSTFGJAGWNJHT2QIWLQVOA", "timestamp": 1492201996000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Bait and Switch", "text": "The cover art is not the only one to blame for the bait and switch in this book.  It begins as a horse story with a little fantasy combined with Lynn as a main character.  It sucked me right in, and then it changed.  Maybe I was slow to see what was happening, but it took me to about the middle of the book to realize that this book was not really about Lynn.  I also hate the changing POV, because I find it stressful to be left hanging on a plot line.  I find myself flipping throught the book to find the resolution to the problem, rather than trying to move on to the next plot line.  Of all the characters, Kate's story was the most compelling.  I'd have rather read the entire book from her POV.  I have been reading this book for a long time, because it's one of those you can get sick of, rather than propelling you to read it cover to cover.  I did find the story interesting though.  The ending however left me as dissatisfied as the characters.  The ending was too pathetic for the strength of the players in my humble opinion.  That said as the eternal optimist, I guess I'll order a cheap copy of the sequel.  I still retain some hope for these characters.", "images": [], "asin": "0441016413", "parent_asin": "0441016413", "user_id": "AFLOCB4LEFO2PD2DVFUNVFANGU7A", "timestamp": 1357062031000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Threw this book in the trash...", "text": "Threw this book in the trash where it belongs before finishing it.<br />I can't think of a worse book that I've read in the past than this.", "images": [], "asin": "B0035G037Q", "parent_asin": "B0035G037Q", "user_id": "AHBTEW365SBQGPFFBAD2GCXTZVGQ", "timestamp": 1418013887000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "SMALL", "text": "COULD NEVER READ IT.. LETTERS ARE TOO SMALL TO SEE. GAVE IT TO A YOUNGER PERSON.. WHICH HE COULD NOT SEE IT ,EITHER..", "images": [], "asin": "0311470416", "parent_asin": "0311470416", "user_id": "AFAC7R726WYSYBSFOAKKXOPEO7EQ", "timestamp": 1544433477793, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Maybe the rest of the book is OK but not useful for me", "text": "This is hard to review..Purchased for a specific reason and it was of no help..Maybe the rest of the book is OK but not useful for me.", "images": [], "asin": "1118642228", "parent_asin": "1118642228", "user_id": "AFJEZH4MFBTK5IOEORP6ION4SVSQ", "timestamp": 1428352870000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "surprisingly dull, for who it is portraying", "text": "Where I expected history to play out like a scandalously exciting story, this book instead surprised me with how dull it was. The opening was beyond rough, with a recounting of lineages and genealogies (yawn) that I ended up skimming. Once past that, it continued to slowly plod along, but by then, the interest was gone. Sadly, this book was lackluster in its presentation of what seemed like a dynamic and interesting woman.", "images": [], "asin": "1250033942", "parent_asin": "1250033942", "user_id": "AH5HSMUMRJRDWBPFDQ6G3EAAOSFQ", "timestamp": 1429878193000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Social history only", "text": "This book was well-written, and clearly well-researched by the author. But to my mind, it did not tell the entire story about successes and failures in reconciliation after the Civil War. It is written very much from the standpoint of social history, so if you are hoping to read about leadership and policy decisions on reconciliation after the Civil War, you will not find much of that here. The author presents very well the readings and writings about the war in the 50 years that followed it, and about the underlying social factors and desires that made reconciliation along with true racial equality either impossible or simply unattained. But without telling about the political decisions that helped or hindered, I felt that part of the story was missing. That said, this book ought to be required reading for Confederate nostalgists.", "images": [], "asin": "0674008197", "parent_asin": "0674008197", "user_id": "AEUZ4TBCQAPNIJQRYQJTVHJDYCCA", "timestamp": 1325283042000, "helpful_vote": 6, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Right...", "text": "suicide forest, 4 horsemen, the dumb house, Bambi the dead babysitter hasn't gotten smarter in the afterlife...not has the main character in actual life.  Crazy psychic a Grim, carnage of limited sense other then page count filler perhaps.  I may need some drugs to take while reading maybe it helps.", "images": [], "asin": "B07Y8M5VC9", "parent_asin": "B07Y8M5VC9", "user_id": "AH3UG46GZS66UB4AE5G4HTVVEMYA", "timestamp": 1592094990308, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Adding some more white spaces would help a great deal.", "text": "I just started to read this book and I find it difficult to read because the fonts are much too small and too much text are compressed together in one page. Adding some more white spaces would help a great deal.", "images": [], "asin": "1517435803", "parent_asin": "1517435803", "user_id": "AFV3LQXAPSNWJESK5M4QMSPNVL2A", "timestamp": 1458168802000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Solo no-go", "text": "I bought this book as a class requirement.  Not all of the passages are super clearly explained.  If you're looking to teach yourself, I would suggest something with more explanations and clearer text examples.  If you have a professor guiding you through the readings, you'll be fine.", "images": [], "asin": "041578302X", "parent_asin": "041578302X", "user_id": "AG3IANTE2I4QOSBLXW3UMPJ5LO4Q", "timestamp": 1415642898000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Just OK", "text": "Not as kid-oriented as I had hoped.  There are many far better pop up books.", "images": [], "asin": "0307176266", "parent_asin": "0307176266", "user_id": "AHPKVQKIOHKZXIFNK5KNBWNHWXVQ", "timestamp": 1455055025000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Gawd Awful", "text": "I am a big LKH fan. That's why this got 2 stars. It was basically unreadable. I found myself doing housework to avoid reading it. It had 3 books worth of angel info in the first few chapters. Stuff we should have learned over time or should have had a prelude to explain was forced into the plot line at every other paragraph. The basic story was about a short stories worth. I won't be reading anymore of this series. The lead character is not very charismatic or even likable. I guess every author has a failure sometimes. This is LKH's.", "images": [], "asin": "B091DNXTMM", "parent_asin": "B091DNXTMM", "user_id": "AEIK553GFLND4IGVML5O2M65BFTA", "timestamp": 1634832104430, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "The company preys on artists who don't know any better. Not cool", "text": "The artists pay hundreds of dollars to appear in this book! The company preys on artists who don't know any better. Not cool.", "images": [], "asin": "9189685059", "parent_asin": "9189685059", "user_id": "AF6HJZOWME3PJEEVPOWVXPEEOQOQ", "timestamp": 1502024936836, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "It's Okay", "text": "It was an okay book.  I enjoyed a few new insights but most of it read as an average book you'd read for Bible study.  More personal details about his own journey would have been helpful.  I've read a few of Steven Furtick's books now, and I definitely prefer his speaking over his writing.", "images": [], "asin": "1601429223", "parent_asin": "1601429223", "user_id": "AFVYUCB6TQMSCVZWAW7N3YYEEANQ", "timestamp": 1513282369910, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Very boring to read", "text": "Too technical so my wife tells me. Very boring to read.  The content may be good but you can tell that is was written by an extremely technical individual, just get to the point.<br />Anthony.H<br />Burlington, MA.", "images": [], "asin": "0970245882", "parent_asin": "0970245882", "user_id": "AG5RXT5NOQW7AHG5YP65CCKLIVUQ", "timestamp": 1512437176368, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "King Pin - Leonard Lynch", "text": "I purchased this book by mistake. I got it mixed up with a couple of Elmore Leonard books I was purchasing. I read the first few chapters and deleted the book. I didn't like the writing style. It was based in Europe and seemed pretty stupid compared to the series of Elmore Leonard books I've been reading...", "images": [], "asin": "B005BHQUH4", "parent_asin": "B005BHQUH4", "user_id": "AFJFW44FEUUIFFHPPKZAHMJ6E6NQ", "timestamp": 1350344523000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Maybe of interest to middle-high school age kids.", "text": "Lost interest before finishing. My hubby thought it was a book for young (not mature) readers.", "images": [], "asin": "1602855730", "parent_asin": "1602855730", "user_id": "AEAFIUSMV52ZPFSYG5RIJLLQRKGA", "timestamp": 1440886226000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Silly yet Senseless", "text": "I am all for the silliness of this book; dragons eating a LOT of tacos and what could go wrong at a taco party for dragons?  However, the overall story was incoherent.  It had unanswered questions which bothered me.  It would focus on a topic and upon turning the page it had nothing to do with that topic.  There was no sense of direction.  I thought it was redundant and there could have been better word choices.  Rather than using the word “hate”—“they hate spicy salsa”—a better choice could have been “scared” or “beware.”  Dragons love tacos but they are scared of spicy salsa or they need to beware of it.  It would make sense to me since fire bursts from their mouths when they eat it.  That was my kids’ favorite part.", "images": [], "asin": "0803736800", "parent_asin": "0803736800", "user_id": "AG7EDGL5Y5PRVYT3FWA7LWGGOELQ", "timestamp": 1398218749000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Used it somewhat, but not a lot.", "text": "We used the first 8 chapters, and they were very short. The material was dry & boring (good thing our teacher was loud & loved arguing with his students; this book would have put us all to sleep). Not helpful with indexing, though. Guess that's why we needed the &#34;Alphabetic Indexing&#34; book.", "images": [], "asin": "0078227798", "parent_asin": "0078227798", "user_id": "AHZJZMW4QDCZ2DYKDSQHXSFARU6A", "timestamp": 1372231638000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Too self-serving", "text": "The book let me down in a lot of ways.  I guess it just wasn't what I had expected.  I was hoping for an inside account of how Metallica wrote the lyrics and created the music in a collaborative effort inside their studios (which is the opposite of how they created their prior albums).  Instead I got a book that was 50% of the author patting himself on the back of his previous projects and how Blair Witch 2 was a bomb.  Honestly, I don't care.  I wanted to hear stories about Metallica, not get a run down of your resume.", "images": [], "asin": "0312333129", "parent_asin": "0312333129", "user_id": "AFCLDMCZG2LIECLGEHIFPASTT3BQ", "timestamp": 1167672434000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Terrible book, poorly written", "text": "Horrible book,poorly written by a woman that clearly has delusions of grandeur and when it mattered most, thois delusional woman was not even there for Poppys ( dog she stole from a homeless person) last breath, woukldnt even finish reading returning for a full refund!", "images": [], "asin": "1409195430", "parent_asin": "1409195430", "user_id": "AGHLEKFG44HOVKZZJRPQDZFBST6Q", "timestamp": 1668891858410, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "too horrible to read about.", "text": "too horrible to read about.", "images": [], "asin": "0989794814", "parent_asin": "0989794814", "user_id": "AHFKETSVJTHGUBX56VVMAOJJBPFQ", "timestamp": 1430874061000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not For Me", "text": "I bought two issues and didn't care for most of the stories. So I donated them to my local library.", "images": [], "asin": "1521716013", "parent_asin": "1521716013", "user_id": "AFCNX5RN7AVGMGL2DFFN7KIXVMIA", "timestamp": 1506048701135, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Do not get this book, If your picky with good writers. It sucks", "text": "Honestly, he is a very poor writer. I could barely get half way through and that was a struggle. He just throws out stuff and the timeline of the book was terrible. He only took one chapter to explain who the person was and about the great turning point in life. It was all so vague l. I hated it.", "images": [], "asin": "0062217143", "parent_asin": "0062217143", "user_id": "AETHL4YNZIT3MXX2GU26X7QATKXA", "timestamp": 1493241006000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not a Paperback", "text": "Not a Pamphlet. This a 17\" wide x 11\" tall piece of stock folded in half...PERIOD. Indeed there are six images printed on this piece of heavy stock paper. BE AWARE if you were expecting a \"paperback\" in the usual sense, or a \"pamphlet\" in the usual sense.", "images": [], "asin": "B003X5XE8Y", "parent_asin": "B003X5XE8Y", "user_id": "AE2XXN7P7KB6PICCLODOQKJTMISQ", "timestamp": 1548901554219, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Wrong book", "text": "Not the book I thought it was.", "images": [], "asin": "1631401270", "parent_asin": "1631401270", "user_id": "AGMKJJBWJVVBCTS4WQCKBCWB7XVA", "timestamp": 1564323990095, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not great!", "text": "Okay but not great.  Probably won't read any more of his books.", "images": [], "asin": "B01KI00WV8", "parent_asin": "B01KI00WV8", "user_id": "AFJLT4MSWKEXAG2KBDP26DLKBLCA", "timestamp": 1499730564951, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "not for the average bird watcher", "text": "It is just not enough pictures of the birds them, over thought this book with useless info", "images": [], "asin": "0691154821", "parent_asin": "0691154821", "user_id": "AGKAJYPEBDOE7RCLEZNHREKIFHJA", "timestamp": 1481913989000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It felt like a rip-off", "text": "his is the nor-cal version of the Tate-LaBianca murders, but focused on the Manson clan instead of the investigation as in Helter Skelter. Picked it up on a recommendation, but it just fell way short. It felt like a rip-off. For those who haven't heard of the Manson murders and the antics of his clan at The Ranch, this might be a good read. It left me wanting an original storyline.", "images": [], "asin": "081299860X", "parent_asin": "081299860X", "user_id": "AFASPADHO777YJIZW63IFQRUEKHQ", "timestamp": 1488321228000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Small...same as all Almark books.", "text": "SMALL book but has nice color on a few pages.  It is certainly dated.", "images": [], "asin": "0855240709", "parent_asin": "0855240709", "user_id": "AEKPLJ745WPQAGQ3GCMPZEB5257Q", "timestamp": 1428270864000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Same as all the others", "text": "Exciting, but they all start sounding the same. Like he cuts out pieces of different books and puts them in new ones. Easy read. Fast paced but predictable", "images": [], "asin": "B00132S79K", "parent_asin": "B00132S79K", "user_id": "AF56KB36UURBMQCL6SSYSIA6NMZQ", "timestamp": 1522873778246, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "To risky for kids, not risky enough for adults", "text": "It is a nice childrens style book, In fact after reading a few pages I thought I may be able to read it to my class, It however has one page dedicated to a strippers pole, which kind of kills bringing it into a classroom.  I had thought of blacking out that page, but the stripper reappears at the end of the book.  The book, thought is definitly written in the style of a childrens book, and only offers brief enjoyment for an adult audience, so I have to say that this is a book that couldn't decide on its audience.", "images": [], "asin": "1455523429", "parent_asin": "1455523429", "user_id": "AGU7TQAIBLVDNIHRAG6SMH2SYXRA", "timestamp": 1340780847000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "okay", "text": "This is one of the strangest books ever. I liked the fantasy \"otherworld\" part of it but some parts were a little gruesome but I still couldn't put it down.  I think if I liked horror books I would have liked it more... I just don't know... I'm not sure if I will read the sequels.", "images": [], "asin": "0765385503", "parent_asin": "0765385503", "user_id": "AEF7JGSIQ6HP6BJP2IRBK2AGNJFQ", "timestamp": 1676403897346, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not compelling", "text": "Read 40 to 50 pages in, closed it, and returned it. Story doesn't take off as many mysteries do. I wasn't nt grabbed into the story. Didn't want to keep reading until maybe it got interesting when there are so many better novels to read. Just not for me.", "images": [], "asin": "B08DZCN158", "parent_asin": "B08DZCN158", "user_id": "AH6Z7M2AI6G4S7WNXCGMFEWKG6OA", "timestamp": 1665942818593, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Great Artwork", "text": "This book is great for killing time. Small and easy to carry around. There's even a few hip hop posters. My only complaint is that some of the artwork is split between pages. The publisher really ruined a great Beastie Boys & Foo Fighters poster! I was bummed to not see KMFDM and Rob Zombie.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81zwmnVdZ0L._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81zwmnVdZ0L._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81zwmnVdZ0L._SL256_.jpg"}], "asin": "0811861341", "parent_asin": "0811861341", "user_id": "AHKA72TJNU6TSNCRL4HG3TEWUK2Q", "timestamp": 1674269125044, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Silence", "text": "The novel is from a Norwegian author.  It allows us into the Scandinavian propensity for silence.  Emotions are difficult for this culture and the singular personality is private.  The book is just a reflection of this.  The last paragraph in the book says it all<br /><br />There are in a matter of some two hundred words, 12 uses of “I” . The wife is locked into herself and cannot communicate with her tragic husband.", "images": [], "asin": "1590515951", "parent_asin": "1590515951", "user_id": "AEBQAWDORFJXUBKRBQ5SQKLJATSA", "timestamp": 1677474756731, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not a Favorite", "text": "I bought this book because I was looking for early-reader chapter books for my 2nd grader and found this book on a reading list. I was disappointed. The book, published in 2003, had references to technology (e.g. VCR) that I had to explain. Bo's caretaker also spends a lot of time in the story working on an Angel Tree project. I know what that is, but without my explanation, my child would have had no clue. My biggest problem with the book, however, was that it contained several phone conversations heard only from one side. The reader has to infer the other side of the conversation -- a big challenge for an early reader, in my opinion. Because of this, I would not recommend this book for a young reader.", "images": [], "asin": "1589802179", "parent_asin": "1589802179", "user_id": "AGWV6YA5K5RKM5NZYIL3KJXYGYZA", "timestamp": 1371418119000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good Ending", "text": "From the other reviews, I suspect I might like some of the authors' other books better than this one. But this is the one I have to review!<br /><br />The book is sad and disturbing most of the way through. There is so much that is held back and hinted at for far too long. I'm not a good judge of what most pastors and their families are like, but I do hope this situation is not typical.<br /><br />The ending is very positive and very satisfying. And the writing is clear, descriptive, and compelling. It just takes too long to get there. It could very well be because it was a screenplay.", "images": [], "asin": "0310336104", "parent_asin": "0310336104", "user_id": "AHTCZREGHT66ADD7SA4C3RUX2OQQ", "timestamp": 1336493504000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Is this for real?", "text": "I am an amateur beginner skater and even I know that you don't start with toe loops and lutzes.  The author really needs to research training a bit better.  Professionals also do weight training, aerobics, etc when not on the ice.  So, this book was totally unrealistic.  Also, \"fiancee\" was a caricature with no depth and from page one, it was not believable.  I liked the little girl, but she sounded way too mature for her age.  Cross this author off my list.", "images": [], "asin": "1335041087", "parent_asin": "1335041087", "user_id": "AEGQUNGTTEXOP6YQCZNVFVYB5MYQ", "timestamp": 1546146856921, "helpful_vote": 8, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Do not buy!", "text": "Printing was smeared and unreadable.", "images": [], "asin": "0448405202", "parent_asin": "0448405202", "user_id": "AEGLZ2Z2TKKYSIYA5CAINBFM23UQ", "timestamp": 1607111800416, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Horrible", "text": "This book and all of the others, writen about the Darcy's are not worth wasting your money on.  Garbage, complete garbage.", "images": [], "asin": "1402236999", "parent_asin": "1402236999", "user_id": "AF7HOIOOUYOQ3Z2ZYMQ5JRLBRURA", "timestamp": 1307390342000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Book", "text": "Book was in good shape with no signs of wear.  It's just OK content-wise.  I totally love the concept--each chapter has a different \"bad girl\" of the bible!  Great for bible studies, as it has thoughtful questions at the end of each chapter.", "images": [], "asin": "1578561256", "parent_asin": "1578561256", "user_id": "AGJ3QMMAQPZNGT454WQMUQQXFXJA", "timestamp": 1318182670000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Just couldn't finish...", "text": "I sadly could not get into this book. I typically always finish a book, no matter how much I dislike it, but I had to break my usual rule... I have literally spent months trying to get through this book and I finally gave up about 25% of the way through. The story is so slow and the plot and the characters are not interesting or engaging. I love Sarah Addison Allen and this book is sadly not in any way comparable. Don't waste your time - a good book shouldn't be this hard!", "images": [], "asin": "0345538552", "parent_asin": "0345538552", "user_id": "AHBSAEV65SZJFHDTPWDS47KKC2YA", "timestamp": 1400808645000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Not \"In Action\" at all.", "text": "This book comes highly recommended, and it seems to be a comprehensive course on JQuery. But there are very few hands-on examples. It presents one feature after another, showing how each is used. If you learn best by walking through hand-on examples (as I certainly do) then I suggest looking elsewhere.", "images": [], "asin": "1935182323", "parent_asin": "1935182323", "user_id": "AF3EIZ7UPUUVALOLX5BEFVMPZW5Q", "timestamp": 1305751601000, "helpful_vote": 6, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "its okay", "text": "I think I like the original one the best.  Its cute and nice read for kids.  The repeating phases make it easy for beginners to read.  Its not very difficult for kids to read and follow along.  You probably can try and sing to this song like the original version.  The pictures are nice.", "images": [], "asin": "0439737664", "parent_asin": "0439737664", "user_id": "AEGJUYLQ33YRTQUTCMCJNFRQ7SMQ", "timestamp": 1605383804818, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Plodding Private-Detective Procedural With Lots of Information About Japan and Japanese Oribe Ceramics", "text": "As a work of fiction, PACIFIC BURN is, unfortunately, much more &#34;tell&#34; than &#34;show&#34;.  Much of the narrative consists of factual descriptions of geographical locations in Japan and (to a lesser extent) San Francisco, of forensic suspect-sketching techniques, of &#34;nuclear mafia&#34; groups and nations, of potentially poisonous fugu blowfish dishes, and of Japanese Oribe ceramic art.<br /><br />The plot itself is a superficial private-detective procedural, with action scenes pretty much limited to investigator Jim Brodie's personal martial arts encounters with a Japanese assassin, some FBI/CIA/HAS strongmen, and a District of Columbia &#34;fixer&#34;.  The story skips quite discreetly over Brodie's &#34;action&#34; with his new girlfriend Ries.  Rather distressingly, Brodie seems quite indifferent to the deaths of various policemen and bodyguard employees who lose their lives while guarding Brodie and/or his clients.<br /><br />In the novel, Brodie (a San-Francisco-based Japanese art dealer and half-owner of an inherited Tokyo private security firm), is called to a Napa Valley crime scene to translate the chanting of a Japanese child whose father has just been murdered.  The victim turns out to be the son of Brodie's artist friend Ken Nobuki, who is due to arrive soon in San Francisco to kick off an international art trading agreement, the Pacific Rim Friendship Program (PRFP).  There is no obvious motive for the murder.<br /><br />When exiting an inaugural PRFP meeting at San Francisco's City Hall, Brodie and Nobuki are pinned down by a sniper's fire from atop the nearby Asian Art Museum.  Brodie escapes without injury, but Nobuki is shot in the head and is hospitalized for the duration of the novel.  After Brodie thwarts an assassin's attempt to finish off Nobuki at the hospital, Brodie arranges for protection of Nobuki's daughter Naomi, an anti-nuclear-power agitator who is in Washington, DC.  Naomi may be targeted for death by the Japanese &#34;nuclear mafia&#34; that has been white-washing the Fukushima nuclear power disaster and making only cosmetic changes to the management of nuclear power facilities in the aftermath of the disaster.<br /><br />Brodie then flies to Japan--leaving his young daughter with a neighbor at very short notice--and sets the employees of Brodie Security to work on protecting Nobuki's family members and on identifying the reasons behind the apparent ongoing attempt to wipe out the entire Nobuki family.  Brodie shows himself to be quite oblivious to personal danger, even though his firm's reputation (and that of its employees) hinges on his remaining alive.<br /><br />Although the story's ending is somewhat surprising, the plot usually just plods along, following Brodie's investigative activities and his martial arts fights.  Brodie's character is rather thin--his fatherly thoughts and arrangements for his daughter's upbringing and safety aren't particularly convincing, and his background doesn't seem to fully support his awesome martial arts prowess.  In fact,  I didn't like Brodie well enough to want to read the other series books, even though I'm generally a sucker for any mystery/thriller with a San Francisco Bay Area setting.  For all of the above reasons, I rate PACIFIC BURN at 2 stars (&#34;I don't like it&#34; on the official Amazon scale).", "images": [], "asin": "147679488X", "parent_asin": "147679488X", "user_id": "AEYGPUCRKH7G4VM22FM3VAKSQ23Q", "timestamp": 1457046351000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Not entertaining at all", "text": "This book moves at a snails pace and the ability to put it down and never pick it back up is throughout.  Nothing gripping. The writing style was pretty unimpressive.  At part 2, I was sorry I wasted the time on part 1.  There seems to be no story here.  I am mystified by the positive reviews. It builds slowly to nothing.", "images": [], "asin": "B07GNV4F4S", "parent_asin": "B07GNV4F4S", "user_id": "AGTWA7QI4CO6CPCQAUL4GHHMCMQQ", "timestamp": 1559510459360, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Ex-military survivalists and mercenaries are the bad guys and the good guys. It is difficult to tell who is who. Be prepared!", "text": "There is a suspenseful enough plot. It is a distraction that much of what he writes about feels researched rather than experienced. I am a little more than halfway through and I have just now gotten to the &#34; aha &#34; moment : paranoid survivalist/ mercenaries run amok. This book is carefully crafted to reveal what the author believes to be The Real Danger that we softie liberals have never imagined. The media are misleading us and our government will not protect us. Citizens - get your selves ready!", "images": [], "asin": "B017LGAKEQ", "parent_asin": "B017LGAKEQ", "user_id": "AFRA262XKZ4RWRQSKYKGUYS62IZA", "timestamp": 1466995345000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "A Confusing Read - Think I \"Needed\" Something More Elementary & Linear", "text": "Having recently read the author's book about Stalin, and found it very enjoyable/educational, I was anticipating having a similarly positive experience with this book.  However, I found the style in which this book was written to be very confusing and disjointed.  Some of this I am sure is attributable to the author's presumption that his audience possessed a certain basic knowledge of Soviet/world politics at that time - an &#34;expertise&#34; I admittedly lack.  But even given my level of &#34;ignorance&#34;, I found the author's constant intermixing of information (often conflicting) obtained via official documents with undocumented witness statements and recollections, not to mention statements and recollections of relatives & friends of these purported witnesses, as well as his (the author's) personal speculations, to be neither educational or enjoyable.  I did gain one thing from the book, however - an interest in learning more about the apparently complex, and somewhat eccentric, woman behind the throne, Tsarina Alix.  As a matter of fact, I'm going to &#34;go see&#34; what Amazon might have to offer on this very topic now that I'm done with my review. .", "images": [], "asin": "0385469624", "parent_asin": "0385469624", "user_id": "AFY3OQLDOOJGKNXN2PGUUDXY6LTA", "timestamp": 1427787905000, "helpful_vote": 5, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Painful to Read.  Unsparing in Similes.", "text": "Whether or not the book was particulary funny, I couldn't tell you.  I didn't get past the first chapter.  Every other sentence was a simile.  \"I was raving mad like a castrated bull during mating season.\"  \"I was confused like a Weight Watchers meeting being held in a Dunkin' Donuts.\"  \"It was like..., I was like..., They were like...\"  Not that mine are hilarious, but I'm not writing a book using similes as the foundation.  The writing was frustrating.  It's a good thing I only borrowed it from the library.", "images": [], "asin": "0812969014", "parent_asin": "0812969014", "user_id": "AGKCJTBZILKCG6GI2LN453Z42BFA", "timestamp": 1164424236000, "helpful_vote": 16, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "No.", "text": "Too dull for my taste.", "images": [], "asin": "B085NY9BW1", "parent_asin": "B085NY9BW1", "user_id": "AEXYAYKO4JSMM7ALG7YY3P67FXVQ", "timestamp": 1592314989007, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "and is wonderful example of how not to treat others", "text": "And the moral of today’s story is: Be a persistent needy pain and you will finally get the cantankerous insufferable grouch to be your friend.<br /><br />The strange friendship between Ant and Honey Bee was curious, and is wonderful example of how not to treat others.", "images": [], "asin": "0763668621", "parent_asin": "0763668621", "user_id": "AGQW6RM5XGSFRAA4ZUXRZYVLLCCA", "timestamp": 1418050898000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A Good Concept, but...", "text": "Great book for those going gluten free. However, Just tried to make the sugar cookies. Dough didn't come together after refrigeration. Why? There's no egg in the recipe. I added two large eggs to the dough and wouldn't you know,  the dough came together.", "images": [], "asin": "1484084276", "parent_asin": "1484084276", "user_id": "AECZ2JVRPY3YDOR2BQA757OD6OWQ", "timestamp": 1482612209000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not for beginners, but has hood ideas", "text": "Haven’t used it really. Has given me good ideas for things to weave, patterns, etc. not especially good for beginners.", "images": [], "asin": "1596681756", "parent_asin": "1596681756", "user_id": "AGGB7W427K3WAEEWOX3C3XRPABEA", "timestamp": 1653308974486, "helpful_vote": 0, "verified_purchase": true}
