{"label": 0, "rating": 3.0, "title": "Odd books with good stories", "text": "My son loved all the stories but the  ending or resolution to each story is very odd. It just stops in a random spot. The stories aren't linked", "images": [], "asin": "2897181060", "parent_asin": "2897181060", "user_id": "AHPSIKBA42OVTWD66QJCSOZVKNVQ", "timestamp": 1417794134000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Enjoyable but not one of Teasdale's best", "images": [], "asin": "B010VJECGC", "parent_asin": "B010VJECGC", "user_id": "AG7LK7OEHCVAZLODI7MNAQ466UGA", "timestamp": 1466199614000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Ok book", "text": "Ok book", "images": [], "asin": "B00JMMIJQE", "parent_asin": "B00JMMIJQE", "user_id": "AE2B2DY6ZJVF7KZ2KG24IN7BHF6A", "timestamp": 1544319427079, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Just not good", "text": "This is not well written. Lacks any depth. Hard to believe an editor reviewed prior to publication. The table of contents is exceptionally detailed ... however, the pages aren't numbered! Not recommended.", "images": [], "asin": "B0BQH5Y93R", "parent_asin": "B0BQH5Y93R", "user_id": "AGHZV2ICF5BGL2NLQ2BJWYBKQIOA", "timestamp": 1675563429276, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Pretty good I guess.", "text": "I could have done without a the medium, seance stuff, but overall it had a pretty good story and character development.  Don't think I would recommend it to friends though.", "images": [], "asin": "B015MB10KA", "parent_asin": "B015MB10KA", "user_id": "AGR7SL4WVIVHGVPLFMBFCNTKELHA", "timestamp": 1518346876595, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Political—do not buy", "text": "Didn’t expect political lies to be injected into a compilation of music. Book was a gift from my son or I would have returned immediately. I do not recommend.", "images": [], "asin": "076113963X", "parent_asin": "076113963X", "user_id": "AEXPSKVYTYBT4F7RGG7QKKMRM66A", "timestamp": 1579453336860, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Bored my 5 year old, annoyed my 7 year old", "text": "Did not hold either of my kids' attention.  They loved \"Up in the Garden, Down in the Dirt.\"", "images": [], "asin": "1554988810", "parent_asin": "1554988810", "user_id": "AGL6CXWEZY6S42FT2ZT3OOLX32JQ", "timestamp": 1619865311166, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "not my cup of tea bla bla bla bla", "text": "just boring , never seemed to get going anywhere, could not even finish it. No  adventure, no  real  character ,blah blah", "images": [], "asin": "B007FGJP0S", "parent_asin": "B007FGJP0S", "user_id": "AEEMDKHAJXADTYCPO4OFVMKEGCFA", "timestamp": 1383589913000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good idea, but  story was too complex for a 5 year old.", "text": "Read a review and thought this would be perfect for my 5 year old granddaughter.  Nice concept, but the dragon's platform was a bit too confusing.  Overall, it was a disappointment.  Will keep for the next election", "images": [], "asin": "1938063635", "parent_asin": "1938063635", "user_id": "AEVL4EULXTSF3TL2MUDDGOKUDWAQ", "timestamp": 1461615506000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Hard to see past the white hate.", "text": "If I could give this book of \"poetry\" zero stars, I would.<br />Mexican Heaven, page 35: \"...just kidding there are no white people in heaven.\"<br />Disgusting, divisive, and hateful.  If a white person were to say that about any other race, they would be labeled a racist.  They certainly wouldn't win awards and be paid mega bucks to be keynote speakers at conferences.  I guess because he is Chicano saying hateful things about whites, it makes it okay...", "images": [], "asin": "1608469549", "parent_asin": "1608469549", "user_id": "AHXKRYSQAGMSGGEMB64HDU5RPK6Q", "timestamp": 1571280206959, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "good read", "text": "enjoyed except one page was ripped out of the start of chapter28 page number is391.", "images": [], "asin": "0316493775", "parent_asin": "0316493775", "user_id": "AETTK6F2YMWLZ2ZX3KGJJDEZEWFQ", "timestamp": 1594755154343, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Really?", "text": "Should have been either MUCH shorter, say 6-8 paragraphs, or a real novel.  Preposterous, sappy, story line over written for this length, under developed for a real read.<br /><br />Felt more like an early morning writing exercise than a real short story.  Perhaps it was the beginning of a novel that the writer decided to stop developing?.  Purchased on recommendation of other readers.  Thank goodness it was free", "images": [], "asin": "B09YRT2KGW", "parent_asin": "B09YRT2KGW", "user_id": "AFOIJLK24S7SIVLNHEZYMUXJC77A", "timestamp": 1657845233944, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Written as a teen / young adult story", "text": "I couldn’t finish this book. The author’s voice verges on “silly  romantic” as she writes of serious, wartime espionage coupled with handsome men. I have read a lot of nonfiction accounts of the OSS and SOE, so the name dropping was disconcerting. Okay, so the “girls” get their man at the end and presumably live happily ever after. The book gives historical fiction a bad name.", "images": [], "asin": "B089GSG9K5", "parent_asin": "B089GSG9K5", "user_id": "AHKH4V3OLINUDTG2CNUO26UW4O3A", "timestamp": 1618975965703, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "Too detailed for me", "images": [], "asin": "B00GUUI4TI", "parent_asin": "B00GUUI4TI", "user_id": "AF73QNT2RUJFHHOLXZ4QVV4BDAUQ", "timestamp": 1417291039000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Tempe Fugits & Fidgets", "text": "This is the least appealing of the bones books I have read. Were it not for the opening chapter of Temperance's childhood friendship and the resolution of her mysterious disappearance plus plausible family circumstances both well-written, I would have rated this helper-skelter plot lower than 3 even a (gasp) 1?. Why  sister Harry appears; the excessive characters and their thin relationships to what may be the central, tawdry plot, excessively detailed; and the scattering of details about intertwined stirrings for both men of several earlier tomes, an ongoing limpid theme replete with needy grown children now dividing the foci of Tempe and the ongoing marriage with Pete, the Unfaithful;and stirrings for the rival Ryan's affections ...all are Cuisinarted throughout the book.<br /><br />I did like the setting, as I love Montreal, and added several patois phrases to my French vocabulary. Was it worth the read...only for the Quebec and Cajun cultural notes. It appears that the rationale is to now pull strips with character names, horrible crimes against girls as young as toddlers, then attempt to weave the into a book. Editor! Editor! Save some trees: 1/3?could easily have been cut. I have another book, but hesitate to read it...or even donate it: tawdriness does not become the author. Nor the reader.", "images": [], "asin": "B000UG78LS", "parent_asin": "B000UG78LS", "user_id": "AFCRAJH5ERKQMUQZRKUGEVQR775A", "timestamp": 1409023335000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "A worthy health plan", "text": "I'm vegan, not a raw foodist, but love raw \"cook\"books to help me find delicious summer recipes. I requested this review copy from the publisher for this reason, and because I love to try out and explore new vegan cookbooks. Heather Bowen walks one through a 21-day raw food plan, with charts and food plans to make sure your diet is well-balanced. If you want a good primer to help you to eat raw, this will give you a quality foundation.<br /><br />One of my favorite \"recipes\" was \"Make Your Own Smoothie\": pick among a checklist of bases, fats, fruits, veggies, superfoods, supplements, sweeteners, etc. etc. So much fun to mix and match your own!  I appreciated all the different smoothies in the book, and the cashew and coconut yogurt recipes.<br /><br />Quite a few recipes call for a dehydrator, which is not something I've found necessary for my kitchen at this time. Of course, since raw food veganism requires lots of nuts and seeds, the recipes are much higher in fat than I enjoy. In addition, the cookbook has very few photos. Raw food really shines when one can see the rainbow!  These reservations aside, this is a quality cookbook and food guide that would be a worthy addition to your shelf if you're looking to eat more raw.", "images": [], "asin": "B086N4TPC8", "parent_asin": "B086N4TPC8", "user_id": "AHY3ZZMHIMZXA3SRUN2UGS44R5PQ", "timestamp": 1589851979123, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Intricate set of events - interesting but, at times difficult to follow.", "images": [], "asin": "B0037471XK", "parent_asin": "B0037471XK", "user_id": "AHO6GFPH2WV2UDZDSBESLDZAMDPQ", "timestamp": 1448137758000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Just a coffee table book", "text": "I'm a big fan of Bear Grylls and the Man Vs. Wild series. That said, this is an interesting read, nice pictures, but it's not much more than a picture album for the Man Vs. Wild series. It makes a very interesting coffee table book. But if you're looking for a true survival manual, look elsewhere (The SAS Survival Handbook is excellent). \"The Kid Who Climbed Everest: The Incredible Story of a 23-Year-Old's Summit of Mt. Everest\" is also a book by Bear Grylls and is very good.", "images": [], "asin": "140132293X", "parent_asin": "140132293X", "user_id": "AHBXOWBEKC4PLEM7U4V33OELIANA", "timestamp": 1232094766000, "helpful_vote": 21, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Overpriced", "text": "Only black and white pictures.  Very unattractive.  Too little information, especially in the trivia section.  Totally overpriced", "images": [], "asin": "B08MSHCH4H", "parent_asin": "B08MSHCH4H", "user_id": "AFDVKJJILHHMLZRZBDNPJKBTOL7Q", "timestamp": 1632707981125, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "just a girl frozen in a tubby a crazy guy who's so in love with her he'd rather have her dead and frozen-that's ...", "text": "no story,just a girl frozen in a tubby a crazy guy who's so in love with her he'd rather have her dead and frozen-that's pretty ridiculous.I've heard kids tell me lots of better stories.", "images": [], "asin": "B0043RSKBC", "parent_asin": "B0043RSKBC", "user_id": "AGMY5ILV6BKWZ22ADOMCTFNSSH5Q", "timestamp": 1459101988000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "If you're dead - you're gay!", "text": "It isn't just that David Bret wouldn't know a fact if it bit him in the butt. It's that he's absolutely obsessed, more than any half-baked crappy writer in history, to 'revealing' the gay side of anyone who ever lived. As far as Bret's concerned, Clark Gable was gay, which accounts for the 'tormented' crap in the title of this garbage.<br /><br />Honestly, the only one truly tormented is Bret. I sure do hope he's out of the closet by now. Maybe then that will save God knows how many trees and keep endless dollars in the wallets of the book buying public as Bret can just focus on his own homosexuality, instead of dragging the bodies of dead Hollywood movie stars through his big lies.", "images": [], "asin": "0306817519", "parent_asin": "0306817519", "user_id": "AH3KEDBPWJGL24RNC6VTJOJGYXSA", "timestamp": 1471710982000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Very disappointed.", "text": "The sound did not work. Replaced batteries with no avail. Very disappointed.", "images": [], "asin": "0785379770", "parent_asin": "0785379770", "user_id": "AHAEVLXXWSQ3FGHLLCDLX3PJPQKQ", "timestamp": 1475451000000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "My husbands favorite growing up.", "images": [], "asin": "0448482339", "parent_asin": "0448482339", "user_id": "AH5E3MCX3GGB3JOJXEYYL37KR7TQ", "timestamp": 1499489542155, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Where are the photos?", "text": "Not my favorite cookbook.  Missing photos of so many recipes.  Some of the ingredients are hard to find.  Love hearing Stephanie's point of view though - she is so fun!", "images": [], "asin": "0811874478", "parent_asin": "0811874478", "user_id": "AE54Y7RMTIQDRVRID5N6737D4ADQ", "timestamp": 1562858486431, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good Workbook, CD's are Too Fast and Redundant", "text": "This product is good for audio learner in the car or on the go, but it is not great for visual learners who need more tutelage and slower speaking pace. I have had 4 years of high school spanish and intermediate medical spanish and sometimes I still didn't even understand what they were asking me to repeat on the audio cd's. I liked the workbooks because they forced you to learn new skills and recall the skills you've learned previously. However, the cd's are very redundant and say the same thing over and over again, but I can't understand what they are saying because they speak so fast and need to slow down!", "images": [], "asin": "0307478599", "parent_asin": "0307478599", "user_id": "AGIFTJN3ZPLCLP247OUNGV27CASQ", "timestamp": 1525637923927, "helpful_vote": 4, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "The illustrations are the best part of this book!", "text": "The illustrations are the best part of this book!  The story isn't really much of a story as it is a bunch of questions and answers...such as &#34;Which mommy helps you look for your kitty&#34;... It does not tough on any of the tough parts of describing a family with 2 mommies at all.  I think my children got more out of talking to me about it than the book.", "images": [], "asin": "0982636660", "parent_asin": "0982636660", "user_id": "AEYBI3JT2E6M5WVV457G27YXXQUQ", "timestamp": 1450313393000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "lost in translation,", "text": "There are seven books by Robert D. Kaplan sitting on my shelf.  'In Europe's Shadow' will not be joining them.  Kaplan admits to a certain fascination with Romania, so it is hard to say whether he is too close to his subject, or too remote.  Large chunks of the book are dictated by what someone else has said, obscure histories that Mr. Kaplan seems to think we should all know and love, some of them written by very odd characters, members of fascist regimes and the like.  The author is a major geopolitical thinker and has served on a number of think tanks, but in thunking this one up, he appears to have out thinked himself.  There are even some attempts to peddle 'Europe's Shadow' as a type of successor or sequel to the highly respected Balkan Ghosts; instead what is served up here is a mere ghost of a book.", "images": [], "asin": "081299681X", "parent_asin": "081299681X", "user_id": "AGKHDQO3Q74QAOVEQEIZ3BMSDEBA", "timestamp": 1454433284000, "helpful_vote": 11, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Deceiving title.  No different than any other modern guitar book.", "text": "The far, far majority of rock musicians have always been male.  I honestly have no idea why, but that's the hard truth.  As a result, few companies ever bothered to market something specifically for female musicians.  However, by the mid-1990s a significant number of guitar-driven bands with one or more female musicians had made waves on the scene (White Zombie, The Breeders, Veruca Salt, Smashing Pumpkins, Jewel, Hole, Cheryl Crow, etc.).  And today, a higher percentage of women can be seen in the local music scenes and even in working in musical instrument stores.<br /><br />Tish Ciravolo took advantage of this new target audience and created Daisy Rock: a line of guitars and basses created for female musicians.  Not only are they made to look more \"girly\", but since women are physically different than men, the guitars also have a different contour in the body and the length is scaled smaller.  It was a smart move on Ciravolo's part, and one that was long overdue.  For women who want to start playing guitar or bass, I highly recommend checking these out.<br /><br />It was all because of Daisy Rock's success that Ciravolo was approached to write a guitar book.  Hence, \"Girl's Guitar Method\".  It's a guitar book/CD for beginners with some flowery graphics and...well, unfortunately that's about it.<br /><br />In and of itself, the book is a decent guitar lesson book.  It includes what you normally find in other guitar books: tablature readings, instructions on how to tune, construction of chords, a chord dictionary, and modern examples (\"alternative music\" and the like) to listen and play to, structured into lessons that start at the most basic level and get increasingly advanced.  But strip away the curvy fonts and other girly doodles, and you're left with a book that's really no different from the numerous other guitar books on the market today.  To me, that makes the title rather deceiving, especially to those just starting on the instrument.<br /><br />In all fairness, I don't see how one COULD write guitar lessons for women specifically.  It would be like trying to write a book called \"Men's Crochet Method\", by taking a random crochet book and putting Freddy Kreuger's sweater on the front cover, maybe an irrelevant centerfold inserted too.  Same book, just repackaged in order to market it to a new audience.  Unfortunately, \"Girl's Guitar Method\" is no different.  I'm sure some will blindly assume I'm a chauvinist and mark this review as \"not helpful\" just out of spite, but for those who value your playing more than fancy marketing, you may first want to check out some of the much more informative (and cheaper) guitar books out there.", "images": [], "asin": "0739029061", "parent_asin": "0739029061", "user_id": "AGTG2DYQZGC4ONNSPPK7CDITKQAQ", "timestamp": 1063688623000, "helpful_vote": 24, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "the enjoyment of which will depend upon how much you like ...", "text": "Nonessential personal essays, the enjoyment of which will depend upon how much you like the author and want to get behind her books or more noteworthy public appearances such as being on Colbert for starting an independent bookstore in Nashville or being protested by Christian fundamentalists for allegedly writing a pornographic, drug-filled book about her friendship with author Lucy Grealy. I liked her tales of obligations to others that you don’t hear from male authors: caring for her grandmother and for an elderly nun who’d taught her in first grade. I liked the unexpected personal stories such as passing the entrance tests to become an LA cop, her attraction to men who smoke while riding bicycles and how she (in her 40s) lied to a little deaf girl to steal her puppy. The practical-but-not-inspiring Kindle Single writing-advice essay called The Getaway Car is included here. Grade: B", "images": [], "asin": "006235566X", "parent_asin": "006235566X", "user_id": "AEUSDGHFKZK6IA5NPQP4QGNT4IFQ", "timestamp": 1431913905000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Nice material and photos but it is a very short book.", "text": "Very nice soft cover book with good information and nice photos but very short. This is a companion to a traveling display of the fashions to different venues so that must not be a very big display. Left me wanting more. With shipping, I ended up paying way more than I believe it was worth at $25. I would think more like $15.", "images": [], "asin": "057815837X", "parent_asin": "057815837X", "user_id": "AHLJV2M4NGKYJP27BUKFBHLRVOUA", "timestamp": 1488682510000, "helpful_vote": 6, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "Didn't like the pictures but it can be informative. I returned mine.", "images": [], "asin": "1517314739", "parent_asin": "1517314739", "user_id": "AG6ARCJHQVUBE6ZEHZZTUYP5S5WQ", "timestamp": 1465150015000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not Up To Bittman Standard", "text": "I got this as a Christmas present for my wife. For the past six weeks she has followed its recipes and directions without achieving promised results. The bread always comes out dense and chewy, close to consistency of fruit cake. Natural yeast method has not worked so I can’t recommend the book. Save your money.", "images": [], "asin": "0358539331", "parent_asin": "0358539331", "user_id": "AELYKR2ZAUW35JPFS3TNXKY4HSLA", "timestamp": 1644524804242, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Forget this one", "text": "I started to feel I was missing something in this novel..until I read some of the reviews. Thank goodness I am not the only person who rated this book one star. It is terribly depressing AND I kept thinking it would get better.I felt sick, knowing her husband was going to leave her and wondered how she didn't realize this. Gosh, what a waste of $ and time. I too am tossing this book after haveing read just a few chapters.", "images": [], "asin": "0316069310", "parent_asin": "0316069310", "user_id": "AGZ76JPBJHK2DT74DV3M6XTDCY7A", "timestamp": 1269134821000, "helpful_vote": 5, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "A high school English student writes more eloquently than Mr. Isaacson", "text": "I'm sorry to report that, despite his associations with Time magazine and CNN, this author cannot write.  This biography appears to have been written by a high school sophomore.  Tangled shoestrings of comments from Steve Jobs, plus those of the people who knew him, are juxtaposed with sudden references to \"I\" (e.g Jobs says he liked King Lear, and \"I asked him why he related to King Lear...\") If this is an interview, write it as such.  If it's a biography, as touted, then please remove yourself from it, oh, writer.  The sentences are stilted, forced, and lack any creativity.  A pure statement of facts--a facts sheet, if you will--would read more eloquently than this work of non-fiction.  As it stands now, \"Steve Jobs\" is a cobbled patchwork of facts with conjunctions and prepositional phrases thrown in to link them. It's downright painful to read.<br /><br />If one were unaware that this was a published biography, and merely read it under the misrepresentation that a high school student turned it in for their English class project, it would be both believable, and highly defensible. The wisdom of Steve Jobs is lost in the hands of this \"professional writer\", who casts a murky haze over the biography just as a death shroud obscures a corpse.  It is so poorly constructed, so rudimentary in its prose, that it can only come \"alive\" in television sound bites, where it barely breathes with gasping shallow respirations, as if it was a boat-landed carp.<br /><br />A powerful operatic aria for Mr. Jobs, the one all Apple fans long for, this work is not.<br /><br />Mr. Jobs accepted this biography, unreviewed and unedited.  Mr. Isaacson was given free reign.  This degree of candor is appreciated from Mr. Jobs.  But, God rest his soul, perhaps he should have asked for an advanced copy, if for no other reason than to have his own Apple marketing department perform life-saving surgery to repair it into something readable and intelligent.  It certainly would have made reading this 630 page doorstop more enjoyable.<br /><br />As it is now, the message of the genius, Jobs, is undecipherable in the apple sauce of this text.  It is quite concerning that the New York literati down at Simon & Schuster publishing house would allow this unedited drone into the print shop. Perhaps releasing it in the month of Steve's passing was more important than making it an actual book.<br /><br />Books are meant to be read and enjoyed, now and forever, and serve as a basis of learning for current and future generations.  This biography, my dear readers, serves little purpose other than as a weight to hold down my papers when I open my window.<br /><br />This is a sad tribute to an imaginative icon; the writing is dreadfully uninspired.<br /><br />I strongly urge the Kindle owners to download the sample pages before purchase to see if you can stomach the writing style, if there is one, for 600+ pages.", "images": [], "asin": "1451648537", "parent_asin": "1451648537", "user_id": "AEPLHCEMDY74XNN6GUSZWQ74YQEA", "timestamp": 1319486372000, "helpful_vote": 131, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Didn't like", "text": "Not very helpful to a beginner. Returned.", "images": [], "asin": "1861087950", "parent_asin": "1861087950", "user_id": "AFGU3S4OP6NRLJWFIG6BU2MGKLDA", "timestamp": 1470682488000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A well written, challenging book but not that enjoyable: Spoiler Free review", "text": "As the other reviews (and critics) have noted, this is a well written work with lots of interesting ideas and very high quality authorship.  Additionally, the plot and concepts are neither derivative nor obvious.  But (and you knew this was coming), is it a good book?  Should I buy it?<br /><br />The honest answer is- I don't know.  If you are looking for a challenging work which repeatedly asks you to question one's perspective in a well crafted plot line, then hit \"buy\".  If you are looking for an enjoyable novel with characters you can like or could even remotely relate to, or a book that doesn't seem to be a bit of an academic exercise at times- then I suggest passing.<br /><br />This is going to be a polarizing book, one that you as a reader love or put down 70 pages in, probably never to return.  For only $9.99 for the Kindle version, I think it is likely worthwhile to find out which of those you are.", "images": [], "asin": "1569479755", "parent_asin": "1569479755", "user_id": "AFSBI5RB44ME3CG7MYWOW4IO7MVA", "timestamp": 1327007848000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "This was the biggest waste of money", "text": "This was the biggest waste of money.  These are not coloring pages but black and white pictures that have been grey scale lightened.  Very disappointed.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71KNhVBLdDL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71KNhVBLdDL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71KNhVBLdDL._SL256_.jpg"}], "asin": "1532772998", "parent_asin": "1532772998", "user_id": "AHTCBTXFWS3Z6FN24FROO7OGQLZQ", "timestamp": 1515977788334, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Demonstrably Inferior to the Bates-Orr Concordance of the same title.", "text": "Far inferior to the Bates-Orr concordance of the same name.<br />Bates-Orr published theirs several months before Cesare, and had also started<br />befoore Cesare's team; and were the only scholars specifically<br />authorized by the Oxford University Press<br />to use copyrighted text in The Simpson edition of Jonson that Oxford had published,<br />In addition, Bates-Orr used superior editorial techniques, which included<br />additional tools for scholars:E.g.,  &#34;See&#34; and &#34;See also&#34; references for cases of variant<br />spellings and obscure words. The Bates-Orr text is scarcer, since it is the accepted<br />standard reference concordance. The &#34;Cornell Concordances&#34; apparently;y wanted<br />a bit of a monopoly on Elizabethan and Seventeenth Century English poetry.", "images": [], "asin": "080141217X", "parent_asin": "080141217X", "user_id": "AEH3PXGD6JLTWGMBV4GFWQS2G7VA", "timestamp": 1381956109000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Don't fall for the juicy title", "text": "I was super excited to read about this topic, being set in California.  The story is one that could be told in a few short chapters, and while it is based on a true story, the author makes uninteresting presumptions (admittedly) about the lives of it's characters.  I kept forcing myself to read this slow book hoping it would get better, or that I was missing something, but as much as I wanted to like it, I feel compelled to share.  I feel sorry for the author as it is clear by her consistent back and forth between the story and the addition of her thoughts (sometimes quite random & unrelated), that she spent a lot of time researching the individuals in the book, consistently coming up mostly empty handed.", "images": [], "asin": "0593182928", "parent_asin": "0593182928", "user_id": "AFFRNQ2UFDEJRLEPA2TKICWZVS5Q", "timestamp": 1657246376941, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Same old drawing book.", "text": "Normally I don't but into \"how to draw\" books. Drawing skill comes with practice, not by reading. I heard this was a good one so broke down and bought it (with a few others) they all collect dust on my shelf.", "images": [], "asin": "0823003124", "parent_asin": "0823003124", "user_id": "AHBPQP5MQEOK52OQ2PENIVCFJGQA", "timestamp": 1224074667000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not your usual What If? goodness...", "text": "I love What If?, but this volume was a let down. The art and stories were not enjoyable for me. Definitely a skip on this buy.", "images": [], "asin": "1302916157", "parent_asin": "1302916157", "user_id": "AFC4P5NTDOY4U4D2F5Q4BTFLE5YA", "timestamp": 1562106886094, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Boring and Slow", "text": "This book had me snoozing from page one.  I read this because of a recomendation and hope that my recomendation will stop someone from reading it.", "images": [], "asin": "B0050DIWFC", "parent_asin": "B0050DIWFC", "user_id": "AF23PFZY7B6W2QJABM3OTZIUIYUA", "timestamp": 1379532415000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Lovely but miss the mark", "text": "These books are beautiful and I myself like them a lot. But that's not what I'm looking for in a baby book. Baby photos, particularly faces, are the most developmentally appropriate types of books for the age 6 months took about 1 year give or take. So that part is great. But, they went for style over function. All of the babies I tried this series with failed to connect to the grayscale images, especially the ones where the child wasn't looking at the camera. And why would they? What they know of people and the world is in color. At this age, connections to everyday experiences and reality are what matter. They aren't wanting to be artistic or have a nuanced view of it, because the real thing is very fresh and new for them and still needs exploring. I ready wanted to like these, but can't as they fail in their ultimate purpose.", "images": [], "asin": "1575424223", "parent_asin": "1575424223", "user_id": "AEMRLJUULSJXXAUVU2YLEDCB7FLA", "timestamp": 1515046291431, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Very boring to read", "text": "As another reviewer said, this is just a list of what he did.  Very boring to read, no emotion or passion.  But ll this proves to me is that he was a much better chef than author.  He as certainly a giant in the culinary world.  So the one star is only a comment on the quality of the writing.  I expected insights into what it was like to work in a kitchen in his day.  I was also disappointed that his many menus were not translated.  Great man?  Yes!  Great book? Definitely not.", "images": [], "asin": "0442023960", "parent_asin": "0442023960", "user_id": "AH3RQLMMOLWZMMMUPCBXSCNPGDFQ", "timestamp": 1415212271000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Good book but the Kindle version has low res photos", "text": "Good book but the low res photos in the Kindle make it hard to repaint or model anything with these photographs.  So sorry, two stars.", "images": [], "asin": "B0922ZRRWT", "parent_asin": "B0922ZRRWT", "user_id": "AEGC2QSYLBHBM57PBIZRUZALCT7A", "timestamp": 1656705562774, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Amazing, but without any protection during the travel", "text": "The book by itself is amazing, just that they send it without any protection, so it arrived with some damages all over, which is a shame, because it is amazing.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71WdzmOlKML._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71WdzmOlKML._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71WdzmOlKML._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71nS8ybErYL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71nS8ybErYL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71nS8ybErYL._SL256_.jpg"}], "asin": "0446574759", "parent_asin": "0446574759", "user_id": "AEV43PYB3W3ESFNT4BMVAD4ONHLQ", "timestamp": 1619212703346, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "For making lye soap.", "text": "Good book but mostly for lye soap making and not melt and pour.", "images": [], "asin": "1939754038", "parent_asin": "1939754038", "user_id": "AHSHZ4LMK5T2MPKGZEQMNO6YUSXQ", "timestamp": 1581716298517, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Hokey Little Story", "text": "This story kept me reading but it was so unrealistic and maybe that is why I have it three stars.  I like stories that are realistic.  This was entertaining.", "images": [], "asin": "B004AYDC9I", "parent_asin": "B004AYDC9I", "user_id": "AGTTPYR2M7KM5FD5JGIKAGVAFR2Q", "timestamp": 1547835608984, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "NOT A GAME GUIDE!", "text": "This was the worst buy I could have ever made on Amazon. This is literally a paper guide on how to download an app. I paid $15 for a stack of paper with mainly pictures on it. This is not what it was advertised to be.", "images": [], "asin": "0359683258", "parent_asin": "0359683258", "user_id": "AF5BARTB3EJ6I55P7543RXKNBQ6Q", "timestamp": 1582643684368, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It's ok", "images": [], "asin": "1501100106", "parent_asin": "1501100106", "user_id": "AEX7BUM2FSAXMZLFQM5GKODUL6XA", "timestamp": 1481330371000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "YAWN!", "text": "You're gonna need tons of Earl Grey, but not because this book is British/Victorian style, but because it's BORING and you'll be struggling to keep your eyes open and stay interested.<br />Don't get me wrong - it's well written and the incorporation of science is intriguing, but it's long-winded first person and heavily driven by dialogue. It's just not my type of book, and I struggled to get through it.<br />Product arrived quickly and is what I ordered, so I have no problem with the seller.<br />I'm gonna go take a nap.", "images": [], "asin": "0679751343", "parent_asin": "0679751343", "user_id": "AHXAP7OGYITMTLBATJTT4A44Z7ZA", "timestamp": 1618443155850, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Like a phone book, way too much to read cover to cover but great for reference.", "text": "Not for reading cover to cover, way too much material.  Better for reference or reading specific sections.", "images": [], "asin": "1119310563", "parent_asin": "1119310563", "user_id": "AFOOI5ACUEN6EQJGID72GT2LDZAA", "timestamp": 1476717538000, "helpful_vote": 14, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "My fault, but I did not realize that this ...", "text": "My fault, but I did not realize that this was a flip/tear daily calendar.  The puzzles were not rated for difficulty and most of these are too hard for me.", "images": [], "asin": "144946548X", "parent_asin": "144946548X", "user_id": "AGPLAGOKDSBSGPOPRLCWIKGBPR5A", "timestamp": 1455300718000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Mislead or misread.", "text": "From the description given I expected this deck to have truly ethnic, indigenous artwork. Either I misread or selected wrong deck because this deck is still heavily influenced in its artwork which represents european and not ethnic individuals. The clothing has ethnicity, but not the individuals. Card stock is decent, sizing is as described.", "images": [], "asin": "1788170016", "parent_asin": "1788170016", "user_id": "AHA7MVVZUIIGEUU363TNFZWPPSPA", "timestamp": 1616685826716, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Meh...", "text": "This was an improvement over the first book in some ways but it seemed rather disjointed as it skipped from cliffhanger scene to cliffhanger scene.  Maybe some readers enjoy that but I found it annoying.<br /><br />Also there were some glaring errors. Towards the end of the book, a sheriff's Crown Victoria patrol car is described as having front wheel drive. Nope, not in this universe. That's a rear wheel drive car. There were a few other things throughout the book that were just plain wrong. But I didn't take notes on them - just flinched and kept reading.", "images": [], "asin": "B00HCMIU74", "parent_asin": "B00HCMIU74", "user_id": "AGMG44UDOTG7U7V7Q3IGAGQCGHHQ", "timestamp": 1517345034812, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "I made it about 65% through and gave up.", "text": "This book started out fairly good. The characters were well-drawn and the plot was pretty interesting. There were a few leaps in logic that lead the characters to weird decisions; but much like in movies, you just have to let some things go. The next 100 pages or so were very engaging. The story was taking off and we were starting to unravel the mystery of the disappearances. Then, they found what they were looking for about 60% of the way into the book. At that point the author completely lost me!<br /><br />The characters were able to do things that were completely unbelievable, immenent death always seemed to allude them, and the bond between our protagonists was snapped in an instant. I really felt like I had wasted my time investment to get to the point where everything was dashed in order to meet some pre-determined checklist the author had for the ending. I just skipped to the end to read a few pages of the resolution then put the book away. *Sigh*<br /><br />I LOVED the &#34;Wayward Pines&#34; trilogy and immediately put Blake Crouch in my favorite authors list when I finished them. But after reading this, &#34;Run&#34;, and &#34;Abandon&#34; (admittedly a pretty good book, but not without its faults), I'm starting to think I made a mistake in that initial fandom. I will be very cautious about my next purchase from this author.", "images": [], "asin": "B00ASCMDFK", "parent_asin": "B00ASCMDFK", "user_id": "AGNKFHKGFSVMORXEXSLCMHBUSTFA", "timestamp": 1467562249000, "helpful_vote": 23, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Misprint with Chapter Missing", "text": "I love this series but part of a chapter is missing and another book entirely is printed in the middle of it. I was so confused reading it until I realized what happened. Because of this, I'm returning the book since some of the pages are missing.<br /><br />UPDATE: I contacted the publisher and they sent me a complete and correct copy of the book.<br /><br />I would give more stars but if buying from this seller, be aware you may receive a misprinted version of the book missing chapters. Seems multiple people have.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/A1k8taVGecL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/A1k8taVGecL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/A1k8taVGecL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/B1rzlc5a1wS._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/B1rzlc5a1wS._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/B1rzlc5a1wS._SL256_.jpg"}], "asin": "1427864071", "parent_asin": "1427864071", "user_id": "AEC4QQVGP44NZHKQOADVCXU6RWAQ", "timestamp": 1613097408057, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Waste Of Money", "text": "It's a snarky rehash of everything that's been better-expressed by way-smarter people.  Do not buy this book!", "images": [], "asin": "0812995708", "parent_asin": "0812995708", "user_id": "AETIKPQTJXMZ6PKGVLCBE7IIAZ2A", "timestamp": 1598890056145, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Stinky", "text": "I bought this book based on all the good reviews but feel totally misled. This book stinks. Dull story with lame ending. Can't believe anyone would like this book. Hard pass.", "images": [], "asin": "0763643378", "parent_asin": "0763643378", "user_id": "AHI2HKNG6JJ62VTSI6D6Q5SDE2HQ", "timestamp": 1627337845822, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Arrived used & dirty", "text": "This is a great dry erase workbook. The size of the letters/numbers is ideal for pre-schoolers & the extra spacing makes it easier to use. Dry erase markers wipe right off with water only wet-wipes.<br />My frustration was opening the box & finding a book covered in dried spilt milk, inside & out.  I had to use Lysol Wipes to clean every page, the spiral binding & front/back covers. I was shocked that this was returned by another customer in this nasty condition, then shipped out to me.  Shame on you, Amazon.", "images": [], "asin": "0545903246", "parent_asin": "0545903246", "user_id": "AETGCWXC47MSMK6B2TLZ44KCFJZQ", "timestamp": 1625417814711, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Great Writing and good synopsis", "text": "I love this writer's style!  I'm guessing she is a good writer no matter what the content.  This is a good synopsis of the four ladies.  I found no discrepancies.  If you'd like to follow up, there are other publications devoted to some of the subjects.", "images": [], "asin": "1582344507", "parent_asin": "1582344507", "user_id": "AF7MX5PD3XWMXMYIYT2MEW5UE4IQ", "timestamp": 1583360974469, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Meh", "text": "After a lull I've been reading books like this again. Gripping thrillers where the good guys and the bad guys battle it out, with the author creating plot twists and suspense. I've read a lot of those over the years, and I always enjoyed them. Not great literature, but good reads.<br /><br />Lately, I've been disappointed. Is it me, or is it the books I've read? Hard to say, but for whatever reason, I didn't like this book. It's the first I've read by Michael Koryta, and I don't plan to read anymore.<br /><br />What didn't I like? The first few chapters went by fast and my interest was piqued. Then the characters seemed to flatten out, people got killed off, the plot thickened, and things seemed to happen for little reason but to keep me (and other readers) turning the page. Events seemed unnatural, forced and contrived rather than anything close to real life.<br /><br />Not that I demand realism. I was a fan of Clive Cussler's early Dirk Pitt books, and those are more fantastical than this. But somehow those books flowed and this book sputtered.<br /><br />How was the ending of this book? I couldn't tell you, as I bailed before I got there. So I couldn't spoil it for you, even if I wanted to (which I don't). Now I'm on to find a better book. Wish me luck.", "images": [], "asin": "0316535931", "parent_asin": "0316535931", "user_id": "AGT4S5Q7PPN6FST33GVNUVY5ZGCQ", "timestamp": 1642377509261, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Convient way to get what you can get for free via web searches", "text": "I was curious what I would get for $18+. On one hand, there was the ease of having a summary of using Litchi for mapping in a softcover paper back short book quick to read. On the other hand, at $18+ for new, the value does not reflect the price which if were closer to $5-9 range (new or used), might give this a 3-4 start just for the ease of use. There are some good tips and info, however can find similar info on the web, granted you would spend time pulling and printing those out. Bottom line, not worth the $18+ price for new, however Convient way to get what you can get for free via web searches.", "images": [], "asin": "1795713410", "parent_asin": "1795713410", "user_id": "AFFYP7YQUQKZMBO6ZHFNYMGWDTVQ", "timestamp": 1556038539217, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "The print was not good.", "text": "I had a very hard time reading any of it as all the recipes kinda ran together.  The print was so light I hard time reading it.  I feel if you put more than one recipe on same page it should have the name in bold print.", "images": [], "asin": "1687709858", "parent_asin": "1687709858", "user_id": "AGAZ5DFLMX3X5KZND4JTIQTH7VIQ", "timestamp": 1615864070334, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Pages are felt off after 1-2 times of using", "text": "The book is falling apart after you open it several times. The pages are easily tear off.", "images": [], "asin": "1540004252", "parent_asin": "1540004252", "user_id": "AH5NJLFE4WGUI6LMDOQIUOXKZLAA", "timestamp": 1569366837257, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Three Stars", "text": "Too small print and crowded", "images": [], "asin": "143410396X", "parent_asin": "143410396X", "user_id": "AE3HEB7GGWRZ3FB3CVZUTUN3KTEA", "timestamp": 1496022946000, "helpful_vote": 10, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "The Finale", "text": "Though there are certainly people who would argue otherwise, I have always considered the Kronos Chronicles to be a MG or middle-grade series.  (MG being on one end of the Young Adult spectrum.)  Not that the series was lacking in sophistication nor depth of character, but because the books were outstanding, and yet still appropriate for younger readers.<br /><br />In fact, in my opinion Marie Rutkoski is one of THE best MG authors.  She can tell a whomping good story; make it engaging for teens as well as adults, and that is indeed a rare talent.  And so I gave \"The Cabinet of Wonders\" 5-Stars.  And \"The Celestial Globe\" 4-Stars.<br /><br />But something happened with \"Jewel of Kalderash\".  I didn't have a problem with the ending being a bit rushed, but I did have a problem with the fact that I never re-connected with Petra.  Her plight and concern about her father wasn't interesting any more, and instead all my attention was on Neel and his predicament.  And I found myself wishing there were more chapters about him, and the Roma on the island.<br /><br />Still, the word-smithing was still excellent, and this Jewel is worth reading so that you can see all the loose end brought together, but I am definitely glad the series is at an end.<br /><br />Highly recommend this series.  It's brilliantly done and the fact that younger readers won't have to wait for the next volume in the series to come out may sustain the excitement better than a year long hiatus.<br /><br />Pam T", "images": [], "asin": "0374336784", "parent_asin": "0374336784", "user_id": "AHFRAASH4BVPTCCUGNHH5APBSR4A", "timestamp": 1354418076000, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "I had to use this book for my high-intermediate Chinese ...", "text": "I had to use this book for my high-intermediate Chinese course. I honestly wasn't a fan of this book, since it seemed a little chaotic and hard to follow. My teachers skipped many sections in each chapter.<br /><br />The grammar explanations aren't very helpful, so if you plan to use this to study on your own, it may be difficult.<br /><br />Some of the texts are interesting, but for the most part they're a little odd.", "images": [], "asin": "0295983280", "parent_asin": "0295983280", "user_id": "AG2WBTTTFII6NOIJ3YKZJLBZXOLA", "timestamp": 1437565674000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "How to Relate Cows to Finance", "text": "I had to read this for a graduate level class.  It’s basically a finance for dummies book.  So poorly written and confusing.  She equates fundraising to raising cows.  I am very glad I don’t have to keep this book.", "images": [], "asin": "1119061156", "parent_asin": "1119061156", "user_id": "AECVUQRQZYKYPFTJEBHX5VNJADFA", "timestamp": 1646053269362, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Over Priced Text Book", "text": "It was for class. It's a book. It got damaged easily. But what can you expect putting it in and taking it out of your bag everyday?", "images": [], "asin": "142923153X", "parent_asin": "142923153X", "user_id": "AF5WQWP4CSGSJNGAREOEWEDHZJBQ", "timestamp": 1503515979778, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Wiley Plus code didn’t work", "text": "The Wiley plus code was invalid when I got the book.", "images": [], "asin": "1119498724", "parent_asin": "1119498724", "user_id": "AGH42CIBOCIBKIL2Z4XFF4EEUPIQ", "timestamp": 1566927431205, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "repeat...repeat...repeat", "text": "I actually agree with the author's basic premise that the public education system is too worried about everything except the academic education of our children.  I started reading this book prepared to nod my head and say, \"uh, huh\" while agreeing with his clever way of stating what I already think.<br /><br />I read the first several chapters and then just started skimming over headings.  The author, while clearly passionate about his subject matter, keeps saying the same thing over and over.  Perhaps, as publically educated readers, he believes we will not understand his message unless he states in 200 times in 100 different ways.<br /><br />I would be very interested in reading a new, abridged, version of this book where Mr. Skyes states his ideas just one time--clearly enough to be understood by his target audience (who I never could honestly identify.)", "images": [], "asin": "0312148232", "parent_asin": "0312148232", "user_id": "AG4OSCGZRZQXVSC2UOZQ4UEPVKNA", "timestamp": 1225987308000, "helpful_vote": 18, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Wishing For Better", "text": "A little star in the night sky wants to be special and part of something big.  He gets his wish and shines brightly as an announcement to all about a special birth.<br /><br />The illustrations are charming and whimsical. The stars feeling of wanting more and being special like other stars in the sky is relatable for most.<br /><br />Although I understand the feeling of wanting and waiting to be special I feel like the the telling of the story was lacking. I wanted the story telling to match the adorable imagery and it fell flat.<br /><br />I think the story idea is a good one but I feel the execution of the story is not where it needs to be.", "images": [], "asin": "0996874704", "parent_asin": "0996874704", "user_id": "AEY5U4ICNOZL6LY5F4N2CH2CM67Q", "timestamp": 1514310824723, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Boring", "text": "Slow, plodding tale that made me quit before I finished the book.  Nothing like the pace of the TV series on PBS.", "images": [], "asin": "1933397047", "parent_asin": "1933397047", "user_id": "AEBCBKDFYOZ5BWVODNVUE3IAUDLQ", "timestamp": 1387315132000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting work over of a traditional topic", "text": "Diagramming processes in order to understand them is not new. In many ways, it is an intuitive and informal process. The classic exercise of writing out the “pros” and “cons” of a situation are really a rudimentary form of diagramming.<br /><br /> Authors Boardman and Sauser believe in diagramming – and, to my eyes at least – torturing the English language by inventing the word “systemigram” A systemigram is a diagram which hopefully portrays a system and its workings and  “orchestrates debate among stakeholders and organize collective executive action pursuant to that debate”. Unfortunately, the entire book takes the tone of that quote.<br /><br />Truly this book could have benefited immensely from an editing by someone who kept ordinary people in mind, not some imaginary high-falutin’ polysyllabic executives.<br /><br />In truth, this is an excellent book that is weighted down with its quasi-academic style.<br /><br />On the whole, the ideas presented are not new in terms of the real world, but may be new to the reader. The book is a slow slog because of the language, but worthwhile overall for someone seeking insight into using diagrams to resolve systemic issues.<br /><br />Jerry", "images": [], "asin": "1118376463", "parent_asin": "1118376463", "user_id": "AHMNA5UK3V66O2V3DZSBJA4FYMOA", "timestamp": 1411017759000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "What I got was a new concept muddled by terrible choices. Warning", "text": "This book is so well reviewed on Amazon that I had high hopes.  What I got was a new concept muddled by terrible choices.<br /><br />Warning: If there were an actual plot that could be spoiled, this would probably be a spoiler...<br /><br />Basically you have a group of undead... no, they don't die easily but they can die, but... well, mutants with Mutant-X/X-Men powers... wait, it's not that extreme and they come into them later... how about superheroes... except most are villians...<br /><br />Well, nevermind that.  What you have is some people who are not quite, but for most practical purposes, are immortal and have special powers.  And the protagonist... wait, things happen to her, the victim... wait, she does kick some butt and shoot and such... the fledgling...<br /><br />Oh, whatever, the main character.  She and her family... wait, not exactly, her dad is... well, actually, he isn't but this other guy... no, not him either...<br /><br />Ignore the dad... it's not important.  Or at least you stop caring,  Because her effective family is seriously injured/killed and is not... well, can't possibly be... but yet maybe they are... wait, who is and isn't?...<br /><br />Oh well, at least we can follow our primary character as she slowly comes into these superpowers, gradually putting the effort and time into mastering them to the level that her 400-year-old undead/immortal/mutant family/enemies/teammates have demonstrated... except she can do things they can't.  What?  That old canard?  I  thought that went out with the ABC Wednesday After School Movie specials.<br /><br />Even simple things like lust get the will she/won't she/did she treatment.<br /><br />The characters are mostly well drawn.  The imagery is good.  The story concept is novel and pretty good.  The writing is easy to read, though lacking any humor.  But the flip-flopping of realities, ALL the realities, gets old fast.<br /><br />Try the [[ASIN:B000WH7PLS Dresden]] series instead, for less random reality swapping, equally good writing and some humor.", "images": [], "asin": "B00AYJJF4O", "parent_asin": "B00AYJJF4O", "user_id": "AFXRDEVBGBQT3YV5J5OHSUT6H6BA", "timestamp": 1460933109000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I didn't realize these were small books and not normal sized books", "text": "I like the way they look but not their size.  They are only 6 inches tall", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71sRRitwr2L._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71sRRitwr2L._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71sRRitwr2L._SL256_.jpg"}], "asin": "0544445783", "parent_asin": "0544445783", "user_id": "AERHOFOAWA3UR2VWOJP6H7UO7XJQ", "timestamp": 1639890667996, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Good if you're looking for a Preachy Cold Warrior version of events.", "text": "I really want to love this book, but I can't. I really loved reading about Stalin. Not that I approve, but its a crazy story, its bloody as hell.  I like factual history, don't call the bad guys bad guys, I can do that.<br />  So Conquest's version: It's too preachy, its too much of a Cold War diatribe.  Let Stalin's facts speak for themselves, don't give me opinions on how wrong it is to kill millions of your own people.  As a piece of Cold War propaganda, Communists are all evil people, or stupid, or worse, Like calling Russian theorists of the pre revolution period 'crackpots'.  Nice.  Let the audience know early; you think people are just dumb, brainwashed. How about the cruelty and ineptitude of the czarist regime?<br />  Tell the truth, that people REALLY believed they were doing good, they were trying to create a utopia.  Stalin, certainly his victims IN the party and their contemporaries believed in what they were doing.<br />  That said, Stalin IS a horribly cruel mass murderer. But let the reader understand the entire picture, why was Stalin the way he was?  Why were Russians so willing to kill 'class enemies'? American and western students especially need to understand why people joined Communists: growing up in an environment where children are taught \"Better listen to Mommy and don't talk to commies\". Because Communists are Evil People who are against freedom, hate God and all forms of decency are trying to conquer the world.  Liberals are 'pinko communist dupes'  Wow! But Mommy; Why would anybody BE a Communist? \"Brainwashing!\" \"Because There's some really Bad People out there!\"  Sure thing, if you really believe the world is divided into good and evil, and USA is automatically good.  You will NEVER understand the world and events in it that led to the present, and where the future might be going; if you're really that simple.  Maybe it's a good way to make children feel good.<br />  This is what makes history so important, that the worst crimes are always perpetrated by those who fervently believed that right was on their side.  I mean, for one example; Americans REALLY believed backing military junta of South Vietnam with 500,000 soldiers wasn't cruel insanity.  That firebombing North and South Vietnamese settlements were all part of being 'good guys'.<br /> When you call one side evil, stupid, wrong, and its thinkers 'crackpots' you're not writing history anymore.  You're being a hack trying to give justification the crimes your side committed.", "images": [], "asin": "0140169539", "parent_asin": "0140169539", "user_id": "AHLXU7FIE4J3WGX7NUPM2QYEEOCA", "timestamp": 1459686002000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Like half the tricks aren't actually \"tricks\" they're ways for ...", "text": "Like half the tricks aren't actually &#34;tricks&#34; they're ways for children to make a mess around your house with doggy-themed arts and crafts. That said, my children like this book and other than my youngest shredding two nice button up shirts trying to make a &#34;treat pocket&#34; as directed by this book, I'd say it's a decent purchase.<br /><br />I'm still a little salty about the shirts, though.", "images": [], "asin": "1592538932", "parent_asin": "1592538932", "user_id": "AHFRPQ5ZPS5GYTVU4OFSDGIMLDRQ", "timestamp": 1527473217533, "helpful_vote": 14, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Should've listened!", "text": "Although I was warned by previous reviewer, I took my chances and ordered the book anyway hoping my copy would be one which defied the odds and<br /><br />Despite being warned by previous reviewers, I ordered the book anyway hoping my copy would be the one which defied the odds and slipped through with a double dose of ink rendering it readable. NOPE! My copy was as the others described....extremely faint, blurry print making it almost impossible to read, What a pity. Should've listened!", "images": [], "asin": "B008WGSC68", "parent_asin": "B008WGSC68", "user_id": "AE7XYRYK5EZYODXGI766TXOPIN5Q", "timestamp": 1442824812000, "helpful_vote": 10, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Overrated", "text": "I felt water-logged after reading this tedious book. Actually I wish I had drowned so I wouldn't have had to finish reading it.", "images": [], "asin": "0312424094", "parent_asin": "0312424094", "user_id": "AFQ6GBLHZLQKWNOTOWRSP7QD6RKA", "timestamp": 1338138465000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Would be better if bigger", "text": "You get what you pay for. I neglected to read the product dimensions and was shocked by how tiny this book is. Four letters could fit on a standard piece of printer paper. I admit my failure to read the description, but it remains a disappointment because this product would be much more fun and useful if larger.", "images": [], "asin": "048625156X", "parent_asin": "048625156X", "user_id": "AFZU3UIV7FQFQL7H7TC4J6JVOYIQ", "timestamp": 1427252663000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "A great resource", "text": "I have only been to the Brickyard in person once, as a track worker. I have lived with the legends being told my entire life. Full of facts and statistics, this book is a wonderful resource for all those pesky details one might forget over time.<br />It is an interesting read for race fans of any kind, from your local dirt track to the road of professional racing at speeds far over the redline. It gives a look at much more than the average fan is aware of going on during a race and leading up to race day.", "images": [], "asin": "B07NN8VFRV", "parent_asin": "B07NN8VFRV", "user_id": "AFFKGBUPPSQWTSNYGAVRBZA2DXWA", "timestamp": 1562077967243, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Bogs down in the law enforcement factor too much...", "text": "Names and departments and more names of this officer then that officer.....ugh, plods along.....", "images": [], "asin": "B07L2GMT7J", "parent_asin": "B07L2GMT7J", "user_id": "AFFZPNJPEGLCTT63ZYTNNREVJQAA", "timestamp": 1563493444659, "helpful_vote": 6, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Fun", "text": "This is a nice collection of some of Krakauer's best articles alongside a new piece at the end. These stories were all written before Krakauer became famous and prove that he does have climbing bone fides. There is a nice cross section of the climbing world represented here. So many stories are written about Himalayan climbers (justifiably mind you) that it is refreshing to hear about some lesser know folks doing big things. The profile of the Burgess boys was quite amusing, I plan on reading their book in the near future. The Devil's Thumb piece at the end shows a nice bit of humility alongside the triumpth and makes you feel like you are there yourself. The best section is detailing the 1986 debacle of a summer on K2. That was a season that deserves more attention and I think Krakauer gave it a fair and balanced analysis.", "images": [], "asin": "1599216108", "parent_asin": "1599216108", "user_id": "AECO452WOV6KZR2I6JK2GQPTQKHA", "timestamp": 1354802653000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Worthless... better off using You-tube", "text": "Worthless... better off using You-tube videos.", "images": [], "asin": "0415453321", "parent_asin": "0415453321", "user_id": "AEMI74JHKARVZR5F3DVAK4FMANXQ", "timestamp": 1617073807598, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "ok, but not needed.", "text": "not that useful.", "images": [], "asin": "0735627126", "parent_asin": "0735627126", "user_id": "AETYMJAX4VVHENTLLVVW345JLPVQ", "timestamp": 1415377389000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not many recipes", "text": "Very limited content,  not worth the price", "images": [], "asin": "B09K1TV1XC", "parent_asin": "B09K1TV1XC", "user_id": "AE3OVYULQBYQNEQVPILFNKERV75Q", "timestamp": 1645825328420, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Entertaining-But True?", "text": "William Manchester is an outstanding writer of history.  He has a way with words and all of his books are interesting.<br /><br />This book is an interesting idea about Europe in the Middle Ages.  His conclusion is that the people of the great continent lived in a condition of ignorant barbarity and he gives many facts as to why this is the case.<br /><br />This reviewer expects that Middle Age Europe was not as bad as described.  The only picture of the times that this reviewer thought was likely true was that beer, wine and alcoholic drinks were a major source of daily calories.", "images": [], "asin": "0316545562", "parent_asin": "0316545562", "user_id": "AHO64FQWUBL32PRCNULIRDSBLIKA", "timestamp": 1396031430000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Annoying", "text": "This book was for my 18 month old to help him get used to the idea of a new baby. This doesn't help. It's just questions that a child would ask and its almost annoying and too basic", "images": [], "asin": "1846432766", "parent_asin": "1846432766", "user_id": "AFRDR4SWSWRH5NJHY26E7JGGRWRQ", "timestamp": 1454343023000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not too spooky", "text": "This is a cute chapter book that tells the tale of three children who set out to find a mysterious ghost that is haunting their towns hotel. Although this is supposed to be a spooky book for this age group, I thought it might be too mild. Kids do like to be spooked even at a young age. The book is a bit predictable but it is targeted toward 2nd-3rd graders so, that is forgivable.<br /><br />Overall, I think the book is okay and does remove the gore factor which I would not like, but still needs a little more boo.<br /><br />This book is part of an alphabet mystery series of stand along books. I would like to read some more from this author.<br /><br />3 stars.<br /><br />Disclosure: I obtained this book from my local library. The views expressed here are 100% my own and may differ from yours. ~M.M. aka Naila Moon", "images": [], "asin": "B00BXUEOOY", "parent_asin": "0679890793", "user_id": "AH7SNDITF3FMLZUIDRJLMUQ6ESJA", "timestamp": 1476751314000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Not Likely", "text": "Hmmm. It is not likely that 5 people witness a murder, don't call 911, and take 45 minutes to tell the main character's husband, the cop. He doesn't really do much about the information, like investigate the anything,  despite 5 eye witnesses, one of whom is HIS WIFE.<br />And neither Rupert nor Olive put up a fence or took out a restraining order against the elderly sleuths (or Lexy) or the elderly fan club ladies, for a total of 9 people who wandered onto this famous writer's property, day or night, fairly regularly.", "images": [], "asin": "B07M92346L", "parent_asin": "B07M92346L", "user_id": "AFLBQSNPHQKFHIDRZYBHICXD2X6A", "timestamp": 1552573300716, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A book for the fans", "text": "This book definitely had a similar feel to it--it was like watching the first episodes of the show...not very good acting, and a lot of killing, but something about it kept you watching, and in this case, reading. I thought it was a bit choppy in the beginning, but it picked up the pace a little more than halfway through the book.  If you are a fan of the show, you will be able to get through the sluggish parts.", "images": [], "asin": "0061370916", "parent_asin": "0061370916", "user_id": "AEM5HEPJVIDZLUQ3MOCWH7CX2HBA", "timestamp": 1404875799000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "DOMESTIC NOIR", "text": "The paperback version is 361 pages. The first 260 pages belabor Poppy's fractured days in a chemical haze because she's mixing pills of all kinds with too much alcohol & is having disjointed wild dreams.<br /><br />Her husband was killed a year ago. He was attacked while running. They beat him to death. Two days after his funeral, Poppy had a meltdown & ended up in psychiatric hospital with no memory of the days immediately proceeding the murder or after.<br /><br />It's not until page 322 that things FINALLY get interesting. In the final 39 pages of text, we learn who killed Jack & why.", "images": [], "asin": "0778369781", "parent_asin": "0778369781", "user_id": "AHHBAGQYRP4XWVCDF6LWHCGQHOQQ", "timestamp": 1541097788489, "helpful_vote": 25, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Beautiful artwork. As a Christian I will be using ...", "text": "Beautiful artwork.  As a Christian I will be using a sharpie to cross out and add some things to the overall message.  We don't glorify a crown, we Glorify Jesus and we are not who we are bc of some crown but bc of who we are in HIM.  This book/author clearly isn't leaning towards Christianity.  I would not recommend unless ur prepared to add to it and cross a fee things out.", "images": [], "asin": "1250040450", "parent_asin": "1250040450", "user_id": "AEGA2LJHYIO434FO2LRNH77FJ4MQ", "timestamp": 1506917680457, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Lots of great advice, lots of advertising...", "text": "The book has tons of great advice.  It's primarily about the  benefits of going on a raw food vegan diet.  The book is a very obvious advertisement for e3live supplements as well as the very expensive Hippocrates health facility in Florida.  It's got some great advice and reminders about the benefits of removing toxins from your body, improving your diet, and helping your body deal with disease.  Most of the studies aren't cited very well, although several mention names and the study.  Overall, I thought it was a good book with lots of practical advice people can use to improve their lives.", "images": [], "asin": "B01N3PKS13", "parent_asin": "B01N3PKS13", "user_id": "AGPECSQ2VWEJXBNAPQMOUJPCNNYQ", "timestamp": 1547574413791, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Seriously?", "text": "I picked this up for three reasons: the promise of an intriguing murder mystery, the author’s reputation (Pulitzer), and the possibility of some steam.<br /><br />As for the murder mystery - it’s not even competent. How do you become aware of a murder mystery, dear protagonist? Walk around in the woods, of course. How do you find more bodies? Walk around in the woods some more. Ask some questions, follow some leads, hit dead ends, then just walk around in the woods! How about a red herring? Walk around to a house and find another murder victim. But be sure to leave this plot thread completely, totally, 100% unresolved. How do you find a murderer? Not necessary, he will find you! How do you get him to reveal himself? Walk around in the woods! And the crème de la crème - how do our amazingly intelligent, financially secure, forward planning, Poe detective worshipping, strong, independent heroines prepare to defend themselves when painstakingly preparing their murderer revealing walk in the woods? With a tree branch and a hat pin, of course! Good. God.<br /><br />As to the prose, it does boast some wafts of interesting imagery and the occasional turn of phrase, but there exists nothing of brilliance nor even remarkability to this ear. Check for yourself- the headline critical praise comes “via Twitter.”<br /><br />And as for ‘steam,’ here are the two sexiest lines in the book (hetero and les, respectively) “she played with his prick until it woke up.” And, “they hugged as they had never hugged before.”<br /><br />I’m going to take a nice long break from Jane Smiley and then maybe borrow A Thousand Acres from the library. The Pulitzer committee must’ve seen something back in the day, but it sure as hell won’t in this complete waste of time.", "images": [], "asin": "0525520333", "parent_asin": "0525520333", "user_id": "AEMSR2MTH2DPTLEXQIKZDBLHMEJA", "timestamp": 1675888838350, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "a little thin", "text": "I bought this book on the advice of a nutritional teacher.  I have hypothyroid and hoped that I could find nutritional treatment, rather than solely pharma (I also take acupuncture for this condition).  There wasn't much meat in this book if you already eat a whole foods diet, as I do, and have been ever since I was in college (I'm now in my mid 30s).  While there were a few gems included in this text (I'm adding sea vegetables to my diet to increase my iodine intake), it read like a poorly-edited pamphlet.  There were numerous spelling, punctuation, and grammatical errors (including its/it's) which I found distracting.  I wish that I'd understood that the specifics of nutritional healing and recipes that Beaman espouses weren't included in this book.  I feel like this was a forward to her Whole Truth Eating and Wellness Guide, rather than a book in its own right.", "images": [], "asin": "097786930X", "parent_asin": "097786930X", "user_id": "AE6YIPVFIPNPNEOTVJWZBOLTXOKQ", "timestamp": 1316526169000, "helpful_vote": 19, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Book series is great! Just desired more books sold in set", "text": "Book series is great!  Just desired more books sold in set.", "images": [], "asin": "067989070X", "parent_asin": "067989070X", "user_id": "AFSX4DN34364AQ6ZGNZCJV3KDXEQ", "timestamp": 1457036608000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Basic information for new non fiction writers", "text": "I believe the author's information is accurate. It just didn't apply to what I was working on. Someone who writes non fiction would probably benefit more from the information. I'm sure there are writers who can write a book in a week. I can't recommend or not recommend. But I think it might be a buyer beware situation.", "images": [], "asin": "B01CDKRN22", "parent_asin": "B01CDKRN22", "user_id": "AGYZ4GKHIH5U7BYWKOVMWF2ZY3IQ", "timestamp": 1474147326000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "For actual interesting complex characters and stories involving Native Americans, you'd do much better off with Tony Hillerman", "text": "Come on now Mr. Krueger....this is getting too boring.  Cork is always stronger and more resilient than any human could be, the old Indian is always so &#34;wise and right&#34; and it's just too much sap.  I really gave up at the end when he makes a 49 yr old pregnant.....pleeeease.... even late pregnancies don't happen that late naturally....and if so almost always  are miscarried.....I think Mr. Krueger is trying to channel Tony Hillerman's works about the Navajo nation and Lt. Leaphorn and Det. Chee.....but he can't hold a candle to Mr. HIllerman's masterpieces.  And WAY too much religion thrown in for some reason.  This will be my last outing with one of Mr Krueger's books.", "images": [], "asin": "1476749264", "parent_asin": "1476749264", "user_id": "AFSBQIW2QRKYL7PK4CMP4S2S5IBQ", "timestamp": 1487877967000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Loved at first, but didn't care by the end....", "text": "This book is compared to Uprooted, but I'd put it closer to The Legacy Trilogy by Cayla Kluver(which I had mixed feelings about, in general). I wouldn't actually compare it to Uprooted at all. The Waking Land is *not* a fast paced story. When I first started it, I was in love with it. It was just as beautiful as the cover. I found the nature references appealing, and I was intrigued. That didn't last long, though. I don't know what happened, but by the end, I was forcing myself through it. If not for review, I don't think I'd have finished it, nor do I plan to read any future books at this point. It gets really slow by the end, and I didn't even care what happened by then. (I don't even mind slower books, in general, but this one didn't work for me.) Too, just like in the Legacy Trilogy, the main character annoyed me more than not.<br /><br />This book wasn't for me, but it does have enough going for it that it might be the perfect read for you. If you don't mind investing time in a slower moving read and the content doesn't bother you, go ahead and give it a try.<br /><br />Content:<br />There's a sex scene(which I found confusing...the scene, not the fact that it was there), mild profanity, and violence. To me, it's in between YA and Adult.", "images": [], "asin": "0425284026", "parent_asin": "0425284026", "user_id": "AGSM75HHGVYI263VKMFQMK6GJQ7A", "timestamp": 1495901623000, "helpful_vote": 4, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "This reads like bad fanfiction", "text": "Owen and Granuaile's POVs could have been entirely omitted, and made nearly no difference. Gran's only point was to beat on Atticus at the end of it all and kick him even harder while he's down. This is a jumbled mess of a book, that builds to a climax that's over in a few pages. A giant chunk of the book is devoted to prep for something in Tiawan that gets absolutely abandoned. The book literally tells you.. none of this mattered.<br /><br />The series started falling after the introduction of multiple POVs. Owen's however are normally character building and good story telling. In this book he's comic relief and side story filler. He does nothing to progress anything but get a pet. It's amusing to read, but it comes off like a novella insert into a compendium by a guest author, not the captain of the series....<br /><br />Atticus and his whole story is rushed. A big fight with the world serpent is over in a few paragraphs, and even then it's mostly filler. The Hel battle, maybe 1-2 pages? Everything that was supposed to be building up to is forgettable. This is an absolute let down from what was hands down one of the best fantasy series in existence. Calling this book fanfiction is by no means a stretch. Plague of Giants is even worse, with a dozen POV's with nonsensical names, it's even harder to follow. I'd rather have waited years for this installment, then to be rushed this.", "images": [], "asin": "034554854X", "parent_asin": "034554854X", "user_id": "AFMUFZGCCMA46RXA5PX63Y5UAIVQ", "timestamp": 1524597882976, "helpful_vote": 22, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "stupid", "text": "nonsense", "images": [], "asin": "0060834374", "parent_asin": "0060834374", "user_id": "AHRIOECAGKPNABUYUUBCN7QQ5MDA", "timestamp": 1493046043000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "not enough pictures showing the exercises. Waste of money", "text": "I would not buy this book again. It's poorly set up. If I had looked at it in a book store I would have left it on the shelf.", "images": [], "asin": "0578046695", "parent_asin": "0578046695", "user_id": "AGXMHYVOBOG3X27RG4PCGMD5ZJ2A", "timestamp": 1295871893000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "thought this was supposed to be new came to me ...", "text": "thought this was supposed to be new came to me used with bent covers to a point where i have to be careful when i open the book to not tear it", "images": [], "asin": "0881664790", "parent_asin": "0881664790", "user_id": "AGXXNJ5AD5QWRUXWQAWC72ETYIGQ", "timestamp": 1521904222653, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "I really enjoyed the character creation and the dice system", "text": "I really enjoyed the character creation and the dice system. I did not like the medieval setting as much as fantasy settings. Based on my initial observations of 2nd edition I think I like first edition better.", "images": [], "asin": "1887953035", "parent_asin": "1887953035", "user_id": "AGD5474EZ7LDGYUS6W7FJX4ZJBRA", "timestamp": 1483974803000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not for me", "text": "I really enjoyed AThree Dog Life, it was like a conversation with a good friend (albeit one sided). However with Getting Over Tom I didn't find the character interesting.", "images": [], "asin": "0684813475", "parent_asin": "0684813475", "user_id": "AG4CPDKG4FXBFZYF7SW3MEMHIHOQ", "timestamp": 1429068495000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "You’ll also need felt, glue, beads, and sewing stuff...", "text": "These projects are cute but there is a LOT of sewing/gluing required which for me takes away from the crochet aspect.", "images": [], "asin": "1784943894", "parent_asin": "1784943894", "user_id": "AGA7AINK5IAP3QQIOMMBLTYFJPIQ", "timestamp": 1618973049336, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It's okay", "text": "Not as easy to use as Woodall's.", "images": [], "asin": "0934798966", "parent_asin": "0934798966", "user_id": "AES6SSMZRQQYGFNCMDS5GLYZF3XQ", "timestamp": 1409940189000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Questioning why I spent the money", "text": "Theme and premise intrigued me. Bad call. The story line was, at best, sophomoric. I think this book was an exercise in creative writing and the actual author was in grammar school and failed the course. My advice is save your money.<br /><br />The 2 stars are for concept since that is why i bought the book.", "images": [], "asin": "B08VJ22R9X", "parent_asin": "B08VJ22R9X", "user_id": "AFDVDCYR3OAPP3RTG3RSXHFJGGGA", "timestamp": 1626293090642, "helpful_vote": 53, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "A chore to get through; narration was good", "text": "I read this because it was on some \"100 Greatest Books\" list (Entertainment Weekly?). It's about a girl, her little brother and her boyfriend going to look for her father, who has disappeared to a distant planet. Started great but quickly became a tedious series of fantastical running-to-and-fro sequences. The big set piece of a totalitarian regime where everyone is equal was not thought-provoking beyond the initial description because it never felt like it could really happen. Even if I were a 12-year-old girl, I can't imagine liking this. The narration was good, though. Bechdel test: Passed.", "images": [], "asin": "030791657X", "parent_asin": "030791657X", "user_id": "AEUSDGHFKZK6IA5NPQP4QGNT4IFQ", "timestamp": 1377962830000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Not great pictures inside.", "text": "Is not what I was expecting as an ISLAND Living. Is most inland living.", "images": [], "asin": "0789318296", "parent_asin": "0789318296", "user_id": "AHEAOU4AQ3AUHNZPMTU5IKNQIR5Q", "timestamp": 1538253871913, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Cute learning book. Colorful. Pages will tear easily though-stay with your toddler.", "text": "Rather flimsy but is colorful and has a wide range of pictures. I’m not sure my 2 yr. old toddler will fully understand the association of letters yet, but I think it will be a good “growing” book-if he DOSEN’T tear the pages.", "images": [], "asin": "1549986635", "parent_asin": "1549986635", "user_id": "AEKVQBRLL5ZUNMCSP3N3ZJ5PPS3A", "timestamp": 1596059527237, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great information, but the Proof Reader did a poor ...", "text": "Great information, but the Proof Reader did a poor job. I found several errors in the math sections. Divide symbols where there should be a Plus symbol and other calculation errors. Not enough to negate the value of the book as a whole, though. I like the &#34;Flash Card&#34; idea (even though they aren't exactly flash cards.) I used this book in conjunction with Mosby's Review and PTCB Exam Simplified as Study Materials. It would have been really great if the &#34;flash cards&#34; were actually flash cards that were perforated for removal from the book (if the reader chose to do so).", "images": [], "asin": "0738610542", "parent_asin": "0738610542", "user_id": "AEZIBYPST5MBVDWF47O5EEQAGKKA", "timestamp": 1425323728000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "great author, truly funny.  But the publisher?  not so much", "text": "I love Davidson's work but I only get her from the library now.  Why?  Because her publisher, editor, the powers that be, the mighty oz, WHOEVER it is...slaps these too-short, too much white space, big ole font things together that, fun as they are to read, just flat out aren't worth the price tag. The story of this one...not her best. The thing is, it's funny and fun and as long as I don't have to part with money for it, worth the time to read.", "images": [], "asin": "0758208049", "parent_asin": "0758208049", "user_id": "AHW66PLWEVTQ4THAYSAT2NM7HVEQ", "timestamp": 1137630392000, "helpful_vote": 10, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "yup good book", "images": [], "asin": "B0083ZL5EY", "parent_asin": "B0083ZL5EY", "user_id": "AF7GBLQELZNCHQCJPJ5CSJDOB3MQ", "timestamp": 1484676361000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Don't Bother", "text": "This manual has very few questions worked out.  I find it much more helpful to my learning to check my answers in the back of the textbook and work them out again if they are wrong.  Don't bother to buy this.", "images": [], "asin": "0471659975", "parent_asin": "0471659975", "user_id": "AGONIRPC2OJU2A4G7F5HXLCJPRSQ", "timestamp": 1223072774000, "helpful_vote": 7, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "Didn't care much for it.  Will donate it to our public library.  Different strokes for different folks.", "images": [], "asin": "1452118930", "parent_asin": "1452118930", "user_id": "AHZ45MN3OFLJYS6WMBBJXBW4VTTA", "timestamp": 1411495921000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good but potential to be better", "text": "I really did enjoy Chrysler Szarlan's &#34;The Hawley Book of the Dead&#34; that I feel like I have to explain the 3-star because in spite of that seemingly middling rank, I still very much want another book because this book hints at the potential of a much better book to come.<br /><br />Yet for this book, the plot is a mix of paranormal and murder mystery and from the very first page, the reader knows that there is tension with daughters missing. Then it flows into what may seem the starting spot wherein the lead protagonist, Reve (short for Revelation, which is a family name) Maskalyne, kills her magician husband, Jeremy, when the gun she normally used for a magic trick is switched with a real loaded gun.<br /><br />There is a bit plasticity to these opening scenes and frankly, I was glad to be out of Vegas and in Five Corners and Hawley so the real story begins. The man who killed her husband is still stalking them so Reve returns to her hometown at the urging of her grandmother. She also takes back her maiden name of Dyer. It isn't just to camouflage herself and her daughters but also a return to a tradition of the Dyer women using their maiden names.<br /><br />I liked how Szarlan also brings in the viewpoints of the daughters (15 year old Grace and Faith along with ten year old Cayleigh) even though most of the book is told from first person narration of Reve.<br /><br />Once Reve and family are back in Five Corners, Reve begins to piece together her family legacy and how it may affect her. It also leads her back to her childhood friend and first love who is now the chief of police in Hawley. Not that Reve is fully ready for a romance so soon after losing her husband but the connection is there nonetheless.<br /><br />Interesting parts of the book is when Szarlan tantalizes with the use of magic but she also ups the tension with the addition of another murder of Reve's college friend many years prior. At first this addition seems tacked on but it actually does work later in the story.<br /><br />My issue with the story is that there just seems a little too much going on that. There were times when I'd get mixed up with the different Revelations. We never really get more of the Las Vegas situation. The main 'villain' never really feels like much of a threat. We know he's a problem early on but once we get to the revelation, it is thin and under-explained so I felt a let down at the end that I can't quite shake off.<br /><br />But again, the potential is there for a solid series. More use of American history and folklore and how the Dyer line figures into it. More development for the daughters who also have magic in them. Just more development for all the characters as Reve digs more into her legacy and the town(s) as well.", "images": [], "asin": "0345545028", "parent_asin": "0345545028", "user_id": "AGSP6LSQK32SQEJO3YVVNACPWMSQ", "timestamp": 1410732612000, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Cute and silly", "text": "Dragon is looking for a friend. He is tricked into thinking his apple is sentient and shenanigans ensue. This is an easy read. My first grader read it by herself and enjoyed it.", "images": [], "asin": "1338341057", "parent_asin": "1338341057", "user_id": "AFNTQDWERBYHZXFWZGWPWU3UQTTQ", "timestamp": 1561684787346, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Not the vibe", "text": "This book definitely doesn’t give “rooms” vibe. Little disappointed. It feels like a copy of all her other books mashed into a messy one. Too many tedious, repetition and nonsense pages. I don’t care about the paper and didn’t notice a difference. I did not get the story on this one and had really high hopes for cool different “rooms of wonder”. I will still color the pages and enjoy the time.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/61UdZ9szVHL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/61UdZ9szVHL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/61UdZ9szVHL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/711K6G-XEUL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/711K6G-XEUL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/711K6G-XEUL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/714KPfq-JWL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/714KPfq-JWL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/714KPfq-JWL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/716R-Tf0OvL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/716R-Tf0OvL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/716R-Tf0OvL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71CuWS4kKDL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71CuWS4kKDL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71CuWS4kKDL._SL256_.jpg"}], "asin": "014313695X", "parent_asin": "014313695X", "user_id": "AFW3GV6SDJFIGMEOC6J6NHKTTJEA", "timestamp": 1667782978792, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "This is a good basic book to get started", "text": "This is a good basic book to get started. Honestly a lot of this information you can find on the internet or from cooperative extension offices. This is one I would suggest borrowing from the library or buying used.", "images": [], "asin": "1591862027", "parent_asin": "1591862027", "user_id": "AFYCYO6SBSKDYHQDBFHXKLSJRGIQ", "timestamp": 1430786906000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good for older girls.", "text": "There are plenty of pictures and the book quality is very good.  I guess I was expecting little stories that came along with each recipe. My daughter was hoping that the recipes would be more fun and simple things like jello and more baked goods.  But this book is really designed for girls 7 and up.  My daughter is only 4.", "images": [], "asin": "1423163249", "parent_asin": "1423163249", "user_id": "AHB2JYZIALPCK6GLFXTSRH6VZ6EQ", "timestamp": 1421646782000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Good for a child", "text": "I wanted a book that would give me an overview of US Presidents.  This was less information than I had hoped for.  I think this would be a good addition to a young persons reference books....maybe get them interested in history.  It doesn't have much data.", "images": [], "asin": "0679803580", "parent_asin": "0679803580", "user_id": "AHBCPWX5TQVFOOQZN4FBRST6YSRQ", "timestamp": 1323225303000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Ok for historical context, not a great read.", "text": "Ok to get a first hand perspective of what life was like back then but there were many parts where I had a difficult time wondering just how people were related to her and it was tedious.", "images": [], "asin": "B00A3IKY96", "parent_asin": "B00A3IKY96", "user_id": "AH6X55ZNDYTAYPY6YE7RHM4U5EZQ", "timestamp": 1451617803000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "An Utter Disappointment!", "text": "Despite being called Reading & Writing Prep for the SAT, there are Zero strategies in this book.  It is also just made up reading passages, not real SAT ones, with short answer explanations.<br /><br />You would be better off using Khan Academy for Free, which has actual test questions and provides strategies.  This may be the worst test prep book I have ever purchased.", "images": [], "asin": "1942321481", "parent_asin": "1942321481", "user_id": "AFUWWUWQIMT2W5N7HUHVHYDS7UGQ", "timestamp": 1652469349422, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "One of King's worst", "text": "From the mind that gave us 'IT' and 'Pet Sematary' comes Gerald's Game. I'm sorry, but this was just awful. SK's gas tank of horror must have been on fumes around this time. It seems he switched from frightening nightmares to battered women. It started with Gerald's Game and continued with Delores Claybourne and Rose Madder.<br />This story was just dumb. Wolves in the kitchen is one thing, but slitting your wrists to use the blood as lubricant to escape handcuffs? Uh...no.", "images": [], "asin": "0451176464", "parent_asin": "0451176464", "user_id": "AH2GZPINQW5KP446KNXRV2J7KSEQ", "timestamp": 1079108191000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Disappointed :(", "text": "I was disappointed when playing through this book. Perhaps I was expecting more full and flowing or bellowing melodies, but these songs were just not great fun to play. I'm unsure if it was the arrangement (I normally opt for Hal Leonard arrangements and am never disappointed, and this is not Hal Leonard) or if I was remembering better movie themes than were actually there. I was disappointed either way and will be returning it", "images": [], "asin": "075792414X", "parent_asin": "075792414X", "user_id": "AHM4RTE6JWO3WYLCP57TGD3JLACA", "timestamp": 1495131716000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Well, Still wondering why it was called The Black Train", "text": "I really enjoy Edward Lee's novels. In all honesty, he is pretty much the only author in horror I read. Although the book was a C+ at best, it was still enjoyable. Most who know of Edward Lee, understand that this was a full length novel originally called the Gast House. Hence, the majority of the good stuff was cut out. However, with that said, maybe i missed the section, but I was quite interested to why the book is called the Black Train?<br /><br />Anyhow, not one of his best, but not his worst. Anyone who has a few days, or even weeks to spare, pick up the book for a somewhat decent read. Ultimately though, this is not Edward Lee's best work, and please do not judge him solely on this book.", "images": [], "asin": "0843962275", "parent_asin": "0843962275", "user_id": "AGUUY6VJVKIMRKKJJBK4YIDA762Q", "timestamp": 1257376961000, "helpful_vote": 9, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Appropriate for high school level Patho: maybe even too basic for that.", "text": "This is too simplistic, no in-depth information at all.", "images": [], "asin": "1496398246", "parent_asin": "1496398246", "user_id": "AGWMF4MVY6XCN22IV7OBN4EWFKFA", "timestamp": 1632503510482, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Near Worthless", "text": "Look at the Photo, this is the entire \"timeline' format. Just buy a spiral notebook and write the headings of History you want to record. No visual linear timeline in book, arbitrary mixture of Bible and secular history. Too much trouble to return this for six bucks, but wanted to save the blind buyer from wasting money. If I saw this book in the Dollar Store I wouldn't have bought it!", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81nIcH3yqfL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81nIcH3yqfL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81nIcH3yqfL._SL256_.jpg"}], "asin": "1615382240", "parent_asin": "1615382240", "user_id": "AFYPG5P43LVKASGL7BWLCVH3LXUA", "timestamp": 1608293914362, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Big Piece of Junk", "text": "This is a silly, poorly written book.  The characters are simply page fillers with no &#34;character&#34; at all.  Stupid from the first page, and it doesn't get any better.  DON'T waste your money or your Unlimited Kindle program on this piece of trash.", "images": [], "asin": "B071HDR8TN", "parent_asin": "B071HDR8TN", "user_id": "AGLGBY7T3NFWEZFQIFSL6WPNKEKA", "timestamp": 1500440709158, "helpful_vote": 4, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Didn't find this very engaging at all - quite redundant", "text": "This book can be summed up as follows: we marched a lot, we were hungry, sometimes we pilfered food, then we marched some more and we're hungry again. Not to diminish the accounts of the author, but I was hoping for a bit more insight from an eyewitness.", "images": [], "asin": "0915992108", "parent_asin": "0915992108", "user_id": "AH5OX5ZJ6RALZ4UO7S5ILNG3NETQ", "timestamp": 1471114390000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Maybe Mr Franzen's next book will be worth reading", "text": "I really liked Corrections!  But this is one I could not finish.<br />To me an autobiography should be written so that the main subject is the narrator and does not refer to themselves in the third person.  So that part of the book was frustrating.<br />The author does not like to have a table of contents .  I like those, as they tell me when I can pause -- I don't have all the time in the world to figure out when it would be a good point to stop or to go searching through to see where the next chapter .  Corrections was so good I dealt with that.<br />I guess it is readable, but the story lines became unrealistic and included stuff I think was unnecessarily immoral.<br />You know, I don't even want to donate this to the library.<br />I did love Corrections though!", "images": [], "asin": "0312600844", "parent_asin": "0312600844", "user_id": "AFSDN56QP4FEJGA45CLTJLD2S5DA", "timestamp": 1580353423837, "helpful_vote": 8, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Definitely for a YA of New Adult Audience", "text": "As a high school teacher, I'm always on the lookout for engaging reads.  I quickly found that this might be engaging for students, but not for me.  This is a definite teen romance with a bit of a strange love triangle.  While the decisions and emotions these characters have might be pretty authentic to an actual teen, I found it exhausting.  Honestly, I might not be the right audience for it, so I hesitate to really give it a complete breakdown.  Needless to say, teens might really like the drama and see themselves in the choices and feelings that the main characters express.  For me, it was a miss.", "images": [], "asin": "1328635198", "parent_asin": "1328635198", "user_id": "AH74XLC3QBXVC6UCOAQOJH3WJYGA", "timestamp": 1628866341956, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Good Concept", "text": "I bought this based on Amazon's suggestion. It didn't satisfy. The plot is weak. The characters aren't developed well.<br />Sorry, I can't recommend this.", "images": [], "asin": "B002GEDENS", "parent_asin": "B002GEDENS", "user_id": "AE5GUORAVT4JS2IO5O6B3V3NBIBQ", "timestamp": 1304988387000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Half good, half awful...", "text": "Actually, most of this book was fairly good. But the cheesy parts were truly awful. The female lead was a real wuss and pretty clueless. I don't want to give the plot away, so I won't go too deep into the killer getting away with everything without his wife having an inkling to his evilness. One thing that the author did that bugged me was the following sentence: \"she would just assume leave everything behind\" - the sentence should read \" just as soon leave everything behind\", but that's just me nit picking the correct grammar.", "images": [], "asin": "0312979088", "parent_asin": "0312979088", "user_id": "AHMDBBRRSYTHHKDJROTKIECLHCTA", "timestamp": 1347070362000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "I wasn't a fan of the words or the pictures.", "images": [], "asin": "2376190053", "parent_asin": "2376190053", "user_id": "AH7F7J2DSI63IDGW265MKSYSXBRQ", "timestamp": 1488129243000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Interesting", "text": "Interesting, but it's a non-meat, non animal based diet. Like all diet/nutrition books, the information is subjective. I didn't find this book convincing.", "images": [], "asin": "B00Y7USB14", "parent_asin": "B00Y7USB14", "user_id": "AFRDBMD3Q2CBQUIA67GEVQBTDRYQ", "timestamp": 1483629987000, "helpful_vote": 5, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not-finishable", "text": "I simply cannot read another page. I so enjoyed the memoirs. They were such fun, laugh-out-loud reads. Loved, loved them. This is embarrassing,  or should be. Earlier reviewers have covered every issue I have with this book, particularly the characterization of Reagan--clearly the complete opposite of the author. It pains me to say it, but it may be time for Fletch to dig out his resume. His ride as a \"kept\" man may be coming to a sad end. (This review is actually from the Kindle edition, not the hardcover as stated above.)", "images": [], "asin": "0451239652", "parent_asin": "0451239652", "user_id": "AHOLUHW3542ZHYWWI3TDTSDAATNA", "timestamp": 1393909296000, "helpful_vote": 9, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "How does she get this published????", "text": "Social science?  Lots of social.  No science.  Come on, 'Wednesday', you live in NYC for 20 years, your husband lived in the Upper East Side in his teens, your sister in law lives there, and you had NO IDEA what it would be like?  You break your neck to be one of them and boo hop when they don't accept you.  Why do you want to be one of them?  Because you really really do.  Such a need to impress us &#34;I have a closet full of designer purses!' but want us to like you, 'Unlike these ladies, I buy my designer shoes on sale!'  Barf.  The only good ending to this book would have been, &#34;We realized how crazy this was so we moved to a mission in a third world country.&#34;  Since that did not happen, and in fact there was no real end to the book, &#34;the ladies were nice to me when I had a miscarriage!  They really like me!&#34;", "images": [], "asin": "1476762627", "parent_asin": "1476762627", "user_id": "AGGTP32YKLESHZWVZDZHCZEWXV3A", "timestamp": 1438741112000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "A fun classic.", "text": "A humorous and quirky gothic short story, a fun read.", "images": [], "asin": "B00NG5PHF4", "parent_asin": "B00NG5PHF4", "user_id": "AGETQ3QIV3CI2O5DQR4RNBTXJQEQ", "timestamp": 1578567353199, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "I couldn't get past the underlying racism...", "text": "The concept of this book is interesting.  It really is.  I just couldn't make it through the entire thing.  I hated the underlying message of racism throughout the story.  The story elements all revolved around the incorrect idea that white people just want to make trouble for black people, which could not be farther from the truth.  I was actually offended at the constant thread of it throughout the details that make up the action in the story.  It was really uncomfortable to sit and read, and not in a good way.  The writing style is well done though.  The characters, for the most part, are pretty well thought out.  They could be more detailed and \"fuller\"  but that's just a personal preference of mine.", "images": [], "asin": "1946395145", "parent_asin": "1946395145", "user_id": "AGSTQ3JDGW2TZB5XKBF7PD2DJOKQ", "timestamp": 1575569926851, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Interesting points that don't seem to ladder up to a clear conclusion", "text": "I ordered Sonic Boom on first read of the Amazon Vine preview description.  I'm a big fan of the topic of globalization and have read a variety of analyses on the subject.  As such, I came into reading Sonic Boom with some familiarity of the topic.  The book left me with the feeling that the author didn't quite finish the book.  It is an interesting collection of facts/insights about globalization, but lacks any coherent organization or conclusion on what we should learn and do based on his observations.  Easterbrook stops short of drawing any conclusions or recommending any logical action based on the book.  A disappointment.", "images": [], "asin": "1400063957", "parent_asin": "1400063957", "user_id": "AEZ7XOPLPIDM4DLKWQPND46PGODQ", "timestamp": 1283144431000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Not this edition!", "text": "There are an absurd number of typographical errors in this Kindle edition. It does not do justice to the beauty of this poetry -- pick a different edition!", "images": [], "asin": "B08D3G534B", "parent_asin": "B08D3G534B", "user_id": "AEWAGKVFRAEBQB4XME2IG4FYYIEA", "timestamp": 1601651161346, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Although the story seemed contrived in parts the author did a nice job of pulling it all together", "text": "Christmas time in the small town of Grandon brings together local people for the performance of the Christmas Eve Nativity. Five very different people are brought together to share and discover the real meaning of Christmas, the season of hope.<br /><br />A pregnant teen, lost and confused by her situation, a young widow and her six year old daughter who have not gotten over the death of a spouse and a dad, and a divorced contractor who comes to town to visit his aunt along with his six year old daughter (can you tell where this might be going?)<br /><br />Although each of the characters is facing some sort of struggle, I found it difficult to connect with any of the characters.  The message of the book is about having hope and believing and opening up yourself to new possibilities.  Although the story seemed contrived in parts the author did a nice job of pulling it all together.  It's a very short read that many readers might enjoy this holiday season.", "images": [], "asin": "1250010659", "parent_asin": "1250010659", "user_id": "AHAR2ITQ3O2FJJDLIORAQ226KZHQ", "timestamp": 1418776362000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "nothing new or original", "images": [], "asin": "1605500429", "parent_asin": "1605500429", "user_id": "AFAFFZAIGRSPMNXVZKQCKUNMLNVA", "timestamp": 1406035909000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "boo", "text": "Cheaply made \"hardbound\". Better of getting a paperback version.", "images": [], "asin": "0808520946", "parent_asin": "0808520946", "user_id": "AF67LX7VURVGV6MV7GH3HHDLKZ7A", "timestamp": 1578961279629, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "recepies not bad,but not my taste", "images": [], "asin": "1634506804", "parent_asin": "1634506804", "user_id": "AEO6MOBOPMLGW43262IFJ2EUNNQQ", "timestamp": 1516929851027, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Not as good as Dinosaur Feather but ...", "text": "I read and loved The Dinosaur Feather, so was eagerly awaiting this next book. Like the first, it is heavy on science and new research which, again, was it's appeal for me. Throw in some police procedural murder mystery around that and I won't put the book down.<br /><br />While I did have a hard time putting the book down, I did not like it nearly as much as the first. There were alot of main characters to keep track of and a very complex storyline involving several mysteries which were resolved in the end. As others noted, there was an odd and confusing non-linear section toward the end which slowed things down. There was also alot more sex and while I'm not a prude, I felt it was a disappointing dumming-down element or a caving-in to trends.<br /><br />While I hated the character of Anna in the first book, she was okay here. The Søren character was more emotionally open and still as likeable. Much to my surprise, I adored the child character. I usually despise and avoid them, at least in American novels, but this kid was a joy to read and I hope she will appear in the next book. 5 stars for her, 3 for the overall novel. I liked it, but unlike Dinosaur Feather, I will not keep it in my library to read again. I will, however, eagerly anticipate S.J. Gazan's next novel and buy it as soon as it's available in English translation.", "images": [], "asin": "1623654122", "parent_asin": "1623654122", "user_id": "AEYOQR3TFRHTHCUFDZ3II6KSGS7Q", "timestamp": 1457504164000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "OK, but not fun to read.", "text": "Good for regular conversational French, but I found the content irritating- it is obviously translated from Spanish, then to French, then to English", "images": [], "asin": "1514187213", "parent_asin": "1514187213", "user_id": "AG5AFWFVDDB6HEYBOSFMMDM5LRGA", "timestamp": 1564861700522, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Love it but a little too unrealistic for my liking", "text": "Love it but a little too unrealistic for my liking. Nonetheless it still a great story. I feel sad that the author has died.", "images": [], "asin": "B003ZSHUQ6", "parent_asin": "B003ZSHUQ6", "user_id": "AFZFVGAR7E2LAR3JHIDIA6RUL7YA", "timestamp": 1420332736000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Good to see the boys back", "text": "This book supposedly takes place after Charm, as one of the \"lost archives.\" What can I say, I read and enjoyed it. It contradicts a lot of things in the previous books, but that's the nature of an oral history. If you're a fan the book'll be fun. If you're into SF (which you probably are), think of this story as a time loop that closes off at the end.<br /><br />Is it worth full price? Probably not. Get it used (so you can add it to your collection of BK books) or at the library. I did both!", "images": [], "asin": "1250174570", "parent_asin": "1250174570", "user_id": "AHNYAF5CHXLHVKMLUC5QFAAQCBAQ", "timestamp": 1568838127732, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Mean God? You can do better.", "text": "Or um...you could just understand your conception of God as your need to believe in an omnipotent parent figure long after you've discovered your actual parents are only people. So if you're going to make one up, it may as well be benign and loving. If your own real parents were terrible, the place to work that out is in the therapist's office or in long boozy conversations with friends, that sort of thing, but there's no good reason to import your childhood miseries into your imaginary omnipotent protector's character. Talk about self-defeating. You should have a cozy god who treats you nicely and is understanding, but also thoughtful and fair. It wouldn't hurt to give the god a cardigan in some terrible earth tone, either.", "images": [], "asin": "0830844953", "parent_asin": "0830844953", "user_id": "AHA5VZQKVUKTVMK7HZDKMWEEVUWQ", "timestamp": 1527904632140, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Be careful", "text": "This book is just over my level of intelligence and so I gave up working with metal.  If you have better skills than I did it would be a great book to have.  Some really good ideas it in, too.", "images": [], "asin": "0871164167", "parent_asin": "0871164167", "user_id": "AGY3U7WLPQQ5E7T2Q66GKAPXTOOQ", "timestamp": 1387411479000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Misleading  title", "text": "This novel is not about the \"rabbit girls\";  the unfortunate  young women selected for experimentation in Nazi concentration camps. Rather, the novel centers around Henryk Winter, his lover Freida, and his daughter Miriam.<br /><br />Henryk was a university professor and he falls in love with a student, Frieda. Frieda was daring, reading degenerate books. As Nazis gained power, he was dismissed from the university and, soon, the SS was looking for him as a political prisoner.  Both he and Frieda were arrested; she went to Ravensbruk; he went to Auschwitz.<br /><br />Years later, he is dying and cared for by his daughter. He thinks she is Frieda. Who was this woman? This question was enough to keep me reading, but barely. A difficult read because of the subject, but also irregularities in the plot, loose ends, and grammatical errors. Find another book.", "images": [], "asin": "B07KF527YS", "parent_asin": "B07KF527YS", "user_id": "AEF7YH527OAB7KWUOZXTF4OBQ2DA", "timestamp": 1568249873995, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "An OK novel but with senseless vulgarities", "text": "Katherine Center is a popular writer with young people, but even at 55 years old I find her books can be enjoyable. Happiness for Beginners has a good plot line and it's well-developed but the unnecessary foul language (which is so much a part of young society today) is still a show-stopper for some. For those who do not object to vulgarity, this is an enjoyable light read that can be enjoyed part-time for about a week. It's an easy read meant for those with limited vocabulary; Katherine is good, and she has kept the prose at a lower level for the age group that would be interested in this material.", "images": [], "asin": "1250047307", "parent_asin": "1250047307", "user_id": "AG4FJYJMR7A6SBCO5IRJGVCP7I7A", "timestamp": 1423167847000, "helpful_vote": 10, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Pocket size basics guide", "text": "It's a little small and the print is tiny but I like the useful Spanish phrases and tidbits are handy.", "images": [], "asin": "1786574918", "parent_asin": "1786574918", "user_id": "AGVOOCS55YNMD7SEFWHVL4WYBAAA", "timestamp": 1626490236563, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "I don't understand the hubbub. Maybe the show is better?", "text": "I have a policy that if you can't make me interested in your story by page 100, I abandon it. This book hit that line for me, unfortunately. The writing is well done, but the story at this point just feels cynical and manipulative (Which is okay for characters, but not tolerable when it's the author), rather than truly engaging. Nothing against Martin; I read his short fiction when I was a kid in the 70's and 80's and loved most of it, so I'm just very disappointed. I have not yet seen the series and I wanted to read the books before watching, but I guess I'll save a few thousand pages of reading and cut to the series now. Maybe it makes for better television than books?", "images": [], "asin": "0553593714", "parent_asin": "0553593714", "user_id": "AGFXWKRZXKEV774KQ5XMHWL2AREA", "timestamp": 1420308045000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Returned. Pictures were sloppily drawn - thick lines - ...", "text": "Returned.  Pictures were sloppily drawn - thick lines - not appealing for a child or adult coloring fans.  Sorry Dover not the quality I've come to expect from you.", "images": [], "asin": "0486469905", "parent_asin": "0486469905", "user_id": "AGJDGUWUGHG5NLH7MR7FLBTMIWEQ", "timestamp": 1463629679000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "not worth your time", "text": "with this book, the author commits the ultimate sin - boring the reader. shame on you ms. cornwell for having turned into a hack.", "images": [], "asin": "B01BKD6YYQ", "parent_asin": "B01BKD6YYQ", "user_id": "AHPGFBVC24634JWHZZ6ZPOMQDKQQ", "timestamp": 1479965939000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not aging well", "text": "This book was written in 2017 and might in that context be considered prophetic.  However, so much has changed regarding the Internet of Things in the past 5 plus years that this book reads as more of an abstract construction of what IoT might be in the future.  Really more interested in specific examples where IoT has been successfully implement and specifically how this can be accomplished rather than an overview of where it could be applied and which management mindsets are most likely to appreciate IoT value.", "images": [], "asin": "1260025896", "parent_asin": "1260025896", "user_id": "AGYXERYRTNHKSRZZRKAZL76IK7OA", "timestamp": 1668617480813, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Acts like he's \"young and with it\"", "text": "I didn't care for his way of presentation.  His remarks weren't cute, not very professional.  Maybe I'm old fashioned but I felt a lot of his words, comments were uncalled for.  I've used it and will probably carry it with me on my trip but I would have preferred the new book by Elizabeth Bingham which I understand is due out in November.  I have her Italian Survival Guide and it is &#34;great&#34;.  I wish her new book had come out in time for my trip.  She is &#34;good&#34; at presentation and common sense.", "images": [], "asin": "1598801880", "parent_asin": "1598801880", "user_id": "AEMZ664KD7SY6FUPXBCPAL6RTQPA", "timestamp": 1379769350000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "The Adolescent Angst of Suburban Boys Who Wanna Be Gangsta", "text": "It's not clear to me what the point of this book is. For a number of years I worked at a small alternative store. Some of the people who frequented the shop identified as punk. The difference between street kids who created their own punk style and the suburban kids who bought their style at Hot Topics in the mall was glaringly obvious. Similarly, every fall my town hosts one of the larger biker gatherings in the U.S. The difference between hard core outlaw bikers and the accountants/doctors/dentists who ride their &#34;hogs&#34; on weekends to pretend they are outlaw is equally glaring. Guthrie, Dylan, and the author were not poor or working class. They all came from comfortable money with Guthrie and Dylan both posing as something they were not. To his credit, Guthrie tried to live the life he sang about. He actually joined the struggle to change things and stayed with it throughout his life until his illness stopped him. Dylan, on the other hand, seems to have consciously decided early on to stay away from any real political involvement. So he appears to be a strange choice to illuminate our political history and the very real anger which grows out of it. That's why it seems to me that this book is really about the angst of two teenage boys, the author's, in his suburban childhood and Dylan's in his younger days. Real adult anger, in the sense this book tries but fails to convey, would not only rail against injustice but would also do something about it, preferably over the long haul.<br /><br />If you want to see what genuine political anger looks like, I would suggest two books to start. The first would be Naomi Klein's &#34;The Shock Doctrine&#34; which will give you the brutally ugly history of the United States from the 1950's to the present, a history that you rarely, if ever, hear in this country. As a side comment, I would note that Klein is also a dedicated activist who acts on her politics. The second book is Marge Piercy's &#34;City of Darkness, City of Light&#34; a searing novel about the French Revolution. She dissects with an angry scalpel how the king, the nobility, the liberal middle class, and the radicals all squabbled and bickered among themselves for power while the working class and the poor went hungry again and again. I would also have to comment that while I know nothing of Piercy's personal life, a number of her novels are very political, burning with anger, with vision, and with hope.<br /><br />There are several other things to add about Daniel Wolff's book. He ends on some grim notes. Guthrie's activism wound down in the 1950's while McCarthyism was raging full force. The last chapter of the book details the harsh economic realities of our times - the collapse of the union movement as well as the growing poverty and income inequality. There are some key things his angst misses though. First, it's clear now that political change in this country moves in waves. There are periods of intense activism as well as lulls and/or times of repression. Second, even with that ebbing and flowing, it's also clear that real change has been happening. Slavery, women as chattel, and child labor are all gone, after some hard fought, long drawn out battles. There is still much, much that has to be done but there have been real improvements for women, for children, for people of color, and for our LGBTQ communities.Finally, as grim as things are economically and politically right now, the core truth of today is that we are at a significant crossroads for all of humanity. The climate change clock is ticking, whatever climate deniers wish to believe. We either change things now or we destroy the earth's systems that sustain human life. Daniel Wolff does not even begin to address that reality in this book. Even so, that's where the real grown up anger of today needs to be focused and needs to be actually doing something.<br /><br />P.S. This is not a verified purchase because I got the book from my local library.  :)", "images": [], "asin": "0062451693", "parent_asin": "0062451693", "user_id": "AHESP2LHOADAN4JS27W2KQ6BYS4Q", "timestamp": 1515837356201, "helpful_vote": 11, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "I really Wish she didn't Write this", "text": "This book is just plain terrible.  I am a HUGE Sookie Stackhouse fan.  I tell anybody who will listen & anyone who wont to read/listen to the Sookie Stackhouse series.  \"It is the greatest ever!\" I tend to bellow & dance about in glee.  Imagine my surprise when I purchased this book only to find my mind wandering off to things not Sookie - bored.  I thought nothing of the book when I wasn't reading it.  I was all too glad to get it over with.  I decided to try and recoup my losses by selling it on ebay.  Trust the reviewers my dear reader, this book is doo doo.  If you must read it, get it from the library before committing to buy such boring lifeless dull garbage!<br />Seriously, how can you have a hot little blond dating a hot Viking Vampire & be bored???  What the heck is going on?  The sex is so dull, the dialogue is dull.  This book should have been titled 'Very Boring Idle Chatter about some Vampires Past' with Small amounts of lifeless sex.  Enjoy!  Uhg!<br />It is best to pretend that this book never happened.", "images": [], "asin": "0441018645", "parent_asin": "0441018645", "user_id": "AG7JCEMC64AM7JPATDVGP6YZOTXA", "timestamp": 1274356245000, "helpful_vote": 9, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "\"New\", but defective South Asian Edition. Several pages were ripped", "text": "South Asian Edition. Slow to arrive and defective. The packaging was secure and intact, however several pages were torn, resulting in many pages of missing content..", "images": [], "asin": "8184735332", "parent_asin": "8184735332", "user_id": "AFXSJCUPXIFMUQ3USBEG7L5YBMZA", "timestamp": 1421194855000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "I was hoping for something more exciting.", "text": "Wasn’t super thrilling for me. Not enough drama.", "images": [], "asin": "1501171348", "parent_asin": "1501171348", "user_id": "AEFPNRTUJ4TIFQJW2LJNY3GYFYAA", "timestamp": 1670708314413, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "ok for the price runs very small", "images": [], "asin": "B01LZU90MH", "parent_asin": "B01LZU90MH", "user_id": "AFPWNW6J6DUOWZQG3LPQLBP7M7XA", "timestamp": 1490746391000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "too simplistic", "text": "There is not much theory or technical information. It read more like a user's manual. I didn't learn much from this book.", "images": [], "asin": "0615684378", "parent_asin": "0615684378", "user_id": "AEZEL7PNHTP64S5CTWAFQ44QNSVA", "timestamp": 1373215311000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Ho hum... don't see why he's gotten such great reviews really.", "text": "So so crime drama. Slow, nothing really special about this. I tried 2 of his books just to make sure I wasn't off in my judgement, but I'll move on to someone else.", "images": [], "asin": "B01I79L56S", "parent_asin": "B01I79L56S", "user_id": "AGBFOSUBDTBVADTVF6LD23Z5OZPQ", "timestamp": 1481375101000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Night World No. 2", "text": "This is a combination of my individual reviews for Night World 4: Dark Angel, Night World 5: The Chosen, and Night World 6: Soulmate.<br /><br />I would give this collection a 3-3.5 out of 5. Smith continues her Night World series with Gillian and a guardian angel, Rashel the vampire-hunter with a vampire soulmate, and Hannah and Thierry, the original soulmates.<br /><br />===<br /><br />Night World #4: Dark Angel, by L. J. Smith<br /><br />At first \"Dark Angel\" doesn't seem like a typical Night World book. Gillian Lennox is a normal teenager; someone that many teen girls could probably relate too.  She's not one of the popular crowd but instead is a shy outcast. Her two goals in life are somewhat superficial: she wants to be popular, and she wants David Blackburn to love her. But then who wasn't superficial when they were a teen?<br /><br />Gillian's introduction to the Night World comes when she has a near death experience. On her way home from school, she goes into the snowy woods after she thinks she hears a child crying. Instead she falls into a creek and hypothermia sets in. But she's rescued by Angel, a celestial being who guides Gillian back to the road. But Angel turns out to be more than just a lifesaver, as he starts to help Gillian fulfill her goals. He whispers the secrets of popularity in her ear, helping a shy girl transform into a vivacious butterfly. But as Gillian's status increases at school, she starts to become suspicious of her guardian angel...who is he really? And what does he want with David?<br /><br />The Night World connection in this book is tenuous, but it does make sense. After all, in a world populated with werewolves, vampires, and other supernatural creatures, it's natural that spirits would exist as well. So far Gillian is probably the most identifiable of all the protagonists in the Night World books, as she's your everyday teenage girl who finds out that there's a secret world...and she's part of it. How many of us have wished for that? I know I have.<br /><br />For me, \"Dark Angel\" is a solid chapter in the Night World series, but it doesn't really stand out, but then it isn't bad either. It's a good story of growth.<br /><br />3/5.<br /><br />===<br /><br />Night World #5: The Chosen, by L. J. Smith<br /><br />When she's 5 years old, Rashel sees her mother and her friend killed by a vampire. The vampire tries to get her as well, but even at 5 she's strong enough to resist his mind control. Fast forward twelve years and Rashel is a vampire hunter, existing on the fringes of the Day and the Night worlds, keeping humans safe.<br /><br />Rashel is a very strong character, comfortable in her body and determined because of her past. She's a great fighter and has a sense of honor. When she and a group of vampire hunters capture a vampire, the others want to torture him, but Rashel can't stomach torturing a defenseless being, even if he is a vampire. So she decides to let him go...and then discovers he's her soulmate. To add to the mix, the vampire is Quinn, known throughout the Night World as one of the most soulless, human-hating vampires around.<br /><br />While Rashel is one of my favorite Night World characters, I find the plot of this book a little weak. Rashel stumbles into a Night World slave trade of humans when she rescues a blonde bunny, but then Daphne, the girl she helps, is willing to risk her life to help Rashel take down the operation. The ending is very abrupt as well, without taking care of some loose ends that I would've liked to see resolved. But overall \"The Chosen\" fits very nicely into the Night World series, and uses the soulmate principle that ties all the books together very nicely. Rashel and Quinn are iconic of the opposites attract cliche, but it works for them and they grow over the short time period of the book. I really want to see more of them.<br /><br />3/5.<br /><br />===<br /><br />Night World 6: Soulmate, by L. J. Smith<br /><br />Hannah Snow has the perfect life - she's about to graduate from high school, she already has a college scholarship, and she even knows that she wants to be a paleontologist. But her perfect life starts to collapse when she finds notes that she doesn't remember writing, warning her of a dire event - \"Dead Before Seventeen.\"<br /><br />Increasingly disturbed by the notes and bad dreams, Hannah visits a psychiatrist. On her very first appointment, a werewolf crashes into the building and tries to attack her, but a mysterious voice in her head helps her dodge each claw swipe. She's saved by the arrival of a second werewolf, who chases off the first.<br /><br />Knowing that she has to get to the root of what's going on, Hannah and the psychiatrist try hypnosis, and she's plunged into a vision of a past life, where she was Hana, and a strange boy with blood around his mouth appears in her village...<br /><br />Thierry is one of the oldest vampires in the world, created at the dawn of humanity. He's spent his lifetime searching for his soulmate, trying to find her before her 17th birthday so he can break a cycle of death. But when he finds her this time, she doesn't want his help...<br /><br />\"Soulmate\" is my favorite Night World book. Coming 6th in the series, it exemplifies the soulmate principle Smith has used in each previous book, because Hannah and Thierry are the original soulmates. Hannah's past lives are a great plot device, because it allows Smith to give her lots of growth and abilities; and I really enjoy the stories of her past lives. I wish Smith had done more with that, she alludes to some interesting incarnations of Hannah but only fills in a few. Like other Night World heroines, Hannah's no wilting flower and she does take matters into her own hands when she needs to. Also in \"Soulmate\" Smith starts to introduce a bigger theme if classic theme, saving the world, and it'll be interesting to see where she takes it.<br /><br />If you read any of the other in the Night World series, this book will also give a good update on what your favorite couples are up to, and what they are trying to do.<br /><br />4/5.", "images": [], "asin": "1416974512", "parent_asin": "1416974512", "user_id": "AFVV7CLXY43P3Z3F7SROBZATZVSQ", "timestamp": 1260157579000, "helpful_vote": 5, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Poor book", "text": "This is a book by a person who clearly has no real world experience in the word of digital forensic investigations.<br />While the information is relevant; it should not be used as an authoritative text.<br />There are much better titles and this should be used as a text of last resort.", "images": [], "asin": "0071428046", "parent_asin": "0071428046", "user_id": "AHGZWQO2NJZMTYLPML2RQWTISOJA", "timestamp": 1079374811000, "helpful_vote": 16, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "For pet owners with limited knowledge", "text": "I had high hopes that this book would be full of wonderful, natural ideas given the author. It was a huge disappointment.<br /><br />The information was basic. If your pet is recently diagnosed with allergies and you know very little, this book is for you. This isn’t for people that are already informed about their pet’s allergies.<br /><br />It had a few recipes for food and snacks. It didn’t looked like a balanced diet. I hoped for more natural recommendations and solutions to help my dog with her allergies.<br /><br />I returned the book given the contents.", "images": [], "asin": "1621871827", "parent_asin": "1621871827", "user_id": "AGAZPV7LTWSN7MM6NKQA3PGP567Q", "timestamp": 1595648116063, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Could Have Been A Short Story", "text": "For author Nicole Chung, her adoption was more of a curiosity. Growing up Asian in a white family, Nicole always knew she was adopted. But she did not know much about her biological family and never had the urge to know until she had children of her own. Why was she left by parents she knew so little about? She knew she had been a sick baby and that she had older siblings; did those reasons have something to do with it? Chung eventually tries to start a relationship with her biological family, finding kinship but also some negative developments that keep her at a distance from this new/old family.<br /><br />I love a book with short chapters. It helps make it more enjoyable and makes a quicker read. I read this for a book club and it is not something I would have picked on my own. It was an easy read and for people who enjoy biographies may like this.<br /><br />On the downside I feel this was a story that could have been told as a short story or an article in a paper. There was a lot of stretching her story out.<br /><br />All You Can Ever Know is a look inside the mind of an intelligent woman raised by a family full of love, but not all the information for a child of a different race. Adoptees and those who consider adopting will find solace and strength in a woman who learns that blood is not always thicker than water, but love can be a bridge to new horizons. As for me it was not a favorite but maybe others will gain something from reading this book.", "images": [], "asin": "B079FFPXFJ", "parent_asin": "B079FFPXFJ", "user_id": "AEY5U4ICNOZL6LY5F4N2CH2CM67Q", "timestamp": 1559747952512, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "this book is in pretty good shape", "images": [], "asin": "B0000CIC0N", "parent_asin": "B0000CIC0N", "user_id": "AFGEJNQOVHGHQEPJDOK7I7OMIK7A", "timestamp": 1475760135000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Ok...", "text": "This book could have benefited from a good editor. Was WAAAYYY to long getting to the \"who dun it\". Just an OK read for me.", "images": [], "asin": "B07RWSL54Y", "parent_asin": "B07RWSL54Y", "user_id": "AGHGJ3YAYSJFOKVHV4WMBFLYRQNA", "timestamp": 1598721043365, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Scholarly Look At Dylan", "text": "Sean Wilentz is a noted historian and he uses that historically background to try and articulate how Bob Dylan fits into the seam work of US history from his rise in the 1960's until the present day.  The concept is a good one, it's just that Mr. Wilentz writes in a far more academic scope that is more suited for the classroom than the causal reader would like (more than a few times he uses words that will be out of the vocabulary of even an above average linguist).  He also spends far too much time detailing the life and works of people composer Aaron Copland and blues artist Blind Willie McTell who aren't necessarily thought of as influences on Mr. Dylan's work, but that Mr. Wilentz makes the arguement that they really are.  That being said Mr. Wilentz is a long time fan of Mr. Dylan and he attended several famous Dylan concerts that he recalls in the book.  Also, the section on the recording of 1966's masterful double album Blonde On Blonde is a superbly written, detailed account of the sessions that puts you right in the middle of the action.  All in all, the book has it's heart in the right place, but doesn't always deliver on the execution.", "images": [], "asin": "0385529880", "parent_asin": "0385529880", "user_id": "AH66ZLP5R2D62NUEKGEUCZEICXHA", "timestamp": 1302097906000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Didn't find it interesting", "text": "Didn't find this book interesting or helpful.  Seems a little old fashioned to me.  I didn't even finish it, because I thought it was a waste of my time.  Don't bother with this one.", "images": [], "asin": "B002UGU36S", "parent_asin": "B002UGU36S", "user_id": "AHTL6XWMCAHJJAMBUJ3526WKGW2A", "timestamp": 1382134172000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good read but", "text": "I liked Florence as a character..could have used more of that ..less description of sex...more interaction of the officers.<br />I really don’t have a great feel for Ferraro", "images": [], "asin": "B00GVG0548", "parent_asin": "B00GVG0548", "user_id": "AEFV7SFWYXFMFRYOKVILVQV7P7BQ", "timestamp": 1596881964733, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Not great", "text": "Required text.  Not great for javascript alone.", "images": [], "asin": "1890774707", "parent_asin": "1890774707", "user_id": "AENDE2GIEFRIMLRPK3YNQPQTSIIA", "timestamp": 1431949964000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Three Stars", "text": "I love Jodi Picoult! But, this was not her best work.", "images": [], "asin": "B008J48RA4", "parent_asin": "B008J48RA4", "user_id": "AFFO72VKKZEDABPYLL3RWPGEXZ4Q", "timestamp": 1405510508000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Trash and a half", "text": "I got this book hoping that it would have some insightful information for a seasoned outdoorsperson, with or without dog experience on the trail. When I purchased this book, I wasn't sure if I'd keep it or hand it off to a friend with a new dog, but it's not useful for either of us.<br />First off, it's not a true guide book. There's ONE dog friendly hike listed per state. ONE. With almost no resources on how to find more. No mention of state specific trail finding sites/apps or even AllTrails. Did Jen even do her research or consider the needs of her audience?<br />She's doling out dog training advice like a trainer without being a trainer. She has no credentials to be doing so and should not be doing so. Giving advice on dog reactivity through a book, especially when you aren't a trainer, is dangerous and, frankly, quite stupid. And her advice for finding a trainer via social media and Google? Come ON. Anyone worth their salt would know to point people towards a site like IACP or another place where people can find trainers who have been reviewed by other trainers instead of by their Instagram and Facebook buddies. This is another thing that tells me she really doesn't know what she's talking about on the training front.<br />And then the minimal actual hiking advice... What about the info one needs for truly exploring the backcountry and not just the highly trafficked trails near home? What should folks do when they encounter a bull moose, mountain goat, or black bear with their dog? How about a group with a pack mule or a group of people on horseback? What's the etiquette around dirt bikes and ATVs? Where can we find rattlesnake aversion training and where is that necessary? How much more of an effect do my dogs have on wildlife off leash vs on leash and how should I make the choice to leash or not leash them based on where I am, even where there are no leash rules? These are all things I've encountered and had to consider while traveling with my dogs, and I'm not even an extreme traveler!<br />This book literally only skims the surface of a few topics and doesn't offer any worthwhile information on any of them. This is all info I can easily find for free online!<br />When you look at the acknowledgements, it's easy to tell WHY this book is trash. The credentials for nearly every contributor are their Instagram handles. That's right. This book was written by Instagrammers for Instagrammers. Heck, there's even a chunk in the book about taking photos FOR Instagram and it makes me sick to my stomach that Jen is feeding into the frenzy of being outdoorsy for social media clout. There are far better resources about training and hiking with dogs out there, and I'd recommend pursuing those instead of wasting your money here.", "images": [], "asin": "1493055968", "parent_asin": "1493055968", "user_id": "AFJGTEXFYVNTHFR2K64ROG66I6GA", "timestamp": 1624603527823, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Odd Erotic Romance Between Self-Involved Student, Merman", "text": "THE PISCES: A NOVEL is something of an oddity--an intellectual’s erotic fantasy romance.  I enjoyed the ruminations of the selfish, self-involved viewpoint character (Lucy), as she tried to understand why she couldn’t let go of her long-time boyfriend (Jamie), and why she couldn’t make any progress on her dissertation about Sappho.<br /><br />However, I found her intense physical relationship with a merman (Theo) to be creepy, even though I appreciated the excellence of the accompanying erotic writing.  This novel is so far out of my wheelhouse, I don’t know how to rate it.  However, I suspect that it will appeal to college-educated women with a taste for erotic fiction.", "images": [], "asin": "1524761559", "parent_asin": "1524761559", "user_id": "AEYGPUCRKH7G4VM22FM3VAKSQ23Q", "timestamp": 1535318242800, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Great instructions; needs to outline \"extra ingredients\" better", "text": "Got this book as a present for a college student so that he could learn to make something other than what they feed him at the dining hall.  While a lot of these required purchasing non-canned meat items (which would require refrigeration), there were quite a bit that only used canned and bottled items.<br /><br />However, all of the recipes list \"other ingredients\" (such as herbs and spices, etc.) in a tiny little text box at the end of the large, illustrated ingredients list.  This book would be better served by letting the person know up front that there are extra flavorings that should/can be added to the meal rather than tacking them on as an afterthought.", "images": [], "asin": "157954892X", "parent_asin": "157954892X", "user_id": "AFLJ2L555VW3NP7WZPVPZTFJBGTA", "timestamp": 1293904941000, "helpful_vote": 12, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "homophobic trash", "text": "I love the boys, the tv adaptation is great. The comics are a strange mix of queer baiting and homophobia (racism and sexism too of course). Garth Ennis comes off like the drunk uncle who tells racist jokes nobody wants to hear then says it's okay I have a black friend and a gay nephew. Volume one gave me hope they would have some homophobic characters but deal with the issue, that lasted to about vol 3 and jumped the shark on this volume.  Did he run out of ideas and has to resort to this?", "images": [], "asin": "1606902202", "parent_asin": "1606902202", "user_id": "AEVVUWUFZJLAFIAE7X7MFLSDEK7Q", "timestamp": 1667538462009, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Adorable pictures", "text": "Adorable pictures but the paper is less than desired. These books named always come with the spine rolled back so that it’s not laying flat and i’ve never been able to get that bend Out of the books.", "images": [], "asin": "B08PXD23HZ", "parent_asin": "B08PXD23HZ", "user_id": "AGLQT5HZ2QRR6XQI7J3VQXCRHOVA", "timestamp": 1641760132793, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "A gimmick", "text": "It's a cute idea, having a bunch of authors each write a part of a story.  People who like to namedrop or brag about reading New York Times bestselling authors may like this book because it gives them bragging rights.  If, on the other hand, you are just interested in being entertains, this book won't do it.<br />While I like some of the authors and read everything they put out(Baldacchi and Palmer), there are several that are far too whiney for my tastes.  Well, as you might expect, parts of the book are well written and parts are just plain painful.  Since the authors each are putting their mark on the same story, there is a lot of redundancy.<br />Not a good use of your time.", "images": [], "asin": "B0043RSKCG", "parent_asin": "B0043RSKCG", "user_id": "AECMMWFRKTOFQM2KIG6Y5LU3IHEQ", "timestamp": 1320166733000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Weak", "text": "This, and other recent offerings by this author are getting worse with each book. They remind me of the books written solely by a computer, at least those books had less errors and kept the plotline consistent.<br /><br />This will be the last book I read by this author.", "images": [], "asin": "B09KTMLX91", "parent_asin": "B09KTMLX91", "user_id": "AFMEBSNAVEWOP43UZC4CSQBAMEOQ", "timestamp": 1640278147010, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "You can speed read through this book.", "text": "This book was ok. It gives you insight into Reacher's family history. It could have been a shorter story.", "images": [], "asin": "0399593535", "parent_asin": "0399593535", "user_id": "AGD3GWQD34B5FNNGY6KTEWUXEM7A", "timestamp": 1651751042417, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Okay", "text": "These scores are not really very difficult.  The good side is that pleasant music is available without long and arduous practice.  The down side is that the scores themselves aren't wonderfully interesting.  When quoting classical music that is not itself very difficult anyway, I object to \"dumbing down\" the score.  If you want to quote Chopin--quote Chopin.  Unless it's a particularly difficult etude, there's no reason to mess with that score.  The list of pieces chosen for this collection is just okay with me.  Nothing really hit the spot, and it annoyed me that some of the scores were edited poorly.", "images": [], "asin": "1423403045", "parent_asin": "1423403045", "user_id": "AHNKBGBS3KLJACTK4MDBQQ2W5LYQ", "timestamp": 1369370119000, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It's ok", "images": [], "asin": "0674003128", "parent_asin": "0674003128", "user_id": "AFWP4QVDAAIPR2W6LWMMEWQXA4GA", "timestamp": 1504026487028, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Okay", "text": "Not bad.  It is what it is.  Some good tips, but nothing revolutionary.", "images": [], "asin": "034553025X", "parent_asin": "034553025X", "user_id": "AGRTUWMEGO64NVI2OV5HIZQHIP3Q", "timestamp": 1420686823000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Googling is the same", "text": "I felt most of this info could be found by googling.  It didn’t include issues that I was looking for.", "images": [], "asin": "B01IIQQFCE", "parent_asin": "B01IIQQFCE", "user_id": "AFNR4Q7DAZJHL3N3AJKBWFLV4DWQ", "timestamp": 1626275213903, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "One Star", "text": "Was ok", "images": [], "asin": "0373506937", "parent_asin": "0373506937", "user_id": "AGPGW3YHMIOA7FEK6FNP5UTA25UA", "timestamp": 1414765535000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Hard to distinguish bold lines from lighter lines.", "text": "Good number of puzzles for the price.  The biggest drawback is that the bolder lines between segments are hardly discernable from what should be the fainter lines.  I tried a marker on the darker lines, but it bled through to the puzzle on the reverse side, and of course the didn't line up the same.  I'll have to try a red or green pen to highlight the major divisions.  I do think the puzzle ratings are accurate.", "images": [], "asin": "1689755563", "parent_asin": "1689755563", "user_id": "AFS5WSHPRIIXRW7QKD3C2DFAFVZQ", "timestamp": 1626050534214, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "not the same as the original!", "text": "So bummed this is not the same as the original recording when I was young! I should have read the reviews. My baby doesn't seem to know how awful it is though haha", "images": [], "asin": "0843120045", "parent_asin": "0843120045", "user_id": "AECVZVINWATH26RZLF6GHX5RLD2A", "timestamp": 1432948466000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "I found it to be boring.", "images": [], "asin": "B0024NP57Y", "parent_asin": "B0024NP57Y", "user_id": "AERXYDXDRTI2N2VTSU37BVNZ3ELA", "timestamp": 1472588988000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "A Well Written Tease and Waste of Money", "text": "Too short, the curious reader can skip this one and go from \"Bull Mountain\" to \"Like Lions\"", "images": [], "asin": "B07MQSZTS1", "parent_asin": "B07MQSZTS1", "user_id": "AG53RUTYYYPFW4RTGQXJAI5REBXQ", "timestamp": 1659356237708, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Not good", "text": "I bought this book at the behest of a few friends who loved it.  I thought it was an outstanding story line that was very poorly accomplished.  Its slow, meandering, and at times almost unreadable.", "images": [], "asin": "0062120395", "parent_asin": "0062120395", "user_id": "AHGBQZNDCAM747XB2EDEB6LKYHGA", "timestamp": 1497907459124, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Highland low point", "text": "I really enjoy men-in-kilts/leghose romances, Karen Monig, anyone? What's not to love after all? And I have enjoyed JL's previous books. Here, I felt there was too much \"I can't wait for the hand-fast to be over and then it's see ya!\" talk between h/h and too little of the evolving feelings. By the middle of the book, I was scratching my head about it ever becoming a romance. I also agree that the very secondary romance between her paralyzed sister and Newton had the goods this time. I was touched, amused and drawn into their situation, loved Newton, felt for Charlotte, rooted for them finding their way. The other two, not so much.", "images": [], "asin": "141654710X", "parent_asin": "141654710X", "user_id": "AFKM2ORYCTOWYMCP23MIN6T4632Q", "timestamp": 1371744963000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "editing is not great.", "text": "Decent book, editing is not great.", "images": [], "asin": "0446892521", "parent_asin": "0446892521", "user_id": "AEQCIQAY2GRNFVAH4EC3FUI5OJJA", "timestamp": 1433521178000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A glum take on pedestrian issues in small town America suffering through post-9/11 disillusionment", "text": "Some times you pick up a book and a few chapters in your realize that it's just not for you.  It's dangerous to write such a review, because you expose yourself to the charge of, 'You just didn't get it, you cretin.'  I admit that both aspects of that statement may be true, but I didn't get Jonathan Dee's latest book, &#34;The Locals.&#34;<br /><br />Dee's latest novel takes on the American sense of untethered isolation in the wake of 9-11.  Using shifting perspectives that jump with alarming frequency - kind of like the evil demon in the Denzel Washington movie &#34;Fallen,&#34; who jumps from person to person with a tap on the shoulder, the novel's perspective jumps quickly from character to character - Dee gets inside the lives of a bunch of small town Massachusetts residents.  And everyone is more or less unhappy, bitter, and irritated with everyone else.<br /><br />The opening chapter - essentially a prologue - sets the tone.  The narrator for this chapter is a young jerk looking to benefit from a class action lawsuit while covering up his legal issues arising from his . . . indiscretions.  What becomes clear is that, even though he is in Manhattan hours after the 9/11 attacks, he couldn't care less - he's just out for himself and he sees everyone else in the world as a waste of space.  This sets an unsettling tone for the rest of the book, which I suppose is more or less the point.<br /><br />The 'hero' of this story, Mark Firth, bumps into the prologue narrator as he is also looking to get some money from the class action lawsuit - a bunch of folks have been victimized by a complex swindle.  A contractor in Howland, Massachusetts, Mark has bungled his family's finances, and while everyone back home is initially elated that he survived 9/11, Mark is all too aware of his family's precarious financial straits.  But he finds a potential windfall when an eccentric millionaire moves to town and hires Mark to do a bunch of seemingly needless work at his home.<br /><br />I'll leave further plot details to others and for you to discover, but the overall point of the story is that life in Howland is rather unpleasant.  The town is not thriving, and people seem motivated more by jealousy and frustration than anything else.  The plot - involving development and small-town politics - moves so slowly that it is secondary to both character and setting.  And neither the characters nor the setting ever become all that interesting.  Again, perhaps this is me, but if I want to hear about petty jealousies and frustrations, I can see plenty of those in my daily life.  There is nothing in this book that takes these petty issues to a more interesting place or puts a sufficiently comic spin on them to make &#34;The Locals&#34; that interesting.<br /><br />Dee is a respected writer, so this review probably says more about me than about him.  But for me, &#34;The Locals&#34; ends with a whimper, but I really liked the ending.", "images": [], "asin": "0812993225", "parent_asin": "0812993225", "user_id": "AE64KJRO3QOHPHK47RHSD4LDELHQ", "timestamp": 1503582883975, "helpful_vote": 4, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Three Stars", "text": "Good deal on a good product.", "images": [], "asin": "1931836051", "parent_asin": "1931836051", "user_id": "AECE6WNMWICGMIRCXWDFGJJSGIRA", "timestamp": 1423791561000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Horrible Arrival Condition", "text": "The book came in horrible condition and it wouldn't let me return the product.", "images": [], "asin": "B08C8Z8KSS", "parent_asin": "B08C8Z8KSS", "user_id": "AHXU227H3ARDQRHB3NOSRXGHCVQQ", "timestamp": 1610568473386, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not what I expected", "text": "This was not exactly what I expected. Not much of this is practical because you would have to have TONS of legos in order to create most of the ideas. We have what I thought were tons of legos, from my husband, his brothers, and the ones we have purchased and received as gifts. We have a gigantic box with over 20,000 but can't create the ideas because we don't have the range of more specific specialty pieces. It seems every idea has so many special pieces that it is impossible to recreate.", "images": [], "asin": "0756686067", "parent_asin": "0756686067", "user_id": "AFDQ3CKLQAKZWPCE5IJFRQGBWYVQ", "timestamp": 1377804903000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Alittle disappointed", "text": "While I like the variety of design, this book was a dissapointment. The pages are not perforated  to make removing them from the book easy. The pages are quite thin making it impossible for colors  not to bleed thru to other pages.", "images": [], "asin": "0692684204", "parent_asin": "0692684204", "user_id": "AHCMLEURYJQXNDEJ34KKMMCUIMDA", "timestamp": 1478540605000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Don't waste your time...", "text": "Disappointed that the book was less of a mystery/ thriller; spent WAY to much time and energy on what was nothing more than what amounted to long, drawn-out (and boring,  superfluous) soft porn.  Won't purchase this author again.  Waste of time.", "images": [], "asin": "B000FBFMDE", "parent_asin": "B000FBFMDE", "user_id": "AE5R4Y4Y54XM7J2LLF3ND4WZ6FNQ", "timestamp": 1536411012380, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Every once in a while Amazon disappoints me. This ...", "text": "Every once in a while Amazon disappoints me. This book was actually written in 2004 and released under a Different Name !  Amazon does not disclose that fact anywhere in it's description.  VERY misleading.", "images": [], "asin": "0778318699", "parent_asin": "0778318699", "user_id": "AHWEI6B7WYYGUGUISTD6BPVHJJAA", "timestamp": 1458835573000, "helpful_vote": 36, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "No practice problems", "text": "There are no practice problems. How can you learn math without doing it?", "images": [], "asin": "111929357X", "parent_asin": "111929357X", "user_id": "AEWNFKAPOQ3SGRRF7RDCKBM5XZQQ", "timestamp": 1674557713419, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Very Poor Print Quality", "text": "The left side pages of the book are fine.  The right side pages are very difficult to read due to very poor print quality.  It was if the printing company forgot to change the toner prior to printing.  Quality control failure.<br /><br />Beyond that, this is a book that has a slew of exercises to get you thinking about lyric creation.  The author tries, and provides a decent narrative to stimulate an internal dialogue in creating versus.", "images": [], "asin": "B00N4FPBES", "parent_asin": "B00N4FPBES", "user_id": "AGOC2A74D3FXSRV53VR7ZT6PAGXQ", "timestamp": 1552102419714, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Get a better editor please!", "text": "The Call was recommended to me by a person in a book group to which I belong. Unfortunately, I cannot say that this recommendation was a good one.<br /><br />The premise sounded interesting. Just a few short sentences about a different take on the fae. Very dark, very European, not of the whole new take on the fae wherein they’re ultimately good “people” underneath. No, this seemed as though it was something straight out of the old legends, and I was looking forward to it very much.<br /><br />And then I started reading. There were many scenes in which the pronouns were confused. It was difficult to follow which “she” or “him” was being referred to. And then it got worse. The thing is, though – I do a great deal of work in assisting writers for whom English is a second language in polishing their work, sounding more American, or English, depending on where their target audience is. This book read as though someone stuck it in Google Translate and then never bothered to polish it, to edit it, to give it the attention it deserved. It is for this reason that it gets two stars, not one, because it doesn’t appear to be the author’s fault that the story comes across in this manner. But it does make the story very unreadable.<br /><br />Ultimately, I gave up on reading it, because I wasn’t quite sure who was still alive, who was dead, and who was changed. It would be akin to saying that George, John, Paul, and Ringo walked into a bar, he got a soda, he got a beer, he got a basket of pretzels, and he got a whiskey, with each of those things being pertinent to the story, yet never knowing who got what or, subsequently, who choked on a peanut. All in all, if done with a proper editor, this could probably be a very good story. Unfortunately, it just didn’t end up there in the hands of the current editor.", "images": [], "asin": "133804561X", "parent_asin": "133804561X", "user_id": "AEGOWSKHATFTZYZPWAQAJUM7JQJA", "timestamp": 1499315255089, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Less than", "text": "Says basic and intermediate what arrived was just a bls. And well I'm an emr so I expect what is said I want above basic I can add or forward a pic if you want it but this is less than we have at my fire station", "images": [], "asin": "1890495255", "parent_asin": "1890495255", "user_id": "AFIZM3M6EVPBAQ74WVASQG5QBVTA", "timestamp": 1544426407235, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting Poolside/Bathroom Reading", "text": "Answers to every question in this book can be found on the internet, library or those in a particular field.  It's an interesting book, but it didn't hold my attention for very long.  If you have a scientific background then many of the answers you should already know.  Anytime I need or want an answer to a puzzling question I usually hit the internet first, then if the question pertains to a particularly specialized area I look for forums on the subject.<br /><br />Once read I doubt you will read it again.  It would last longer if you left this book in the bathroom for those special \"alone\" times and read some interesting factoids while business is being attended too.  Or take it to the pool with you when you don't need to concentrate much while reading and watching the kids.  My problem is that most of the questions asked in this book either don't interest me, or I already knew the answers.  See what college education will do to you?!", "images": [], "asin": "0137057385", "parent_asin": "0137057385", "user_id": "AEYVPPWR4CIKWX4BGYKCBCDL2CZQ", "timestamp": 1271289959000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Really uneasy...", "text": "with a book classed as bio written from the point of view of an unstable fourteen year old.  It is hard to know who really is at fault here, but there is no way the mother is given a fair shake, given that the daughter had so little contact with her.  It also tends to be disjointed and truncated throughout, so that one only gets little snippets to go on.  Not a very good bio. or mental health book, either way.", "images": [], "asin": "B0071MLLGM", "parent_asin": "B0071MLLGM", "user_id": "AH5LZS6SHVB7H3MSIOARRGMKOQZA", "timestamp": 1398377599000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Similar to other Haynes", "text": "Bought this along with two Hyundai Elantras. One a 2003 another a 2005. I have to say I already have experience working on cars and doing things like replacing timing belts and other jobs. I know how to search forums for user experiences, problems, and shortcuts. With all that I have opened the book once. Saw that all details were along the lines of every other Haynes I've had, and stuck it on the shelf where it now sits. May be good for a beginner, but there is no great secret knowledge inside.", "images": [], "asin": "1563927217", "parent_asin": "1563927217", "user_id": "AEQWPCNFOCBD2GJ2RZ32N2YS2FKA", "timestamp": 1309187204000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Conrad's writing is unbelievably detailed and interwoven with countless metaphors that make the book sound like a dream-like sta", "text": "I was really excited to read this because of Conrad's legendary status as an author and the fact this book was the basis for the Heart Of Darkness film. However, I found it to read for leisure not as thrilling or as dark and twisted as I had heard it would be. Conrad's writing is unbelievably detailed and interwoven with countless metaphors that make the book sound like a dream-like state. It did not convey as much wretchedness about the Congo as I had anticipated from reviews, but rather just showed the cultural difference between a European sailor and the natives of the Congo. Questionably ignorant, the way that Conrad phrases his understanding seems akin to someone who both does not understand the primitive nature of racism and also someone who does not value anyone differently. It's just a book, albeit a short one, that did not click for me and I'm unsure if it was because of too much hype or it just wasn't for me. I'm glad I read it though to check one off the list.", "images": [], "asin": "0199536015", "parent_asin": "0199536015", "user_id": "AFWWD3L4PHOGCOR7O3XRHRY3NAKQ", "timestamp": 1442324239000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It's Peter David writing about Riker, which is always a good bet", "text": "It’s a good book, it really is, and yet, Stone, one of the non-regular main characters in the book is just such a not nice guy -- to everyone. And, I do get why the character has to be what the character is, but, it makes the book so hard to read because Stone is being so abhorrent to characters that I really like.<br /><br />The plot has two parts. Riker gets temporarily reassigned to lead a team of scientists to check on a planet that’s being terraformed called Paradise. A guy from Riker’s past/youth is in charge of it. They grew up together in Alaska.<br /><br />In Riker’s absence, the Enterprise gets a temporary first officer named Stone. He’s the guy that's just not cool. Okay, during the novel his onion-like layers are somewhat pulled back, but he’s not a character that many people will like.<br /><br />Then there were the wild things. They were a disturbingly interesting part of the story for sure and I thought that that part of the story with the Wild Things the author did really really well.<br /><br />I will always and continue to try and catch up with all the Peter David books, but, this one, while well done, is not my favorite. On the other hand, I can see some of his later books in this earlier one, why he created some of the later characters he created.", "images": [], "asin": "067174142X", "parent_asin": "067174142X", "user_id": "AELZYEUH6UU6UYJI6CXETQZALE3Q", "timestamp": 1559782931061, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Not One-Dish Dinners at All", "text": "I don't get it.  I bought this book specifically to create ONE DISH meals on weeknights when it's just the two of us, and it's full of meals that include the dish, an appetizer, a salad, and a dessert.  You'd spend half your day in the kitchen making this.  This isn't what I wanted at all.  I just wanted ... well ... one dish meals, where you cook the meat and vegetables in the same pot, and maybe even rice and potatoes too.<br /><br />Beyond that some of them just look ... weird -- or so simple that anyone who has cooked at all won't need a recipe for them.<br /><br />I try to review a book based on what it set out to do versus how well it achieved that, and this one falls short.<br /><br />It implies easy and with minimal dishes to wash in the title, but that's not what's inside the book at all.", "images": [], "asin": "0547195958", "parent_asin": "0547195958", "user_id": "AGDNPXZHZBXDJ7ELU54GBGOYHP6Q", "timestamp": 1288808866000, "helpful_vote": 20, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "An important history of a colonial town", "text": "This book is an reproduction and I expected missing pages, strike throughs etc, but I did not expect the book to be printed on the back side of each page.  So it’s one-sided printing on the left facing page only", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Qj7COLKKL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Qj7COLKKL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Qj7COLKKL._SL256_.jpg"}], "asin": "1172188165", "parent_asin": "1172188165", "user_id": "AHQELPOTZL6POW725NSQNJEHHGLQ", "timestamp": 1537978816791, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Poor Value", "text": "This book is made from cheap paper and based on similar pattern books I’ve bought really shouldn’t be priced at more than about $6.99.", "images": [], "asin": "1723102040", "parent_asin": "1723102040", "user_id": "AGUPLKTZ3F2B2SGI4DZNQBQAPNOQ", "timestamp": 1666476688829, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Cute idea but magnets don't stick", "text": "Love the concept: instead of stickers all over that cannot be reused and end up in the trash after one use, these can be used over and over and stay put.  Except they don't. The magnets are VERY small (beware the under 3 warning if your kid likes to put things in mouth) and the pages, while magnetic, are very weak and unless the book is flat down on the floor/table, nothing is sticking anywhere.  The magnets wind up all over the place, even worse than stickers then!  They really need to create more quality magnetic pages for this to work.", "images": [], "asin": "2764317123", "parent_asin": "2764317123", "user_id": "AFJQIXRJJSJXJ2KW67EI7UFDUNRQ", "timestamp": 1357066742000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "A grueling read (IMHO)", "text": "I found this one of the most grueling books I have ever waded through, and I'm not opposed to reading confusing and trying content.  I suppose I'm just not sophisticated enough, but I couldn't wait to get to the last page and delete it off my Kindle.  The story line was somewhat interesting, but not overly so.  The entire book, to me, was just a lead up to the final \"moral\" the author wanted to get across.  Hope the movie is more enjoyable.", "images": [], "asin": "0812984412", "parent_asin": "0812984412", "user_id": "AHVJD5ZQEHLIE74LS3HELIMYAAPA", "timestamp": 1352612158000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "The best part of this book is the actual facts surrounding ...", "text": "The best part of this book is the actual facts surrounding this story. The history and culture of the people in Afghanistan. The characters of the story are kind of flat.", "images": [], "asin": "B004IWR3A6", "parent_asin": "B004IWR3A6", "user_id": "AFL3N4DHCD5LI3D7ZPQSMGA75ZZA", "timestamp": 1416441049000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Black Ops Action and Spy Story. Exciting, but Unrealistic.", "text": "An exciting, but unconvincing, elite combat story. Ideal for those who love weaponry, high-tech spyware, and black-ops combat. The authors certainly love their acronyms. The glossary placed at the end of the book should be at the beginning. There is some attempt here to explore a few characters in a little depth and examine some geopolitical insights. But it doesn't really work well. This is fundamentally a good guys versus bad guys shoot-em-up story, with a little who-does-what-to-who spy mystery included. The protagonist is very hard to figure out. Partly, an old follow-orders soldier with no personal life, partly a crusader trying to rescue the damsel in distress, part super-heroic combat leader. The combat action is the star here. Lots of unreal elements found. The key agency has unlimited budget, equipment, resources, tech, weapons, etc. Yet remains completely secret from everyone in the US Government (except for one man) including all the other spy agencies and military branches. And all the other spy agencies in the world (except one) are completely oblivious to and uninvolved in the major events portrayed. And of course, the key bad guys decide to get together in person and discuss their complete plan in detail just before execution. The action writing is very good. The overall story is rather unconvincing.", "images": [], "asin": "B01AW25FPU", "parent_asin": "B01AW25FPU", "user_id": "AHVFAWEKSTAMC64OGAOIQ2RNYS3Q", "timestamp": 1566506743251, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not the scheming witch so many writers have made her appear to have been", "text": "This story definitely made a more sympathetic character out of Elizabeth Woodville than most writers I have encountered.  She was, in fact, downright likable throughout most of the novel, in spite of the hocus-pocus witchcraft storyline.  And while I did not like Gregory's The Red Queen and have not ever cared for Margaret Beaufort, it was interesting to see how the author switched gears rather believably in her portrayal of Henry VII's mother between her own novel (The Red Queen) and this one.  I appreciated that the witchcraft, while alluded to in the initial encounter between Edward and Elizabeth, was not given any weight when it came to the love and relationship between the two of them. I am normally a stickler for reading a series in order, but in the case of this one, it did not really make a difference (partly due to my extensive familiarity with the characters from other texts).  If you omit The Red Queen and The Kingmaker's Daughter, the other four are pleasantly enjoyable -- enough character development to make the characters believable, and Gregory gets her historical details right when it really matters, as well as keeping  the &#34;bodice-ripper&#34; content of these to a blessedly lesser degree than I have run across in some of her other works.", "images": [], "asin": "1416563695", "parent_asin": "1416563695", "user_id": "AE2QCQ452USRFX2M523MLSQKCMDQ", "timestamp": 1430247044000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Challenging Read, Would Benefit from Illustrations", "text": "If you are looking for a Mars colonization story that covers every aspect of what such an endeavor might look like, down to the level of finest detail, this is the trilogy for you. Everything is described, including but not limited to: the tools used for building and fixing various elements; how the colonists shower; chemical compounds they have to manufacture to create concrete and other materials; and a healthy dose of love interests and \"office politics\". It doesn't quite fit the mode of a \"Space Opera,\" but it is ambitious in what it attempts to convey, both on the level of world building and human interaction.<br /><br />That said, it's a challenging read because the work-up to the main conflict and action takes time. It's fair to say the story would've benefitted from a more aggressive editor, cutting back on some of the exposition and every day dialog. The author wants us to know what it would literally be like to live and work on Mars with a collection of strong personalities, but the truth is as readers, it's better to be spared some of the more mundane or tiresome details. Making a work of fiction too much like real life, is not necessarily a virtue.<br /><br />What would also benefit the story are a few well-placed illustrations or line drawings, showing us (instead of telling us) what some of the complex habitats, rovers, and other components actually looked like. It can be difficult to actually picture the things the author talks about at points. In fact, at points I felt this work might be better experienced as a trilogy of 2-3 hour movies or an HBO mini-series, marrying the detailed story with some impressive visuals.<br /><br />Overall the quality of story-telling is good but I've rated this three stars for the amount of effort required to get through, and the lack of visuals where warranted.", "images": [], "asin": "0593358821", "parent_asin": "0593358821", "user_id": "AGCCJEVXZ7PWASGPWAP4I4ZAMEAA", "timestamp": 1664377321931, "helpful_vote": 8, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "No depth and mostly action, makes for a dull book.", "text": "I can just barely give this 3 stars, and that mostly because Tim does try to humanize a couple of his characters.  Unfortunately I don't really think you can humanize psychopaths, but he does try and manages to a degree.  It doesn't really make them likable or the story all that readable.<br /><br />However when you combine that with Tim Nolen's kinetic writing style with hell breaking out every other chapter, you end up with a tale that some will love for the action, but which in the end doesn't really fill up a reader with a lot of interesting and fun story to read.<br /><br />If you like Tim Nolen's Defiant tales, or if you love action novels, this will be enjoyable.  If you want deep characters, look elsewhere because despite Tim putting a bit more time into character development there is little of that here.", "images": [], "asin": "B00MMK75M2", "parent_asin": "B00MMK75M2", "user_id": "AE747CPTU3RCQNGPY4OYSSKJHKQQ", "timestamp": 1410782524000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "meh, treat yourself to a current book", "text": "meh", "images": [], "asin": "0072408154", "parent_asin": "0072408154", "user_id": "AFKUPQPGONUVJ4FLKUFN6FXCLYYA", "timestamp": 1518913023459, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good Starter", "text": "Great for beginners.", "images": [], "asin": "0634061771", "parent_asin": "0634061771", "user_id": "AHQKCRAIW6KOCBXNQQ2HCMDHPPCQ", "timestamp": 1509991026128, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "The print for the clues and the puzzle grid itself are SOOO small.  Almost unreadable.", "text": "Why oh why don't I believe previous reviewers!  The pages are the same size, but the print is MUCH smaller.  There is plenty of room on the page to take the font size up a couple of points, like it used to be in the old days.  Both the puzzle itself and the clues are very noticeably smaller than in the old days.  Break out your fine point pens for this one.  Same puzzles, but I won't be buying any more of these books.", "images": [], "asin": "1250055962", "parent_asin": "1250055962", "user_id": "AHY7U6BSQOHBMRIIYF2R26FJ62SQ", "timestamp": 1458411361000, "helpful_vote": 8, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I Now Feel Sorry for Bieber", "text": "I had a really hard time deciding how I felt about this book; I thought it was absolutely entertaining, but I thought there was something maybe missing. My conundrum:<br /><br />Positives:<br />- The story is quite plot-driven, making it an interesting read. The book is set up by tour stop, moving from LA to the New York eventually<br />- The relationship between Jonny, and his mother, Jane, seems to be what I'd imagine it to be when a parent has taken control of their child's career. She wants to the best for him, but she also wants the best for her business... which just so happens to be her child...<br />- Getting into Jonny's psyche and seeing his struggle between wanting fame and a regular childhood makes him a very sympathetic character. You have to wonder how many of these poor child stars are absolutely miserable and feel forced into their insane schedules.<br />- My favorite character was definitely the bodyguard Walter, the most down-to-earth character in the novel. He genuinely cared for Jonny, protecting him from dangers and trying to give him some tidbits of normalcy.<br /><br />Negatives:<br />- I thought the \"find my father\" subplot was weakly developed.<br />- The book lacks the depth it could have; at times I thought this on-the-surface aspect was actually a trick, that the reader had to look further to really see the depth. And all I came up with was poor little rich pop singer kid who doesn't know his dad, may want a chance at a regular life, and has a mom with some serious issues. I can get that in an E! Special or in an issue of People.<br /><br />I think is in a great airport of beach read- definitely entertaining with some really great parts, but as a whole it may not live quite up to the hype.", "images": [], "asin": "1476705852", "parent_asin": "1476705852", "user_id": "AGPQMEN2CQFW4JNLU3ET3H6FPH5Q", "timestamp": 1374798800000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great writing; didn't love the storyline", "text": "I'm a sucker for any rom-com type book.  This one had such great characters and was written SO well...but I didn't care for the storyline at all.  eek.  I just thought it was too far fetched in concept!  Hoping this author writes more Rom-Com - as I did enjoy her style!", "images": [], "asin": "0525539174", "parent_asin": "0525539174", "user_id": "AGWT3DNQNAOQR4CZ42FXSODXRZWA", "timestamp": 1567102093508, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Comprehensive, But Watch For Inaccuracies", "text": "This book is part of a series of reference books about countries all over the world. The information is comprehensive and serves well as a good reference source about things of the country you may not find in a wikipedia. It focuses on the different ethnic groups in Puerto Rico, and on its customs and traditions (e.g. dance, music, folklore, etc.). The language is accessible for 4th to 6th graders. The book is quite informative, but it is not meant to be an in-depth study of a culture. It is merely an introduction to it.<br /><br />However, in spite of its encyclopedic approach, there are minor setbacks. I don't think that Puerto Rican historians were consulted. The text says on page 9 that Puerto Rico obtained its independence from Spain. Such thing never happened. There is a serious omission on black slavery, only mentioned in a couple of lines. And although I'm aware that this book is not meant to give a deep coverage on history, the editors strolled through important events, such as the Spanish-American War, the Foraker Act, and the Jones Act, this latter law, which gave Puerto Ricans American citizenship. Next, carelessness is noted when the editors claim that the Protestant Church in PR split in other sects such as Jehovah Witnesses and Mormons. These two religions were never offshoots of Protestant Churches. I use it in the classroom to teach reading comprehension skills using culturally relevant material, but I have to do my own research to ensure that the content is accurate. The editors could improve these series if they had experts on the subject matter writing these texts. Thus, I am reluctant to recommend it for classroom use.", "images": [], "asin": "0778797023", "parent_asin": "0778797023", "user_id": "AGUU52WQROYZ6E7NOKR6JYXRINRQ", "timestamp": 1351820363000, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Babcia made the best cucumber salad.  It's not just...", "text": "Cucumber salad is wrong so I'll be back to give more stars if I stumble across any actual effort or research by the author.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71lfkyIN-gL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71lfkyIN-gL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71lfkyIN-gL._SL256_.jpg"}], "asin": "1510702199", "parent_asin": "1510702199", "user_id": "AGAQ465A3I6U6P55KXJZNTKFG53Q", "timestamp": 1665862906757, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Couldn't finish it.", "text": "I couldn't stand it, so I put it aside and forgot about it. (But it might mean more to someone else.)", "images": [], "asin": "0892962984", "parent_asin": "0892962984", "user_id": "AGHMQBDIO7QYA5OAHIAZPUE2SFGA", "timestamp": 1439688954000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "great expectations", "text": "great plot, great scenery, great characters, a fine hand driving the keyboard on the computer  --  and a trip wire too late in the game for the story to get back to even.  &#34;oh, i guess i'll just go to town and see what things look like when i get back.  ahh! there he is!  the killer!  aww, i shoulda knowed.&#34;  there's a lot to like here; just that one little problem.  otherwise, this might look like tony hillerman was back at work in the great southwest.", "images": [], "asin": "1555975984", "parent_asin": "1555975984", "user_id": "AGUZDRTJ7HXSJR4HXC4ADSZGNP3Q", "timestamp": 1374255836000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great debut novel", "text": "Provides an interesting view of the turmoil filled time after the deaths of Alexander the Great, told from the perspective of a lowly foot soldier. The first person narrative is full of colorful and descriptive details, which however sounds hollow and dry at times, especially in the first half of the book; a good editing would have been beneficial. But all in all, the story captured enough of my attention, so that I will most likely pick up the continuation of our young protagonist when it comes out.", "images": [], "asin": "1502703378", "parent_asin": "1502703378", "user_id": "AGZCBKMEUJ53NIOHK4EIRW4AFSLQ", "timestamp": 1438707987000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "poorly written", "text": "---I received a complementary copy of this book. ---<br /><br />Good idea of a suspense novel, but I would have enjoyed reading it if the author had written it as a novel and not as a movie script. Probably about 90% of the book is written in quotations and the author only noted a couple of times as to which character was saying what. This made it very difficult to understand who was saying what and it seemed as though the author expects the reader to know (which is not possible because there is hardly any description or background given about the characters). To me, all the characters were the same and had no personality. I did not relate to any of them and for that reason this book will not be memorable.", "images": [], "asin": "B00AH2LK8W", "parent_asin": "B00AH2LK8W", "user_id": "AFI4XBGS6JWVEHFMBNXTEZ4ZP5UQ", "timestamp": 1360476755000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Complicated yet simple", "text": "(3.5)<br />I had so much trouble figuring out what to rate this book. It's very well written. When it's meant to be creepy, it's definitely creepy. If it's meant to be sad, you feel the sadness. The darkness that surrounds this book is incredible because it just seeps into every single part of you and the more you read the more it weighs you down, but in a great way since that's really what you want a book having anything to do with Lovecraft to do. The writing is a huge success.<br />The story is up and down though. I think some people are going to be all in on this one right to the very last word and soak up every second of it. Then there will be others that are going to be disappointed with the way things pan out at the end. I'm not sure what I think about the end but I think it may have ended rather abruptly. There just wasn't enough time to let it sink in and it was over.<br />I'm not telling you about the story because it's a step by step story and one that, for me anyway, is a little difficult to explain without spoilers slipping in. If you are interested in this book I do recommend you give it a try. That's really the only way you'll know for sure if you like it or not. It's way easier that way than trying to describe it. Go for it, you may love it.", "images": [], "asin": "194045655X", "parent_asin": "194045655X", "user_id": "AHWCZ47A7FIYEJ7KEJG3BO3F5YXQ", "timestamp": 1584728983252, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Chop off his head!", "text": "Kind of hard to think of someone chopping off someone head and putting a gold coin in their mouth and then sticking the head on a fence.<br /><br />Look out it may be your head next. Most of the cast is very low class with not interesting dialog.<br /><br />Didn't find the book all that interesting, however if gruesome murder is your thing you may like it. It does have some interesting theories.", "images": [], "asin": "B0054E9PXK", "parent_asin": "B0054E9PXK", "user_id": "AFKVEYUEPC55J5GNL3MXHVYVJJ7A", "timestamp": 1404222774000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Bias toward Great Britain", "text": "Lots of inaccuracies, the worst is the statement that the Lusitania was sunk  by Germany without warning when it known that Germany put ads in many New York newspapers warning Americans not to sail on the ship because the ship was carrying munitions to England and under the rules of war legally could be sunk. Johnson has a terrible bias toward GB and it taints his writings.", "images": [], "asin": "0060930349", "parent_asin": "0060930349", "user_id": "AEF3S3ZMLGQLGFJ2DQU4V725AZNQ", "timestamp": 1617727310664, "helpful_vote": 1, "verified_purchase": false}
