{"rating": 4.0, "title": "Astonishing costumes", "text": "Phyllis Galembo is to be celebrated for her superlative photos of African costumery, thereby showing us the fantastic, fabulous, imaginative genius of the people she photographs. I'm in awe of such creativity. I must say, though, that the book was a disappointment. Its production did not live up to its subject. The photos themselves are fine - although I did expect a somewhat larger format, but there is something flat & ordinary about the dust jacket; the white background, the lack-luster font, in fact the general design, but, more important to me, is the inconsistent photo display. Some pages have photos on each side, most have photos on one side, with a blank reverse side. Its unprofessional appearance cheapens the presentation and gives the impression that the publisher wanted to make the book thicker than (to my mind) it should rightfully be.<br />This is simply to forewarn, not to discourage, would-be buyers. The costumes are delightful, inventive, utterly wonderful. In spite of my somewhat serious quibbles with the production of the book, I'm still glad to have it.", "images": [], "asin": "1905712170", "parent_asin": "1905712170", "user_id": "AE7XWRB4WHER4JLMODKZ4TNUFGQQ", "timestamp": 1353008888000, "helpful_vote": 6, "verified_purchase": true}
{"rating": 5.0, "title": "Great !", "text": "Fiancé loved it !", "images": [], "asin": "1075388651", "parent_asin": "1075388651", "user_id": "AE2GALR67IVBEGF2PBNFLBWBSDRQ", "timestamp": 1593733919772, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A boat race between three captains an their boats!!", "text": "A great mystery of who done it and why!!  Books by Wendy Meadows are hard to put down! You want to know what happens next!!", "images": [], "asin": "B075TGRLW8", "parent_asin": "B075TGRLW8", "user_id": "AGLHPBAWCSDABZGBLBLIEIMBUDMA", "timestamp": 1624137804485, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "We Gotta Get Out of This Place", "text": "This is a side of the Beatles that I didn't know much about -- the business side. After their first manager, Brian Epstein, died, they needed a new manager and how. Their finances were in a mess and none of them had any idea how to deal with money. At least the Rolling Stones had grown up in middle class families and Mick Jagger had even attended the London School of Economics for a year, so they were a tiny bit less unprepared for sudden wealth. Allen Klein, a New York accountant who had made a career representing American singers such as Sam Cooke and Bobby Vinton, was extremely ambitious and convinced the Stones that he'd get them more money, lots of it. He followed through, so the Beatles were interested. Paul McCartney was wary though, and with good reason. Klein was an operator and while he did get more money for his clients, he made sure he did all right too. Somehow he had ended up with the rights to all of Sam Cooke's songs and made questionable tax shelters for his clients.<br /><br />Author Fred Goodman goes into great detail about the angles Klein was playing and sometimes it gets a bit convoluted, but that's the way Klein liked it. Lots of celebrities and gossip here, but mostly business ins and outs and to be honest, I had to skim it in places just to get through. Nice look at a different take on The Beatles though, and no one comes out of it looking good.", "images": [], "asin": "0547896867", "parent_asin": "0547896867", "user_id": "AHROIP3MOAESZ2GHJ4PWLTXIYBBQ", "timestamp": 1433714228000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Great", "text": "It would be helpful if anything happens to my car.", "images": [], "asin": "080199313X", "parent_asin": "080199313X", "user_id": "AELS363CMDBWNUBMKIYOFLYL2UKA", "timestamp": 1616200318221, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Could not put it down!", "text": "This was a great read -- strong, real characters moving through the intrigue of our recent history.  Well researched and tightly written.  Don't miss it!", "images": [], "asin": "0991598903", "parent_asin": "0991598903", "user_id": "AEJ5ZVX5RGIPTNVX3KKCRISRF2PQ", "timestamp": 1396043611000, "helpful_vote": 4, "verified_purchase": false}
{"rating": 4.0, "title": "Four Stars", "text": "Great book, perfect summer reading for the avid reader.", "images": [], "asin": "0316412694", "parent_asin": "0316412694", "user_id": "AH2HLCTELNOUQDOMLR4DDVFSAO2Q", "timestamp": 1530563355039, "helpful_vote": 0, "verified_purchase": true}
{"rating": 1.0, "title": "ramblings of an insipid", "text": "First of all, isn't there something to be said for aesthetics when it comes to covers?  Well, then, the cover definitely has to be altered.  Maybe they could put a picture of a house plant on there or something to represent this guy's personality.<br /><br />Secondly, the book tries to take itself way too seriously.<br /><br />and C. Polite? Timid? Is this guy supposed to be funny. I thought  he was a serious art critic, then I start in and he's talking all this politix crapola.  Is this guy a comedian or not?  I thought he had a show on amazon.<br /><br />I once saw him do stand-up comedy and he was funny.  He talked about funny things.  But here, this ain't no pulitzer writing 'dat for for sure.<br /><br />Maybe he try again, but I afraid his publisher no like any more and he have to self-publish, mebbee.<br /><br />I'd rather read Dr. Seuss -- this fox ain't got no sox and his ham and egss is done greened on him.", "images": [], "asin": "1594865051", "parent_asin": "1594865051", "user_id": "AHCWW5L7P4F67OEREGR3GNXZYBRQ", "timestamp": 1166500053000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "Adorable", "text": "My kids love this book!", "images": [], "asin": "0620819405", "parent_asin": "0620819405", "user_id": "AEOTKWIYWFWR5SSKRGE4ZMHQRNKQ", "timestamp": 1585065272341, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "nice", "text": "Simple and convenient. I wanted more ballet sessions than workouts but i must have misread it! Great book though :)", "images": [], "asin": "0688152023", "parent_asin": "0688152023", "user_id": "AESADJB74YQ527BRVLO2M6OLXWVA", "timestamp": 1394578515000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A great book for add to your collection", "text": "Highly recomended for those who wants do it manga, is very esencial, and if you are a fan from Hirohiko Araki and Jojos Bizarre Adventure, this book must be added in your collection", "images": [], "asin": "1421594072", "parent_asin": "1421594072", "user_id": "AHMXI2VRROEBPPMOIHN7ISFEQF4Q", "timestamp": 1508976813471, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Love Flavia - but I was disappointed", "text": "I pre-order these books as soon as they are announced, and then gobble them up as soon as they are delivered.  This one, however, was a slog to get through.  Flavia and Dogger have their first 'case'.  All the characters are a delight, the scenes beautifully described, but the story from beginning to end stumbled along.", "images": [], "asin": "B07CRB7SCX", "parent_asin": "B07CRB7SCX", "user_id": "AFCXO6ULQMAHW5N4WUJ4HRIQJUPQ", "timestamp": 1550186758092, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Helps with Food Recognition", "text": "My son LOVES these books.  This one is not my favorite of the collection, I actually prefer the vegetables.  But, this one does have the same effect... a few weeks after getting this book in our regular rotation, my son started actually eating the apples and pears we'd been offering him for months.  Go figure!", "images": [], "asin": "0763648035", "parent_asin": "0763648035", "user_id": "AHT7CTO6CP4RF3YMQSJG4ZV62LJQ", "timestamp": 1421603389000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Fabulous", "text": "Fabulous read.  Could not put it down.<br /><br />I do understand that doors are more easily opened to certain people, but do not understand the concept that you need to be Hispanic/latinx  in order to study/research issues related to that ethnicity and write prose regarding them.  When has study, research  and creative license been limited to only the ethnic group who experiences these struggles?<br /><br />Many people write detective fiction when they themselves have never been employed as a detective...  or “stories” regarding the catholic faith when they themselves are not Catholic.... or WW II stories when they were  born well after D Day, etc.<br /><br />The injustice that surrounds which authors and “stories” are picked up by publishers should not be laid at the foot of Ms Cummins.  She has written an un- put- downable story, although heartbreaking, and she should be commended for her talents.", "images": [], "asin": "1250209765", "parent_asin": "1250209765", "user_id": "AEGO6FXK6WR4VIFYVUIXCOGZ6NFA", "timestamp": 1580264735324, "helpful_vote": 124, "verified_purchase": true}
{"rating": 5.0, "title": "Her Restless Heart - Mary Katherine's Decision!", "text": "Mary Katherine was fed up living at home with her controlling Father; besides being controlling her Father was never satisfied with anything Mary Katherine did.  There wasn't any way of pleasing her unbearable Father.  When she couldn't stand it at home any longer she moved in with her Grandmother Leah and works in her Grandmother's shop called Stitches in Time.  Mary Katherine loves her life working in her Grandmother's shop.  She also loves to weave and enjoys coming up with her own designs using textures of cotton, wool, and silk.<br /><br />Mary Katherine's cousins Naomi and Anna works in her Grandmother's shop too.  It seems like one happy family.  She feels the love from her Grandmother and cousins that she doesn't feel at home.<br /><br />Jacob has been a friend of Mary Katherine's for a long time.  Jacob wants more than friendship and hopes to court her.  Mary Katherine has told Jacob she isn't interested in being anything but friends.<br /><br />Daniel, a long time school friend of Mary Katherine's and Jacob's, has come back to Paradise to sell the family farm.  Daniel's family decided to move to Pinecraft, Florida several years ago.  Daniel too shows an interest in Mary Katherine and urges her to come visit him in Florida.<br /><br />To the dismay of her parents and grandmother Mary Katherine hasn't joined the church yet.  Her heart is restless and she doesn't know where she belongs.  Does she have enough faith in God to trust Him?<br /><br />Will Mary Katherine leave her Amish upbringing and move toward the English world?  Will she go visit Daniel and his family in Florida and end up staying there?  Will she fall in love with Jacob and join the church?  What will Mary Katherine do to calm her restless heart?<br /><br />The author takes us through the private life of Mary Katherine and her parents.  She shows us a side to Amish families that other Amish fiction authors might not.  We are taken into the real life of what happens and does happen in some relationships.  I really liked that about this book.  We can compare it to our way of living also.  Are we really so much different?<br /><br />This was another great read of Barbara Cameron's and I loved it from beginning to end.  I can't wait for book 2, Journey of the Heart, to be released.  This will be Naomi's story.  I get the feeling there's a lot going on in Naomi's life!", "images": [], "asin": "1426714270", "parent_asin": "1426714270", "user_id": "AF6SFOLBSFDP7PNZLPDTI66NIEZQ", "timestamp": 1336861732000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Great read.", "text": "I love time period. Well written. Would definitely recommended all Philippa Gregory books to anyone who has  the same interests.", "images": [], "asin": "B006BAEQB2", "parent_asin": "B006BAEQB2", "user_id": "AHQUAFDHQP6FPFAWNRFOQCWC4VEQ", "timestamp": 1420629183000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "It was perfect!", "images": [], "asin": "1401312853", "parent_asin": "1401312853", "user_id": "AESYA2OLDU6VMRIR2SLRCLD4UIQA", "timestamp": 1472589763000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Fantastic read!", "text": "Absolutely a great read! Couldn't put it down, I had no idea there was this side to yoga.", "images": [], "asin": "125004278X", "parent_asin": "125004278X", "user_id": "AEZVC76FMAZEPMVE7GF4E4RDDSDQ", "timestamp": 1589885178125, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Ben Miller comedian/ physicist", "text": "A fun read by a funny man.", "images": [], "asin": "0751545007", "parent_asin": "0751545007", "user_id": "AHCBAYMJVLTILRVTBKJIPB3VIDWQ", "timestamp": 1450247648000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Three Stars", "text": "Vg", "images": [], "asin": "1118120280", "parent_asin": "1118120280", "user_id": "AFZ2XU2W4WKQRGQRSWYYS6HDAHCQ", "timestamp": 1416595418000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Even better than Ghost Signs 1", "text": "Great follow up to the first volume. More background information. Thorough, heartwarming look at New York's past, both distant and not so far away. Images are well done and make you want to run out using the book as a guide to view these priceless gems yourself.", "images": [], "asin": "076436362X", "parent_asin": "076436362X", "user_id": "AGXRHIBSD2DC562OCV5ZPNIVCTZQ", "timestamp": 1658887264031, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "An Indispensable History of Anime", "text": "In this book, Ladd offers a vital perspective: one that comes directly from the creative pioneer who brought anime to the Americas -- not just to the U.S., as some anime web sites mistakenly claim. It's a relief to have found a book which provides a wholly accurate, engaging, and detailed history of anime. I grew up watching Gigantor, Kimba, Astro Boy, and the other anime series Ladd was responsible for bringing to us. This book offers a much-welcome and informative way to feel connected again to those programs, and that period.", "images": [], "asin": "0786438665", "parent_asin": "0786438665", "user_id": "AGIIEHXFYEPPKFPUCOW4O56FS4DA", "timestamp": 1669541085366, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "An adorable story about two friends.", "text": "&#34;Kitten & Butterfly&#34; written by Aviva Gittle and illustrated by Tekla Huszár is an adorable book that I enjoyed a lot. Even though Kitten and Butterfly have many differences, they still become very good friends.<br />The illustrations are so charming. I especially liked the way Author Aviva Gittle added extended fun with coloring pages at the end of the story.<br /><br />(I received a copy of this story through a free promotion held by the author.)", "images": [], "asin": "149425624X", "parent_asin": "149425624X", "user_id": "AHTMBGL63DTHJGUMQ7CDENHR33MA", "timestamp": 1457554205000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "children's books", "text": "For some reason which I personally can't fathom children LOVE these books. My 10 yr. is required to read 20 mins. per night for school. At least with this book I don't have to fight with him to do it. He WANTS to read this series.", "images": [], "asin": "0810971496", "parent_asin": "0141324902", "user_id": "AFYALMZO37YSEFN5ADVXR2APB4WA", "timestamp": 1256215021000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Action", "text": "Packed full of action", "images": [], "asin": "B005FNIXCE", "parent_asin": "B005FNIXCE", "user_id": "AEZVRJ4WK5YDNAJ73PU74ANEZEZA", "timestamp": 1476319107000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Nice Value Priced Book", "text": "Nice book for the price, double sided so that limits me to only coloring with pencils but I am okay with that", "images": [], "asin": "0486480283", "parent_asin": "0486480283", "user_id": "AFGKL55BEW43I2V26UWBGHIXU64Q", "timestamp": 1552232778856, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Very good book", "images": [], "asin": "0062094475", "parent_asin": "0062094475", "user_id": "AEQNBVVUCK634COJAI3NQZNNSNRA", "timestamp": 1429655322000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Great questions", "text": "I like the questions but i didnt like how there are no lines for where you write its like copy paper, and i have OCD so i just answer them somewhere else", "images": [], "asin": "0593329910", "parent_asin": "0593329910", "user_id": "AFEU5NWELNNQWKNGEUKTSZ2A4PIQ", "timestamp": 1630292800412, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Una novela hist&oacute;tica que se lee muy sabroso.", "text": "Comenc&eacute; leyendo la versi&oacute;n papel, que recib&iacute; como regalo, pero es un mamotreto inc&oacute;modo, como el libro me fue gustando compr&eacute; la versi&oacute;n Kindle para leerlo c&oacute;modamente. Cuando uno se acostumbra a leer en el Kindle, ya no es f&aacute;cil aceptar libros en formatos inc&oacute;modos o pesados.<br /><br />La traici&oacute;n de Roma se disfruta, es una buena novela. Habla de costumbres y aspectos de Roma interesantes, es muy din&aacute;mico en presentar los juegos de poder de los l&iacute;deres de la &eacute;poca -aunque en eso mucho ser&aacute; aportaci&oacute;n del autor. m&aacute;s que informaci&oacute;n hist&oacute;rica, lo cierto es que resulta congruente y con muy buen ritmo de narraci&oacute;n", "images": [], "asin": "B00699M9HI", "parent_asin": "B00699M9HI", "user_id": "AEDA5Q2OGRHROPTXCBLYGKGVBKVQ", "timestamp": 1394741691000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Love this!", "text": "I never even knew this existed until it randomly popped up one day. I am very much into anime and manga, so I jumped at the chance to read a compilation of stories from artists I'd never read before, created from all around the globe. Gorgeous art, great stories, and a fantastic add to my collection. I will absolutely be purchasing other volumes of Saturday AM.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81EY4BVfMTL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81EY4BVfMTL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81EY4BVfMTL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81JhQlxetGL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81JhQlxetGL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81JhQlxetGL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81OHLL+jBdL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81OHLL+jBdL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81OHLL+jBdL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81j1TGVNkfL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81j1TGVNkfL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81j1TGVNkfL._SL256_.jpg"}], "asin": "076037693X", "parent_asin": "076037693X", "user_id": "AFV33VZ7QL345BNRQRV42WD56RMQ", "timestamp": 1665773339202, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "The Accidental Bestseller", "text": "This was my first book I have ready by Wendy Wax and honestly the only story that appealed to me, but I liked this story about 4 friends who met 10 years prior to where the story starts off.  It isn't something to be taken too seriously, but it was a fun read.", "images": [], "asin": "0515148075", "parent_asin": "0515148075", "user_id": "AEGHAHWOWCUQAQPGQDFDLCVVDM6Q", "timestamp": 1317178834000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Excellent!!!", "text": "I found this book to have a very readable and concise history of the environment and the development of the two big cities of Arizona. A good mix of sociology, history, geography, and politics and overall big picture of how they all played a role in the development of Arizona's growth. Great resource for college term papers, or graduate level research, and also good for the layperson who is interested in this subject matter.", "images": [], "asin": "0822942941", "parent_asin": "0822942941", "user_id": "AERXI6TW4DSJ2NVHG4KXJN7TCCKA", "timestamp": 1330980892000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 2.0, "title": "Whats up with the page numbers", "text": "The page numbers in the book are off, compared to other peoples books.", "images": [], "asin": "0205990290", "parent_asin": "0205990290", "user_id": "AF3KA6YU7WWDTVUHYYQBPTU4FJ3Q", "timestamp": 1474737215000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Proceed with caution", "text": "This book is highly addictive and once you crack it open and begin to read...nothing else will matter.  I mean nothing.  Dishes? What dishes?  Feeding the family? Nah, they can have sammiches.<br /><br />Seriously though,  this book is amazingly written.  So many twists and turns up to the very end.  Bravo Alice Feeney!<br /><br />You need this book.  Read it, read it now!!!", "images": [], "asin": "B09NJ8QK38", "parent_asin": "B09NJ8QK38", "user_id": "AHQCSWB4ZRMPEEJSFFFYY2KG6ZJQ", "timestamp": 1672971891057, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "A Great Read", "text": "George Toma has inspired so many people with his great work ethic and dedication. This book does a fine job of detailing the life of a great man.", "images": [], "asin": "1582616469", "parent_asin": "1582616469", "user_id": "AHOWSKAUHPXUS7HBLEFJMZZJUSEA", "timestamp": 1109256717000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 3.0, "title": "Dark read", "text": "This is a morose, but seemingly true tale of life in the 1960's. I don't imagine things are much different now. Our protagonist, although he has a degree from Harvard, has fallen on hard times. Maybe through his own error. Does it matter? There is a random element to life. His family does not even own a car. There is nothing romantic about poverty.<br />Our protagonist begins to contemplate what he is willing to do to improve his circumstances. The early 60's were a time of relative prosperity, and he has somehow fallen behind. He sees others engaging in bad behaviors with relative impunity.<br />At some point the book becomes meandering and quite difficult to follow. I would not describe it as a pleasant read. Everybody in town has some kind of sordid secret which comes to light. I imagine that is the point.<br />I read it twice, maybe 10 years apart, and both times felt like I had missed something.<br />Life is full of dark things. If it hasn't happened yet to you, your turn is coming.", "images": [], "asin": "0143039482", "parent_asin": "0143039482", "user_id": "AGVLWIZVAXZLKXXFFIYEP2I5LQAA", "timestamp": 1611238716070, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "This Author Has So Much To Offer", "text": "It's hard not to fall into the alternate universes that Mike Chinakos has dreamt this time around.  Make way and make time for these stories.  While I have read his two previous novels of Hollywood Cowboys and Kiss of the Traitor, his writing style demanded my attention to explore this short story compilation.  This series of shorts follows a universe set in motion by a character named John Wayfinder who puts the reader in the near and far futures of humanity following an alien event.  Nearly all of the stories overlap in some branched way and somehow are all connected into exploring a unique idea of becoming \"unstuck\" in the universe; a premise that a single person can move forward and backward through time along a created universe, to recruit an unlikely team to rid the timeline of his own mistake.  A genuinely fun and light-hearted sci-fi read, there are moments where action takes over logic and launches us readers into a void where we question motive over moral.  A solid read throughout.  I highly recommend this collection, and, if you have not read his other works, you should add them to your reading list as well.", "images": [], "asin": "1492713627", "parent_asin": "1492713627", "user_id": "AFQKUP45WQKOUSDLPOKAGWK5MLOQ", "timestamp": 1380611078000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "Good Pro Tips If You're A Beginner", "text": "I found 12 recipes I wanted to try and actually got to make two of them. Farro Salad and Chicken Marbella. It was my first time eating farro and now I love it because of Ina! The Chicken Marbella seemed to be too oily. Other than that, it was a good chicken dish and wasn't complicated at all. I look forward to trying her other recipes in her cookbook. Thank you Clarkson Potter for the free book!", "images": [], "asin": "0804187045", "parent_asin": "0804187045", "user_id": "AGUKKWQHRI2Q7G4WNKMV6I6VFKRA", "timestamp": 1553863542063, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great purchase", "text": "When I bought it I was expecting a pretty deck but it surpassed all of my expectations. It comes in a hard box with a greatly written guide book. The cards are made out of great card stock and are just gorgeous!", "images": [], "asin": "0593135148", "parent_asin": "0593135148", "user_id": "AERDH5LZXLAL7FRXABOJJLQQNHPQ", "timestamp": 1601651288893, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Not as advertized", "text": "The title is shown is not in English but English is listed as the language.  It is not.  I bought books for my grandchildren and now I need to reorder.  I am not disappointed in the book but in Amazon's inability to get the facts correct.", "images": [], "asin": "1573061158", "parent_asin": "1573061158", "user_id": "AG6QHKFK6T7K3FLWJWAYTSIG2KUA", "timestamp": 1335400952000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Great book", "text": "Simple, but to the point. Got it for my 8 yr to give for my husband for Father's Day, age group should be 6 yr old below.  It's cute but for pre schooler.", "images": [], "asin": "0060543116", "parent_asin": "0060543116", "user_id": "AG2LREHCJE4HIAHGCCX55H6W7JKA", "timestamp": 1402494570000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "good book", "images": [], "asin": "0806315792", "parent_asin": "0806315792", "user_id": "AFGNIP4VHIQ6LMFUTVWJQMLVQC5Q", "timestamp": 1434122150000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "must have", "text": "I have Martha Stewart's first cookie book and I was hesitant to order yet another, fearing it would contain repeats of the first book. It does not.  For serious cookie bakers, I think you need to add this one to your collection.  It does have advanced techniques in it and cookie bakers can always use more ideas for new cookies. I had fun with this during the holidays!", "images": [], "asin": "152476339X", "parent_asin": "152476339X", "user_id": "AFR4ZEY5UIUS5AZT42ZKJV7HIJXQ", "timestamp": 1578506114317, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Great Book", "text": "A  great book--- well researched,  excellent history and sociology, combined with a novelist's skillful characterizations of real people that the reader comes to care about.", "images": [], "asin": "B0062OCN4E", "parent_asin": "B0062OCN4E", "user_id": "AHGUCJN5QDEVRKOGBQPYHN5VBNKQ", "timestamp": 1478700840000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Good book", "text": "My daughter's favorite book, should have bought two, as this one up will be worn out. The pictures seem like they r of outdated items, but it gets the words across...", "images": [], "asin": "0312510780", "parent_asin": "0312510780", "user_id": "AH2EGJIRRAHOGUQJYXKAI25VZZHA", "timestamp": 1484346307000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A must have for Braves fans", "text": "This book is a must for any Braves fan. Photographers and WWII enthusiasts may want to check it out as well. I was fortunate enough to interview Walter Victor (the subject of this book) recently for a newspaper article I was writing and he is without a doubt the kindest man you'll ever meet. He went through the book with me and described the significance of many of the pictures, some of which are included in exhibitions at the Baseball Hall of Fame.<br />This book doesn't just chronicle Victor's experience as the official photographer for the Atlanta Braves baseball team though, there are also early photos that Walter took while fighting in Europe during WWII.<br />In closing, I further want to stress that this is an important book to own if you are a fan of America's baseball team, the Atlanta Braves, or a fan of America in general, Victor one of the last of a dwindling breed of Americans who possess true grit, guts and spirit.", "images": [], "asin": "1934144126", "parent_asin": "1934144126", "user_id": "AFI6IQSCTGE7AFI3CQPBDTSAPV7A", "timestamp": 1191481005000, "helpful_vote": 5, "verified_purchase": false}
{"rating": 5.0, "title": "Fantastic feel-good read! ❤️", "text": "This book was a fantastic feel-good read.<br />I went into it dreading getting lost in a combined storyline of the three siblings, but found the chapters flowed very smoothly between the characters and in no time I was hooked.<br /><br />Beautiful character buildup and a great premise.<br />And…..I want to be Nora when I grow up ❤️<br /><br />Highly recommended!!", "images": [], "asin": "1542034981", "parent_asin": "1542034981", "user_id": "AG26SM25UDSSDZEJUGYOVGO2JDHQ", "timestamp": 1646672406060, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Good read", "images": [], "asin": "B000FC0UYE", "parent_asin": "B000FC0UYE", "user_id": "AEWPT5AMMTFOIWXOKSLSUNCOZTVA", "timestamp": 1473101044000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Faith, Love, Forgiveness, Awareness", "text": "Wow!! What a great read. &#34;Her Brother's Keeper&#34; is the perfect mix of faith, love, and forgiveness while bringing awareness to depression, suicide, and mental health as a whole. The only aspect I disliked was the the book ended! I am already eager to read what Beth produces next!", "images": [], "asin": "140168596X", "parent_asin": "140168596X", "user_id": "AGW7EQ5N2X2HRRUHBYY4XKCXE7LQ", "timestamp": 1436290452000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Attention keeping suspensful mystery book infused with passion!", "text": "I enjoyed the Di Luca family and it's suspenseful drama set in fictitious Bella Terra which I suspect is the Napa Valley. I read this book in two days because it was addicting and I wanted to see how Eli and Chloe's relationship would pan out. These two had some hot chemistry between them and that helped the overall story. Christina Dodd never disappoints, she's an excellent writer, and her plots are always interesting. I'm looking forward to reading part three of this series.", "images": [], "asin": "0451413105", "parent_asin": "0451413105", "user_id": "AHBZD3IP6HHWEPMPFV3AW3IAQMBQ", "timestamp": 1475102819000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "EVERYONE needs this cookbook!", "text": "There is a little bit of EVERYTHING in this cookbook from everyday cooking, to special dinner recipes, to bread, to cheese, to gardening to keeping chickens and goats.  It is like the Mary Poppins bag!  You keep looking at it and wondering how in the world Jill packed that much information into one book---and yet there it is---along with ALL the recipes that you say I WISH---like \"I WISH someone could tell me how to make biscuits light and fluffy.'\" \"I WISH I had a grandma to show me how to make good homemade bread.\"  If you don't homestead, you will love this book for answering all your cooking questions.  If you DO homestead you will love this book for a TON of practical wisdom. If you don't cook, you will still love this book for its stories.  It is a beautiful cookbook filled with beautiful pictures and I can't stop looking at it!", "images": [], "asin": "1250190193", "parent_asin": "1250190193", "user_id": "AFI7KXQ57QBGQEZDR2SADWHEMQYQ", "timestamp": 1554900535522, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Worth the read", "text": "I bought the book on a whim and It was really good.  The book is worth the couple of dollars.", "images": [], "asin": "0615861547", "parent_asin": "0615861547", "user_id": "AGY6UU3LJQZRU6GRX5YJAIVJ3EJQ", "timestamp": 1382611474000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "I am using this to study for Step 1 along ...", "text": "I am using this to study for Step 1 along with First Aid (basically UFAP + SketchyMedical), it has been very helpful. A lot of my classmates swear by it.", "images": [], "asin": "0323396798", "parent_asin": "0323396798", "user_id": "AEUB7WKS6YC6KL4PW23CK55ECAMQ", "timestamp": 1513138879014, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Very NIce!", "text": "Nephew loved this!! Went head over heels when he opened it!", "images": [], "asin": "1484710800", "parent_asin": "1484710800", "user_id": "AEZXPOXHKLDYLB25PH2YFEA4YDBA", "timestamp": 1516045873526, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "A Powerful, Candid, Fast-Paced Thriller. A Must Read.", "text": "Wow-wow-wow. Angeline Boulley's Firekeeper's Daughter is a fantastic debut.<br /><br />But if you only talk about it as a YA thriller, you’re missing half the book. That’s just the plot. Yes,  Daunis is an 18-year old biracial Anishinaabe woman gets who pulled into an FBI investigation into the drug trade in her community and falls for the new guy on her brother’s hockey team. She’s a solid hockey player in her own right and a science nerd.<br /><br />But within that story, Angeline Boulley's debut paints a vivid picture of what it is to be a biracial Native American woman. With Daunis, we get a clear sense of how her Anishinaabe culture, traditions, and community ground her daily life; how she balances and code switches between her white and Nish families; and how she's torn between heading to college, but knowing she has a responsibility to her family and community. As a biracial person, it’s incredibly relatable.<br /><br />A fast-paced thriller and a thoughtful coming of age story, Firekeeper's Daughter is a love letter to Anishinaabe traditions and the power of community. But in it, Boulley also lays bare the long-term impacts of colonization; racism and bigotry; politics within indigenous communities; the way the federal government’s actions have contributed to corruption and the meth epidemic, and relegated indigenous communities, especially their women, to second, even third-class citizen status.<br /><br />FIrekeeper's Daughter is powerful and candid with rich characters and a compelling case to unravel. I can't wait to see Daunis brought to life on Netflix.<br /><br />It’s YA, but it’s definitely for older teens.<br /><br />CW: Sexual assault, gun violence, murder, grief, drug trafficking<br /><br />I received an advance reader copy from the publisher and purchased my own from an indie bookstore.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81fXjrnHV9L._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81fXjrnHV9L._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81fXjrnHV9L._SL256_.jpg"}], "asin": "1250766567", "parent_asin": "1250766567", "user_id": "AFOZBDCMNQY5EEYD5MWEALODC2OA", "timestamp": 1615908413702, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "It’s amazing", "text": "I love this book it every different from the little mermaid we know but still I love it", "images": [], "asin": "0615963943", "parent_asin": "0615963943", "user_id": "AGY6FSW5CHE2JH77N2UUBRLR4M5Q", "timestamp": 1534172215128, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Perfect.", "images": [], "asin": "2747028844", "parent_asin": "2747028844", "user_id": "AGIAWS7K6DRAKHRYJC43ES7HXPVA", "timestamp": 1427302175000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Fun to build models in the book", "text": "This book was fun. Not only did it show how to make amazing LEGO cars, it also showed me what transmissions and differential gears are. It showed me how I could use pieces I haven’t used before.", "images": [], "asin": "1593272782", "parent_asin": "1593272782", "user_id": "AHOK7LF24XH6REGIJ5EVRONZGVDQ", "timestamp": 1591426144758, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Gruesome", "text": "This book is very interesting, but be forewarned: it’s also frightening & gruesome. It makes a person aware that you can’t trust anyone, & you need to be aware of your surroundings at all times!", "images": [], "asin": "B07L2GMT7J", "parent_asin": "B07L2GMT7J", "user_id": "AHF6WUPQFVX3ZSWJZAP7OMGTENRA", "timestamp": 1669129516748, "helpful_vote": 1, "verified_purchase": true}
{"rating": 2.0, "title": "Disappointing and Frustrating", "text": "Navy SEAL, Scott Leighton, first met Naval Doctor, Alexis Rogets, two years ago and hasn't been able to get her out of his mind since. They occasionally cross paths, but she always avoids him. Determined, Scott sets out to make Alexis his, once and for all.<br /><br />I really wanted to like this book. I enjoyed the first book in the Megalodon Team series and hoped this one would be as good if not better. Unfortunately, that was not the case for me. I found Alexis to be frustrating, childish and annoying. The one bright spot in the book was Scott. He was so loving, passionate, protective and all around great. With all of those wonderful attributes, Alexis just refused to believe that Scott loved her, wanted to be with her AND was only interested in her. It was okay for her to hear bits and pieces of conversations and jump to conclusions, but the one moment he did, it was a catastrophic event with her storming away and leaving him to berate himself.<br /><br />So often throughout this book, I hoped Scott would just stop pursuing Alexis and find a woman who wasn't so fickle and flighty; one who could actually return his feelings without a bunch of games and back and forth struggle. I understood that their jobs within the Navy and their rankings were an issue, but Alexis took it to the extreme. I wanted to scream when she would continue to address Scott as 'Commander' even though he practically begged her to call him by his first name. I took that as a way for her to not only put up a wall, but also as an unnecessary show of power over him to let him know that she wasn't going to succumb to his affections.<br /><br />I will try to read the next book in the series. Hopefully it will be better, but I already sense a pattern with these books - SEAL falls madly in love with woman, woman rebuffs his advances, man refuses to stop, woman gives in and develops feelings, woman hears tail end of a conversation and thinks man is in love with another woman, and man has to regain her trust and love. We'll see.", "images": [], "asin": "0557041996", "parent_asin": "0557041996", "user_id": "AGC3DXWZ5EF3HC6LCMEBUW7GNVJA", "timestamp": 1331428205000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "Great reading if nothing else", "text": "I enjoy good writing.  I enjoy perfumes.  This books meets both needs.  While I do not always agree with the reviews, they are full of wit and grace, and are thus eminently enjoyable.  I have had to scramble for the dictionary a couple of times, but that was a challenge I rather enjoyed, not having had experienced it in a while.  I read it straight through.", "images": [], "asin": "0143115014", "parent_asin": "0143115014", "user_id": "AHIZOOWJFGZQJL6Z3O5ITFZQMZPA", "timestamp": 1382978156000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great Item!!", "text": "Great quality!!", "images": [], "asin": "B07TJ8W4FV", "parent_asin": "B07TJ8W4FV", "user_id": "AE56T6Y6SW3GDYQVHAG2D6P6RKLA", "timestamp": 1566333790112, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "A Fascinating Look behind the Scenes of Hawaii Real Estate", "text": "To me, as a part-time real estate investor living in Hawaii, this was a very interesting read.  In fact, to me it was a 4-star, but even for general public, the topics, presentation, and life experiences described are worth at least 3-stars.  Stephany describes her entry into the male-dominated business world and the problems she encountered in proving her worth with each new step up the ladder and ultimately earning the respect of many prominent community leaders, not just limited to those in her own profession.<br /><br />If one is familiar with Hawaii, her story is doubly interesting as she recounts her experiences with well known real estate moguls, and other business and community leaders.  It is an easy read, entertaining, and provides fascinating insight into the world of real estate here in Hawaii over the past several decades.", "images": [], "asin": "1475167431", "parent_asin": "1475167431", "user_id": "AHIWMYCOCYV65AJVF6WHPQHD23VQ", "timestamp": 1410386089000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "He was a wonderful man and will be greatly missed by the Montana ...", "text": "I met Mr. Steele. He was a wonderful man and will be greatly missed by the Montana community!", "images": [], "asin": "B005KF23GE", "parent_asin": "B005KF23GE", "user_id": "AGKWU473IZNZRXC3WQN4IEE6RUTQ", "timestamp": 1483117070000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 2.0, "title": "Would be good story - if not so poorly written.", "text": "I bought this book in 2014, it was in my 'to read' pile, I just got around to reading it now.  The base of the story is interesting but it is a very poorly written book.  It's difficult to stay in tune with the story when you constantly have to re-read as if doing a double take &#34;is this really written like this?&#34;.  Very chopping language and I'm not referring to slang or regional accents.", "images": [], "asin": "1611097975", "parent_asin": "1611097975", "user_id": "AERLYIQBJH23BMV64UT7KE6PXOCQ", "timestamp": 1479227693000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "Must Reading For Gun Owners!", "text": "The banditry after Hurricane Katrina is well known as is the incompetance of most of the local officials. This book details several first person accounts of illegal gun confiscations from ordinary citizens who were trying to protect themselves from the thugs. I would encourage any lawful gun owner to read this book.", "images": [], "asin": "0970981333", "parent_asin": "0970981333", "user_id": "AEPHAXNAHNLHIJ7JTB6XFUALXS3Q", "timestamp": 1204432448000, "helpful_vote": 7, "verified_purchase": true}
{"rating": 5.0, "title": "Painful AND helpful...", "text": "Heartrending and hit painfully close to home, but was SO helpful to get a completely honest look at what the errant spouse was thinking that led to their actions.....", "images": [], "asin": "1400074452", "parent_asin": "1400074452", "user_id": "AEG4CLYVF4IG52TRY7C2IURA7WRQ", "timestamp": 1439308760000, "helpful_vote": 4, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Great book for math teachers!", "images": [], "asin": "0470894520", "parent_asin": "0470894520", "user_id": "AFHBFJU53UPLYOSIX3B4LFBQXRYQ", "timestamp": 1527010935123, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Spying, Surfing, Shagging", "text": "No doubt there are a lot of things they don't tell you when you sign on for a hitch at The Agency.<br /><br />Gus discovers when he is detailed to the embassy in Indonesia that the other station hands are only interested in golf and diplomatic parties. Fortunately our hero has packed his surf boards, and arrives just when the country is being opened up as a surfing paradise. Along the way he also finds exotic women and interesting bars, forms an entourage of locals and international expatriates, and even commits a little espionage.<br /><br />The book is kind of an inverse of Graham Greene's \"Our Man in Havana\"; instead of making stuff up for his handlers, Gus tries to avoid telling his boss about the contact he has made with an Iraqi diplomat on the cusp of the first Gulf War. While chuckling at Gus's bureaucratic entanglements with his superiors, the reader gets a travelogue of Indonesian beaches and colorful details of Jakarta nightlife.", "images": [], "asin": "1930074093", "parent_asin": "1930074093", "user_id": "AFD7BMCQO2GCX43PJFG2I2N2PBDA", "timestamp": 1174078168000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Amazing", "text": "My daughter LOVES this!!", "images": [], "asin": "1440560870", "parent_asin": "1440560870", "user_id": "AFGZGGTMX5RBJNWZOM7RIDQ7GGHQ", "timestamp": 1632363207130, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Very easy to follow and very tasty", "text": "So happy with this cookbook.  There are lots of really yummy dishes.  I have made 5 so far, and each has been a success.  I can make most of these dishes quickly, which has been fantastic for those weekday meals.  I have also found that there are plenty of options for more special occasions.  The other element I like about these recipes is that I am really satiated and more than satisfied after a meal, they do not leave me feeling in anyway as if I have had a &#34;heart healthy&#34; meal and pinning for a splurge day.", "images": [], "asin": "1937856755", "parent_asin": "1937856755", "user_id": "AEUTLH5HUVN3Y25XEGECLUNKZBLA", "timestamp": 1370438984000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 2.0, "title": "Not good!!", "text": "Didn't like it, could not get into it. I didn't even finish it. I usually like this kind of book, but not this one. I would not recommend this book to anyone.", "images": [], "asin": "B006MLBIES", "parent_asin": "B006MLBIES", "user_id": "AEZSSK6LVSCTAIWK3ESS7TR2J4XQ", "timestamp": 1393033673000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Awesome book", "text": "One of the best books I have ever read. Such wonderful pointers on raising children. Wish I knew those thjings, when my kids were small. What a wise wonderful mother Marie had. The Osmond kids, were very blessed. I would highly recommend this book to everybody who has children to raise.", "images": [], "asin": "0451240316", "parent_asin": "0451240316", "user_id": "AHZUMJEFALA757NZ3Q7SQZYVRQGQ", "timestamp": 1373218156000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "good, but disappointing", "text": "Agree with a couple of the other posters.  This is a great idea/theme, and the pop-ups are, as usual, very intricate, but the lack of color is very disappointing.  This doesn't compare to his other books.", "images": [], "asin": "0689847440", "parent_asin": "0689847440", "user_id": "AHWLSULQ4HNZPLHWH7V5JDQUVEUA", "timestamp": 1100421169000, "helpful_vote": 15, "verified_purchase": false}
{"rating": 4.0, "title": "Sea Change", "text": "One of my favorite characters.. Jesse Stone", "images": [], "asin": "B000PDYW0Q", "parent_asin": "B000PDYW0Q", "user_id": "AFUQGX3A63UZQHEZN4EUCLRDJU5Q", "timestamp": 1445624635000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Steel Structures Design by Alan Williams", "text": "[[ASIN:0071638377 Steel Structures Design: ASD/LRFD]]<br /><br /> I found this book to be a complele guide to the design of steel structures .It also  introduces the theoretical background and fundamental basis of steel design and covers the detailed design of members and their connections. This in-depth resource provides clear interpretations of the American Institute of Steel Construction (AISC).The book clearly is an excelent guide to Specification for Structural Steel Buildings Minimum Design Loads for Buildings and Other Structures . The code requirements are illustrated with about 200  design examples and step-by-step solutions.  Coverage includes:Steel buildings and design criteria,Design loads,Behavior of steel structures under design loads,Design of steel structures under design loads,steel beams in flexure, steel beams for shear and torsion, compression members,Stability of frames,Design by inelastic analysis, of tension members, of bolted and welded connections,Plate girders and Composite construction.", "images": [], "asin": "0071638377", "parent_asin": "0071638377", "user_id": "AGK43CBH6W32UXJCQPDCXYUAHJAA", "timestamp": 1317920759000, "helpful_vote": 3, "verified_purchase": false}
{"rating": 5.0, "title": "Summary of a Great Actress History", "text": "I really enjoyed this book as Beverly's childhood home in Hollywood was close to where I grew up. Some of the actors and places she referred to were familiar to me. I thought her writing style was excellent and she showed how she loved passionately her fellow actors and friends. Also,I loved all of the pictures of her with famose actors,especially Jack Benny. Yes, I would definitely recommend this book to everyone I know!", "images": [], "asin": "1593934327", "parent_asin": "1593934327", "user_id": "AHSSOFKX5FOA6QAISZOT435E26EQ", "timestamp": 1392406157000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "A perfect source for understanding social development", "text": "I've read \"about\" spiral dynamics for years and read other works with similar models, but this is by far the best source I've seen yet. I find it useful not only in helping me with the teens that I teach, but also at work in understanding the various mindsets that I encounter - especially in this day of near constant change in the workplace. In the classroom, it helped me to think of types of experiential learning exercises for the teens to help them learn how to deal with their emotions, drives, and impulses. A mix of competative \"Red\" and \"Orange\" activities to get the idea that competition has a destructive side, followed by more \"Green\" cooperative activities to show how it solves so many problems. With so many of the teens now concerned about the environment and war, activities that highlight the Orange/GREEN transition has been key to their classroom experience. It has also helped at work in understanding why certain types of project management schemes (such as the popular SCRUM method) failed to work in our Blue/ORANGE company environment.", "images": [], "asin": "1405133562", "parent_asin": "1405133562", "user_id": "AFHHDB6JCDLPTAB3UYJTEJRJJYZA", "timestamp": 1350414286000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "All 60 Sherlock Holmes stories by Arthur Conan Doyle in just 2 volumes? Can it be true?", "text": "Let me guess, you want to get into Arthur Conan Doyle's Sherlock Holmes works - but you do not know where to start?<br /><br />You recognize \"The Hound of the Baskervilles\" the most but realize it was written after a number of Holmes stories.... You do not want to start at the beginning because there are other more well-known Holmes stories you would like to get acquainted with first.... You have heard about the large number of Sherlock Holmes short stories and do not know which one to start with....<br /><br />Elementary, my dear reader - there is a simple solution to your dilemma: The Complete Sherlock Holmes: All 4 Novels and 56 Short Stories.<br /><br />You honestly cannot find a better deal than this: all 4 novels and 56 short stories featuring Arthur Conan Doyle's Sherlock Holmes in 2 chronological volumes for around $10.00. It is unbelievable - astounding, even!<br /><br />Arthur Conan Doyle is one of my favorite authors - and his Sherlock Holmes character (although Doyle himself would bore of the character and long for an end to writing about him) is one of my personal favorite characters of literature. Doyle's stories are suspenseful, funny, all-out entertaining and, of course, phenomenally written - the character of Sherlock Holmes is one of the most complex and fun to follow protagonists in the history of known literature.<br /><br />Unless you are a collector, there is no reason to try to assemble the works of Arthur Conan Doyle individually, piece by piece, when The Complete Sherlock Holmes offers you every story in two volumes for such a low price.", "images": [], "asin": "0553328255", "parent_asin": "0553328255", "user_id": "AHTNU5T43J4HBXCWGQ6KOJRHG44A", "timestamp": 1322236561000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "Great Book! 6th Sense+The Skulls+The Tale of the Body Thief!", "text": "Will Clarke is such a great author, he reminds me of Anne Rice because you are sucked in and have no idea what is going on around you while you read. This book is so interesting because it is told from the viewpoint of a ghost, but instead of the typical nice naive person who is randomly murdered ghost (Lovely Bones, Dead like me) this is your stereotypical fraternity boy. The frat boy perspective gives it a fresh viewpoint and makes it really relatable because this guy is so normal and not perfect and not all harmonious & pious after death. Like Lord Vishnu, you have no idea where this book is going to go and you can't put the book down. I also liked learning about the inner workings of fraternity rituals which I've always wondered about, hence The Skulls reference above.  You can't go wrong with a Will Clarke book and here you have ghost stories, plus the college experience, plus great flushed out characters.  If you love interesting books that will make you think, this is for you!", "images": [], "asin": "0972658815", "parent_asin": "0972658815", "user_id": "AFJ4EM2JTDOJXDKMZMM65CZRJJGQ", "timestamp": 1063244773000, "helpful_vote": 5, "verified_purchase": false}
{"rating": 5.0, "title": "Love this series!", "text": "Very enjoyable! Perfect beach reads.", "images": [], "asin": "0593101669", "parent_asin": "0593101669", "user_id": "AE3ADURF6DPT5SOE4MIUQGHX3E5Q", "timestamp": 1624580927261, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Interesting and Informative", "text": "This book is so wonderful!  The first section tells you about the poses themselves with pictures to go along. It also gives you the options for the modified positions, which is helpful.  After that, you will find images of those same positions, however these images show the musculoskeletal system. It shows you exactly which muscles you are supposed to be working while completing these poses. That part was awesome, there are poses that I can do very well, but that's sometimes because I don't know what I'm actually supposed to focus on, for example, I may be using back strength instead of core strength.  Once I went over this section of the book it changed my practice completely.  I would recommend this completely!", "images": [], "asin": "1554077664", "parent_asin": "1554077664", "user_id": "AH3HMCLDPYPMBFRHUSOGIOID6H3Q", "timestamp": 1429159125000, "helpful_vote": 17, "verified_purchase": true}
{"rating": 2.0, "title": "Meh!", "text": "I have always been a fan of Ms Burke but this is probably my last read. I thought the story itself was weak and the characters unlikeable. As others have noted, I too am weary of the woke topics being touched upon regularly through the book, more even than in her last book. It isn’t that I disagree at all, but I come here to escape and immerse myself in a story, I do not need to be nagged to be a decent person.  I read the Clinton/Penney book prior to this and found a similar thing. It’s become tedious that the authors seem to think we readers don’t stay up to date on current topics so they need to push their agenda on us ignorant people.", "images": [], "asin": "B08728FV3Y", "parent_asin": "B08728FV3Y", "user_id": "AF2RTWE4R4AWBOB3BUR7EIYF45CA", "timestamp": 1643129996086, "helpful_vote": 4, "verified_purchase": false}
{"rating": 5.0, "title": "Funniest book ever!", "text": "We love this book!  Found it in Target and couldn't stop laughing!  Totally getting this for my dad for Christmas! He used to be a taxidermist.  The bear.... hysterical... totally our favorite!!!!", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/51x9lTdETaL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/51x9lTdETaL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/51x9lTdETaL._SL256_.jpg"}], "asin": "1607748207", "parent_asin": "1607748207", "user_id": "AGI3KPZES65V7MZVQEUGVMLWCTYQ", "timestamp": 1574879800448, "helpful_vote": 4, "verified_purchase": false}
{"rating": 5.0, "title": "Excellent mind challenging book", "text": "I really liked this book, it challenges many of the physics theories that we learned but never really understood how or why. By challenging those theories the writer makes us re-think certain theories and not take them at face value. The book is easy to read yet it does address physics from a mathematical perspective.", "images": [], "asin": "1419692704", "parent_asin": "1419692704", "user_id": "AHIHW3G73WFPSFZTJW7DF7XVYE2Q", "timestamp": 1349158948000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "A Feast for the Eyes", "text": "I haven't yet read the text, but I would very much like to comment on the reproductions of Bruegel paintings and drawings in the book: they are as numerous as they are excellent, page after page of complete paintings as well as close-up details. Very-very impressive. I would also highly recommend Larry Silver's \"Hieronymus Bosch\" published by Abbeville. Both are outstanding art books.", "images": [], "asin": "0789211041", "parent_asin": "0789211041", "user_id": "AFBO4ZMYDCSMMHIVBGAN3TMC7B2A", "timestamp": 1325789362000, "helpful_vote": 13, "verified_purchase": true}
{"rating": 5.0, "title": "Book for one year olds", "text": "Cute book with colorful pictures", "images": [], "asin": "B09FSCFZBV", "parent_asin": "B09FSCFZBV", "user_id": "AEEKBSTQMI47CSHJZSYZUQDZDY3Q", "timestamp": 1640652148734, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "The Title Says It All...", "text": "Ok, well, not really.  Still though, it's a graphic novel about a time-hopping art thief and the girl he falls in love with.  Plus this hardcover version is signed by the author, Jeff Smith.  (He did the graphic novel &#34;Bone&#34; also.)  What more could you ask for.", "images": [], "asin": "1888963212", "parent_asin": "1888963212", "user_id": "AFNQMUS2D7XM5WCUIN2RHP2QUALA", "timestamp": 1373767621000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Most enjoyable", "text": "I liked the home cooking recipes  Had all the ingredients on hand.  Super taste to all I have cooked from the book", "images": [], "asin": "0307465233", "parent_asin": "0307465233", "user_id": "AG5DDHKHOMXJIBNXZWW2TYQFNZRA", "timestamp": 1651774165187, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Good British mystery!", "text": "In general I like British mysteries, this one did not disappoint.", "images": [], "asin": "B0097D776Q", "parent_asin": "B0097D776Q", "user_id": "AG7VAYR5L75IVJICWIA62MDQNZXQ", "timestamp": 1433798312000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A Must Read", "text": "This book is truly delightful. I loved every minute of it. It is funny, engaging and delightful. As a southerner, I really enjoyed reading about his childhood in Oklahoma.<br /><br />Not only is Sam a truly talented vocalist, but he's an amazing author.", "images": [], "asin": "1476733414", "parent_asin": "1476733414", "user_id": "AFG5L52W3GESZSBUWRP2AKL5O3NA", "timestamp": 1395534982000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "Five Stars", "text": "Donated to our public library for the children  L Raggio", "images": [], "asin": "0062252070", "parent_asin": "0062252070", "user_id": "AFOQC3ZTCGJFWGEVSLWO2H7L23AQ", "timestamp": 1465826800000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Chord exercises for accordion", "text": "I was surprised at how much I enjoy working on these chord progression exercises.  I notice carry-over to the songs I'm learning.", "images": [], "asin": "0786657324", "parent_asin": "0786657324", "user_id": "AFBM3FSS6GUPMGHVAQ2WHXIRTAIA", "timestamp": 1457449139000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 1.0, "title": "Painfully dull", "text": "For the first time ever, I’m quitting a book before the end.  Might be the worst book I’ve ever read.  I tried to stay committed out of pure stubbornness because I hate not finishing things I start, but this was painfully boring.  I made it to the final 100 pages and decided life is too short to waste anymore time on a book this dull.", "images": [], "asin": "0316066346", "parent_asin": "0316066346", "user_id": "AFAEMK6KMJ6TOXKPCXRBIXSNNMYQ", "timestamp": 1680553627244, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Tells you like it is!", "text": "Excellent book if you follow Ferrari👍❤️🏎🏆🏁🇮🇹🇺🇸", "images": [], "asin": "B000MDKRU8", "parent_asin": "B000MDKRU8", "user_id": "AHOKJFTV6YGIBN3UAKQV5VRRXPUA", "timestamp": 1554523847696, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "The title says it all", "text": "Terrific book from the former exec CD of Wunderman London. Whether you want to be more creative, write better briefs or learn how to recognise and make ideas happen, Harrison will help you do it.", "images": [], "asin": "0273725181", "parent_asin": "0273725181", "user_id": "AHPO6CMOFJPRWFNL26L4YLD2K7JA", "timestamp": 1318223512000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "This book was awesome", "text": "Thank you for writing these books! I don't know what I'll want to read next once I'm finished with all the books. - from a 9 year old boy who eats cookies every day and reads Diary of a Sixth Grade Ninja books", "images": [], "asin": "B00AKWSSFC", "parent_asin": "B00AKWSSFC", "user_id": "AGEAMB76AXLD7BDWKRVZYI3YBWNQ", "timestamp": 1396323421000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 1.0, "title": "8.5 x 11", "text": "Great work from the author, but this product was sent to me on 8.5 by 11 paper printed in reader's digest font.  This is totally impractical and not at all what was expected - i.e. a normal paperback size book like every other paperback I've ever purchased online.", "images": [], "asin": "0470580453", "parent_asin": "0470580453", "user_id": "AEX35PVPYM7N7B2MZAOZHG37HHEQ", "timestamp": 1575646474379, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Excellent God-centered experience!", "text": "My church used this a few years ago. I would love to do it agsin. It was a time for thinking, praying, worshipping - very well thought out product that any Christ- centered church would benefit from by giving their members this experience. I really enjoyed the freedom of this Labrynth, to go from spot to spot, thinking about the questions or statements offered. After going through this labryinth and spending time in prayer, I enjoyed the experience so much, I created a small room in my house just for prayer and time with God, and called it Sanctuary.", "images": [], "asin": "0764413031", "parent_asin": "0764413031", "user_id": "AERZENWGI3F2ONN4AZRBE6SYCRUQ", "timestamp": 1378269871000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "GREAT BIBLE!!!!!", "text": "Great Bible!! Love it, shipped quickly, great seller!! Love this bible. Only problem, the picture shows it very skinny, but it is actually not. I posted a picture of the ACTUAL Bible. Check it out!! Comment if you have any questions!!", "images": [], "asin": "0310721075", "parent_asin": "0310721075", "user_id": "AFK42RKZYM3NBNSBPTJEQNOFUKUA", "timestamp": 1295132754000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Great read. Neil Gaiman is one of my favorite authors of all time.", "images": [], "asin": "039360909X", "parent_asin": "039360909X", "user_id": "AFJ7WVWGYO4Q4KN7BNGDQRSDLRRQ", "timestamp": 1497443576508, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "dquestlx", "text": "It came in great shape just like what it said. It was mail fast,thank you for you done.Just got the game for $10.00 new. I have not play it yet. I been in VA for teatment just old vietum vet. I have lot of flash back and back injury. I love rpg it take my mine away to other place.", "images": [], "asin": "0744012384", "parent_asin": "0744012384", "user_id": "AFR4YG25WWHVAN4QGISTCB67CMVQ", "timestamp": 1287333012000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "Entertaining quick read", "text": "Nice superhero/sci-fi pulp story. Easy read with some action and twists.", "images": [], "asin": "197923261X", "parent_asin": "197923261X", "user_id": "AFJTQDTQBWRGIRHGIPVLZGDJXMKA", "timestamp": 1545793166779, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Heroic", "text": "I know that it would not be in Joni's intent to gain personal glory and accolades from the writing of this book. But I cannot help but be moved and challenged by the faith that she professes in a loving God that allows her to suffer.  I get it. I feel it...and boy am I rebuked to realize that her perspective on God is 100x greater than mine.<br /><br />I am grateful to God that Joni had the strength finish this book. I'm grateful to God that he would use the broken to teach the proud.  There is a reality to her faith that is refreshing and humbling.  At the end of the day she is just another forgiven person like the rest of us, but her lifetime of God experiences definitely sets her apart as someone I should be listening to and learning from.<br /><br />Her struggling and wrestling with her suffering is heroic because I know her testimony may potentially save lives by creating hope and forgiveness for those who are in pain (physical, emotional, etc.).", "images": [], "asin": "B004IEA2O8", "parent_asin": "B004IEA2O8", "user_id": "AGLUI7UGH7NQTJ24HC3AUSEHEE7Q", "timestamp": 1342820052000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "Beautiful Story", "text": "I had read another book by Weiland, and was disappointed by it. I was not really interested in paying for anything else by her. However, after receiving a free review copy of 'The Memory Lights', I think my faith in her is restored. I have a feeling that I might like some of her other books.<br /><br />Memory Lights is written with vibrancy and skill. The characters are awesome, and I felt like I was there, and everything happening was real. Though it's such a short story, I found it easy to keep up with each revelation, and the end result was touching and beautiful.", "images": [], "asin": "B006BDRRR4", "parent_asin": "B006BDRRR4", "user_id": "AGVOVX7IDKOGPFZMM47YGF5IXAEQ", "timestamp": 1386486575000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 4.0, "title": "PC run amuck", "text": "This was a small incident that had world wide ramifications and is ignored for political correctness purposes by nearly everyone.  Read it and get to the core issues of who we are.", "images": [], "asin": "0960913203", "parent_asin": "0960913203", "user_id": "AHQ54Z7JHECL7CIZWJ7ZBVM4PPAQ", "timestamp": 1374158318000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "An interesting story of the war against the Tripoli pirates ...", "text": "An interesting story of the war against the Tripoli pirates.  So the Marines never made it to Tripoli, only Derne.", "images": [], "asin": "1591848067", "parent_asin": "1591848067", "user_id": "AG3HBWWC4LKFKH5O6P6N3KR5Z6SA", "timestamp": 1464822922000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A Photographic Odyssey of Fine Mexican Jewelry", "text": "The Color Photographs depicted of the jewelry on every page was in my opinion a wonderful excursion of visual art. I would easily recommend this book as a fine addition to any reference collection.", "images": [], "asin": "0764330810", "parent_asin": "0764330810", "user_id": "AFEK5CM6QNXGC64T466KAG2EPD2Q", "timestamp": 1229269598000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "why not?", "text": "in my copy of \"nixon agonistes\"(2002 paperback edition), gary wills does not repeat nixon's famous statement after his 1962 defeat in california: \"you won't have richard nixon to kick around anymore.\". he describes the rest of the press conference as usually reported. is this true of all editions of the book and, if so, why? any info. is appreciated.", "images": [], "asin": "0618134328", "parent_asin": "0618134328", "user_id": "AFUDRJLTGKAYAIN76I2DRASBNZ6Q", "timestamp": 1367287609000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 4.0, "title": "Excellent, though abbreviated", "text": "Excellent, though more abbreviated than earlier editions, describing how  to have a great time on Thailand's islands and beaches.  I've lived in Thailand for 16 years and have been to many of these places using this book- it's all as described.  I've written an Amazon book about moving here and living a happy daily life in a northern city [[ASIN:B07V6KZ1BM How I Moved to Thailand, Retired Early, Found Love, Built a Mansion, Live Like a King on a Pension]] But the islands of Thailand, as described so well in this book...ah...still a tropical paradise!  Still a dream!", "images": [], "asin": "B07DXG5LM5", "parent_asin": "B07DXG5LM5", "user_id": "AGYD7ATGU3J7SZRBAQY3TUP7PMWQ", "timestamp": 1563005956956, "helpful_vote": 1, "verified_purchase": false}
{"rating": 4.0, "title": "A Great Start to A New Series!", "text": "I received an ARC in exchange for an honest review.<br /><br />This first book “Under Pressure” in Lori Foster’s new Body Armor series is great start to what I hope is a fantastic new series. I’ve been waiting to see Leese redeem himself since we first met him. Our first glimpse at Leese was not a very good one back then but he has certainly redeemed himself and won me over for sure! We are introduced to Catalina in this book and she’s a feisty woman that wants to stand on her own and has every reason to not want to get close to anyone because she doesn’t want them to get hurt by people she once trusted.<br /><br />Leese and Catalina have to work together in order to bring down powerful men that have hurt a lot of innocent people. Leese is able to work with his new boss, Sahara, owner of Body Armor Security Agency to figure out how to catch the bad guys and keep Catalina safe before it’s too late. All the while, Leese and Cat slowly fall for one another and find out what it is to truly realize what it means to sacrifice and love someone else.<br /><br />I am really excited about this new series (as I am for pretty much all Lori’s books/series). I love visiting characters from previous books. Next up is Justice and I’m really looking forward to his HEA.", "images": [], "asin": "0373789939", "parent_asin": "0373789939", "user_id": "AGS6DDBOAYDALP3PPQ5RIAAEOYCA", "timestamp": 1485321772000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Can't go wrong!", "text": "A penny! You can get this book for a penny and there will be enough recipes here to keep you cooking for months! I recommend this book, as well as the \"Healthy Exchanges Lifetime Plan\", to anyone! Especially if you have kids or a reluctant spouse. They are not going to know that you are cooking healthy food, only that they love it!", "images": [], "asin": "0399140654", "parent_asin": "0399140654", "user_id": "AH4GLMN6MAA2HODL47W6J54ZLJAQ", "timestamp": 1202438663000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "Great quality!!", "text": "My daughter absolutely loves this author's book! Well worth it!!", "images": [], "asin": "133874108X", "parent_asin": "133874108X", "user_id": "AELEV5YH7XQXTRI5HDENJEQIXGNQ", "timestamp": 1691280385956, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "A fun book that is a part of a series that ...", "text": "A fun book that is a part of a series that I have not read, but &#34;The Singer from Memphis&#34; is a stand alone book. The characters are appealing, the book is full of good humour, and interesting historical facts. It is not an insult to say this would be a good beach or hammock read. I would suggest doing what I am going to do and go back and read the series from the beginning.", "images": [], "asin": "1616956682", "parent_asin": "1616956682", "user_id": "AEVRCS2PW4A5LDOHWQUY65RYO6FQ", "timestamp": 1462131224000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "EXCELLENT!", "text": "Every runner should have this in their library!", "images": [], "asin": "1623364590", "parent_asin": "1623364590", "user_id": "AFJIY24Y4TOSDRQT22QIKPYNZIWQ", "timestamp": 1431715097000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Beautiful!", "text": "This book relates so perfectly to anyone who has been in love.  Beautifully written.. I could not put it down.", "images": [], "asin": "B00EQZ711G", "parent_asin": "B00EQZ711G", "user_id": "AGWBBE6WC27JYBD3PHR466XG3AKA", "timestamp": 1387299756000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Beautiful dreams.", "text": "This is a beautiful book. It transports you and allows you to dream.", "images": [], "asin": "1687368899", "parent_asin": "1687368899", "user_id": "AE63FHX6NS3HTZ72PXEQ7WBU42YQ", "timestamp": 1576303928301, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Easy to read", "text": "I read the story in an evening! I love reading her stories!!", "images": [], "asin": "1409136612", "parent_asin": "1409136612", "user_id": "AG5SXWWK433VIXRTNXETZQOLLU3Q", "timestamp": 1434324375000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "So much fun!", "text": "A departure from the usual thriller/suspense novel that hails a women as the lead in that this is all that and also just a great entertaining ride!", "images": [], "asin": "1401312705", "parent_asin": "1401312705", "user_id": "AESMPLPYPEJ7AMG2P3R6MGLH3R2A", "timestamp": 1671162383129, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "she's one of my favorite fantasy authors", "text": "I adore Maria V Snyder; she's one of my favorite fantasy authors. I love Yelena and Valek. They've been through so many tough times and they always seem to beat the odds. I like seeing Yelena without all her powers, it evens the playing field a bit.<br /><br />I hate all the secrets, especially between Valek and the Commander. I hate that they are on the outs, but it makes for a great story.<br /><br />I love the return of so many favorite characters and the multiple perspectives. I can't wait to see how this adventure ends!", "images": [], "asin": "0778318753", "parent_asin": "0778318753", "user_id": "AGYFFG4NRQ7HY6HAEF4FF6SFOGZQ", "timestamp": 1465296510000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Science Fiction / Horror Done Right", "text": "Nobody does weird, cosmic horror like Kiernan. This one rates among my absolute favorites. Kiernan takes Lovecraftian horror in unique directions that kept me engrossed throughout.", "images": [], "asin": "B01JZ6SIVC", "parent_asin": "B01JZ6SIVC", "user_id": "AFZPPSHIIX5ZGFKJ2JH33Z4PTVCQ", "timestamp": 1522957417575, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Who wouldn't want to work in a company with a Culture of Good?", "text": "I was able to get an advance copy of this book and it's really something special. I've been working professionally for about 40 years, starting with your basic X style management structure at a large company. I've seen management ideas come and go, I've given a weekly portion of my income to the big company philanthropy in the sky, and I've consulted in many companies and industries. What I have not seen throughout all of that is anything like the culture these two guys have built. I was so taken by the ideas and the stories in this book that I had to check it out myself. I talked with several employees, young people working retail, to see if it could be real. To a person, they love working at TCC. It's literally changed their lives to the point that they care more about their fellow employees. They enjoy their customers and they want to help their communities. I can see how this would improve business results as well, but best of all, they're able to do great things to improve the world we all live in. Read this book and if you own or lead a company, build your own culture of good!", "images": [], "asin": "0998009407", "parent_asin": "0998009407", "user_id": "AENP6PF2LLRW6GOK3YL4XQMXAUBA", "timestamp": 1478818774000, "helpful_vote": 5, "verified_purchase": false}
{"rating": 3.0, "title": "Three Stars", "text": "I works not what I was expecting", "images": [], "asin": "1622701275", "parent_asin": "1622701275", "user_id": "AHIF2PP4XIYTBG3IPYEFAZQBORBA", "timestamp": 1495573177000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "6 Words - Why Did I Take So Long ?", "text": "I decided that this year I was going to go through my Kindle e-books and read ones that I have had sitting on there for years. I scrolled through and came to Heartless by J. Sterling. I knew this was going to be a quick read as it's part of a three episode serial.  This book started with Elizabeth Lyons finding her boyfriend cheating on her with her roommate at the time. Of course, the guy Ben was a jerk and made it like it was Elizabeth's fault as she was ambitious and heartless, and no guy liked that.  Fast forward eight years and Elizabeth is still a hardworking female, and she has made a name for herself in the production business which for females is hard including a young one like herself. She is awarded the honor of being one of the Thirty under thirty to look out for and heads to a party where she meets Daniel Alexander. He wants her, and she doesn't want the hassle of a relationship. Can Daniel find his romance bone to woo Elizabeth as she's not like the ones he has had before and will drop her panties on the first date?  I liked the start of this serial and found myself really getting into the story and was sad when it ended but happy since I had the next two on my Kindle already to move onto.  One of the best romance serials I have ever read. Definitely worth the read.", "images": [], "asin": "1505454123", "parent_asin": "1505454123", "user_id": "AHKVAYJF4Q6KU5WOCXNBBUYG34MA", "timestamp": 1505087408335, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Great history overview", "text": "This was rich in the history of China. I learned so much.", "images": [], "asin": "B07QT8TV5L", "parent_asin": "B07QT8TV5L", "user_id": "AHIYHWEECK322HVTJJXIIOJYNS2A", "timestamp": 1576913592853, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "Well Done !!", "text": "Craig did an excellent job with this book.<br />Easy to understand.<br />Large fonts are easy to see.<br />This book has roots in the most important word in the English language - C R A F T S M A N S H I P", "images": [], "asin": "1733817204", "parent_asin": "1733817204", "user_id": "AH3SB2BSD3YHL6LEKKBFQZQW4PQA", "timestamp": 1578980946431, "helpful_vote": 0, "verified_purchase": true}
{"rating": 2.0, "title": "You May Want to Take a Pass on This One", "text": "I selected this book based on the rating (4 stars) and the price. I was disappointed as the book took me through the thoughts and relationships too many times and too slowly. I kept reading it hoping it would get better. It did not. &#34;Moving Day&#34; was a slow mover.", "images": [], "asin": "B00FN2KR3U", "parent_asin": "B00FN2KR3U", "user_id": "AG43AEEDNFMBXANPS5T7MHM7ONFA", "timestamp": 1406721139000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Twisted and fun....", "text": "I Loved Mark's newest book-  it kept me guessing until the end. Thanks so much for the fun and the chance to have my name as a character in the book. although i was originally told I would have the pleasure of being a 'bad guy' and that didn't happen- I still very much appreciated it and greatly enjoyed the book. Thank you Mark!!!", "images": [], "asin": "B01M317JTG", "parent_asin": "B01M317JTG", "user_id": "AGLZGSDECSJ3PA64LDBVW644ONKQ", "timestamp": 1499358123811, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "FIRR-Kids! Review", "text": "There is an attractive quality to pop up books, and this one hits the mark.  A succession of brightly colored animals leap off the pages, mouths flapping open and shut.  Each animal declares \"I'm going to eat you for my dinner!\" to the animal featured on the previous page.  And he does.<br /><br />Frog Vulture Gorilla Tiger Crocodile Shark<br /><br />The illustrations are large - each animal spans two pages, with similarly large fonts for the text.  The hinged mouths pop out to invite little fingers to probe inside.  The combination of a simple layout, bold colors and repeating text make this book ideal for young children.<br /><br />A note of interest: this book is reasonably priced at $6.99, with several others available by the same author.", "images": [], "asin": "0763638544", "parent_asin": "0763638544", "user_id": "AGU4OUAG2Y6QBR7M3IJBLIGU27DA", "timestamp": 1226399505000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 4.0, "title": "Great for inspectors with minimal experience", "text": "Takes an approach that develops knowledge and understanding for inspectors and engineers with minimal to medium experience. Need to give more emphasis on building construction (small and medium size buildings).", "images": [], "asin": "1889892165", "parent_asin": "1889892165", "user_id": "AHSHT7VKT4SQI5QJMSERJQVAP6GA", "timestamp": 999017412000, "helpful_vote": 3, "verified_purchase": false}
{"rating": 4.0, "title": "Interesting", "text": "Hans was leagues ahead of time and his colleagues with his research. However, this book is sorely behind the times.<br /><br />For a much more up-to-date book covering the immune system and stress read Why Zebras Don't Get Ulcers, which is far more fun to read, too.", "images": [], "asin": "0070562121", "parent_asin": "0070562121", "user_id": "AELMGQ2UI5HLLCXWD4CPY6HBV2RQ", "timestamp": 1358826923000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Love this series!", "text": "As with all of Snyder's books that I have previously read (Study and Glass series), this story transports readers into a fantasy world of magic filled with evil pitted against a brave young heroine struggling to survive and make her world a better place. Wonderful book!", "images": [], "asin": "0778314189", "parent_asin": "0778314189", "user_id": "AFURLFNHM3VXQVPVKUEQ6PBE7QFQ", "timestamp": 1400838403000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Another great book by Tess Gerritsen! I suggest you read them all!", "images": [], "asin": "034551548X", "parent_asin": "034551548X", "user_id": "AFREEJXXA6CU3FYGHIIB66DE7PFA", "timestamp": 1458405121000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A lesson learned", "text": "I purchased two for my great grandchildren.  A very good lesson of kindness and nicely illustrated.  Look forward to more stories from Kathy Smart !  You won't be disappointed.", "images": [], "asin": "0997281707", "parent_asin": "0997281707", "user_id": "AEI2DFALTJ2TKP2J47UQCCKPOJ5A", "timestamp": 1465388171000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Nice.", "images": [], "asin": "B00CYS0EFC", "parent_asin": "B00CYS0EFC", "user_id": "AETFXXT3NKGDQBUCGQO3WUG2HVVQ", "timestamp": 1423101263000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "It's just this radio show, you know?", "text": "It's the radio drama from the BBC that launched the late Douglass Adams' career.  I've been wanting this for years.  Packaging doesn't match the picture, but that's documented in the product description.  It's more compact and easier to store.  I'm happy with it.", "images": [], "asin": "0563504196", "parent_asin": "0563504196", "user_id": "AHPPOU4PMGKL4RKI66IXUO3UOFIQ", "timestamp": 1439475087000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "If you love historical fiction books, this should be your next book", "text": "I always enjoy reading historical fiction books, this is one I highly recommend. The main characters are very strong women; I was engrossed till the very last page.", "images": [], "asin": "B011G3HI9U", "parent_asin": "B011G3HI9U", "user_id": "AELGQO673DC7PD77Y4IR4JHU25ZQ", "timestamp": 1482033863000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Troublesome ghost", "text": "I loved Helena’s annoying character and how she helped and frustrated Maryse.  I was disappointed that Helena’s murder was not solved.  I hope it will be in another book.", "images": [], "asin": "B004AYDC9I", "parent_asin": "B004AYDC9I", "user_id": "AERSMCFWEW2XNMDH3FGPOJNOFO4A", "timestamp": 1552314183538, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "great book", "images": [], "asin": "0440423236", "parent_asin": "0440423236", "user_id": "AFZ2EUGKPLF5FKC2MTOHWQZ3PCLQ", "timestamp": 1461875462000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Excellent", "text": "This is an excellent book, just like the others in this series. There is just so much information provided in these books with a very nice price. I highly recommend this book for those who want to compost, do anything related to gardening or just want to learn something.", "images": [], "asin": "B005M48C7M", "parent_asin": "B005M48C7M", "user_id": "AE7IAUEXUUHN2QBD4STM3IHVS6LA", "timestamp": 1325291307000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "Five Stars", "text": "A must have!", "images": [], "asin": "0983258406", "parent_asin": "0983258406", "user_id": "AFUXEKMQSY7ODM4T5Q72OPWHIZSA", "timestamp": 1533346960785, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great book", "text": "Beautiful, thoughtful book. I loved it!", "images": [], "asin": "0670026190", "parent_asin": "0670026190", "user_id": "AFUR3KERSPTCKFBZVVXLFYH7PANQ", "timestamp": 1482608084000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Twisted!", "text": "Unexpected twists kept me guessing...a who did it who done it...well written. Looking forward to the next book by Frazier", "images": [], "asin": "B082HS7291", "parent_asin": "B082HS7291", "user_id": "AHK6V66465O33ZZZZGZYSFVHELTA", "timestamp": 1595535524220, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Very original", "text": "Really loved the originality of this story. It had me cracking up and rooting for the snake and Dick. The subtle innuendos of Dick vomiting, and other hidden meanings were too funny. Just the fact of the snake and Dick becoming friends was funny as hell. Really loved this short tale, was sad when it ended.", "images": [], "asin": "B0BCQSN8CG", "parent_asin": "B0BCQSN8CG", "user_id": "AGQF2F4EYZZIYA3K56PVOHII35SA", "timestamp": 1665971082027, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "I highly recommend this language package if your are really wanting to ...", "text": "Hello fellow Deutsch learners,<br /><br />I highly recommend this language package if your are really wanting to learn German! It’s really easy to read and easy to follow with the book and CD combined! There isn’t really much to say about it and nothing negative to say. I really enjoy and it’s very thorough!", "images": [], "asin": "0307478556", "parent_asin": "0307478556", "user_id": "AG4QBYTFGDNOQXC7SBTE7G2JCG6Q", "timestamp": 1512839917008, "helpful_vote": 7, "verified_purchase": true}
{"rating": 3.0, "title": "interesting but very flawed", "text": "Despite the fascinating interviews with vengeful and forgiving victims and with remarkable authorities, I almost dropped this halfway through, because Blumenfeld's drama-queen personality and self-indulgent writing style were getting hard to take; ultimately the book did not ring true for me. I stuck with it partly hoping to see the author (and her mother) get their come-uppance (hmmm...reader's revenge?). I felt truly sorry for her father (diminished more by her portrayal than by the shooter's action), and for her new husband, who kept a record indicating one out of four days in their new marriage was 'insufferable and intolerable.' (Her actions even made me feel sorry for Netanyahu!)<br /><br />Yet Laura plowed on -- oblivious to anyone else's needs or discomfort, deceiving and constantly manipulating people, cooly describing and then rationalizing her behavior, and scrutinizing her own tiresome emotional navel. Self-display is not the same thing as honesty or insight.<br /><br />Many reviewers are entranced by her writing -- and she has a really fine eye for telling detail, and at times turns a remarkable, poetic phrase -- but too often I found her writing felt forced, overwrought, or repetitive.<br /><br />Not really a book I can recommend.", "images": [], "asin": "0330493604", "parent_asin": "0330493604", "user_id": "AFT4BBO373DV7PU6G2L4NYWTTC6A", "timestamp": 1193054577000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "A solid review of Hill's \"Tender\" from the Bay Area ...", "text": "A solid review of Hill's \"Tender\" from the Bay Area Reporter's Jim Piechota...<br /><br />\"Hill's experiences are leavened by the bracing, slam-poetry delivery of his writing style….<br />With unfettered honesty and graphic delivery, Hill's memoir commands attention.\"<br /><br />[...]", "images": [], "asin": "0991515102", "parent_asin": "0991515102", "user_id": "AGS2M4UXVXO23QD3EYBMX6CIKQGQ", "timestamp": 1432585695000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "grand son loves it", "images": [], "asin": "1423154088", "parent_asin": "1423154088", "user_id": "AER6LFLM7J2L5Y7N4G7IGEW53OYQ", "timestamp": 1441042104000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 1.0, "title": "Good book, but", "text": "What a fantastic book !!!  The patterns are so very very nice, the author's use of color is just wonderful.  The author put a lot of work/thought into the book, a lot of small projects are included, which was a nice surprise.  But, and it's a BIG one, the ruler used in the book is not to be found on the ruler makers website.  Would have been nice to know the ruler was needed and that it was available.  Had I known the ruler was not available, I would have not bought the book.  That is the reason for the one star review.", "images": [], "asin": "0715327135", "parent_asin": "0715327135", "user_id": "AFVWVS5RYCJF6P4PC4EJZ5ZMONYQ", "timestamp": 1560299671741, "helpful_vote": 8, "verified_purchase": true}
{"rating": 2.0, "title": "cover is the coolest part", "text": "Book arrived damaged (binding broken/loose).  Honestly, not that interesting a read, but does look cool on the shelf or coffee table.", "images": [], "asin": "0062681176", "parent_asin": "0062681176", "user_id": "AHQH5BGZZPYTKJ3X4ZIO2BL2MG3A", "timestamp": 1550669853961, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Emily Post's Little Blue Book of Etiquette", "text": "I Purchased this item as a gift to my niece.  She loved it. It was in good condition and was received promply.  I am very pleased with this purchase.", "images": [], "asin": "B000FZ1LMG", "parent_asin": "B000FZ1LMG", "user_id": "AEBNV2J4S5Q5PIFZFCV4ZQEIMQSA", "timestamp": 1293899769000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Very good book. Well written. I would read more from this author", "images": [], "asin": "B01M2WGW9M", "parent_asin": "B01M2WGW9M", "user_id": "AHI66YLFTHIKKLQHMJOUTWJXROUA", "timestamp": 1504113195576, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Entertaining.", "text": "The book has a good story line.", "images": [], "asin": "B07NF7Z8VG", "parent_asin": "B07NF7Z8VG", "user_id": "AEYTTDRMPVXK6UBPHHC6WYTKMK4A", "timestamp": 1605634728540, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "So much fun and the cutest critters!", "text": "You can tell that a lot of work and thought went into this coloring book. I love how there is a mix of simple to complex patterns which makes this coloring book fit for all ages to enjoy.", "images": [], "asin": "1718801777", "parent_asin": "1718801777", "user_id": "AE2XQE7MLLC7YP7DW4ST6UE5ZM6Q", "timestamp": 1530198503144, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "love game theory... this book has a goon approach", "images": [], "asin": "0393349896", "parent_asin": "0393349896", "user_id": "AFCQWDAPYKDKEL2JPU6BNHCBHZLA", "timestamp": 1428034831000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Missing chapter", "text": "My book is completely missing chapter 5.", "images": [], "asin": "1944515682", "parent_asin": "1944515682", "user_id": "AEN4RLOWKQ4DN4PWCY42VOP2UGFA", "timestamp": 1578958233466, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "ERNIE IS A FANTASTIC WRITER", "text": "What an amazing book - you won't be able to put it down.  The author has a great way at making you look at your retirement in such a different light.<br /><br />And the best chapter - about being involved in a community - on page 151-152, he talks about the great community of Sun City Center - which is the same community we have been visiting for over 8 years and finally purchased a home in 2009.<br /><br />It's a great over 55 community.<br /><br />It has to be one of the best books I have ever read.  I have recommended it to 6 of my co-workers who are retiring. They loved it too.<br /><br />So if you are getting ready to retire or are retired, you have to get this book.", "images": [], "asin": "096941949X", "parent_asin": "096941949X", "user_id": "AFCD5FWYQM3K5QDTEQS3QETSXP2Q", "timestamp": 1296788929000, "helpful_vote": 4, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "The best book for kids", "images": [], "asin": "0307155102", "parent_asin": "0307155102", "user_id": "AEQNXA33MIFFQMHT5U4SAQ6DVSBQ", "timestamp": 1470245695000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "My granddaughter's favorite book!", "images": [], "asin": "1442459352", "parent_asin": "1442459352", "user_id": "AFEV6MGHWN24ZFLH5MWBYXNH2JSA", "timestamp": 1458864373000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "The Seventh...", "text": "What a powerful concept for a book. My daughter loved it and read it in less than a day. The Seventh Most Important thing is a book about a young boy and how he deals with the grief of loosing his father. It was engaging and heartfelt and is definitely recommended.", "images": [], "asin": "0553497286", "parent_asin": "0553497286", "user_id": "AGRA57SHKANYII4SYISVBBKNMU2Q", "timestamp": 1437397813000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Terrific cookbook", "text": "I am picky about cookbooks. Although I love reading them, a cookbook has to be not only beautiful, interesting and unique, it has to be useful for real people, real home cooks (like me) in real kitchens, feeding real families and friends. On all accounts, this beautiful book from accomplished chef and food writer Rozanne Gold is a winner.<br /><br />First things first, the book itself--and this is so important for a cookbook--is easy to read and use. The binding is high quality and the typeface and layout are easy and comfortable to read, and there are beautiful photos for almost every recipe. The book will lie open flat so you can cook from it without fumbling.<br /><br />The recipes are wonderful--innovative without that tedious \"I'm trying too hard here to come up with something new and different!\" feeling in so many newer cookbooks. The recipes are geared toward quick preparation (15 minutes, 30 minutes) using fresh and simple whole foods, and even a few simple convenience foods, like canned beans and chickpeas, frozen peas and Dijon mustard. Fabulous.<br /><br />I cannot wait to try: \"Almost Confit\" Chicken with Melted Garlic, Pork Chops and Apples with Madeira-Bay Butter Sauce, A New Way to Cook Broccoli: Charred & Tossed With Chilies and Garlic, Spiced Salmon on a Moroccan Salad...oh, heck, I think I may just start at \"Bloody\" Shrimp Cocktail and work my through to Double Raspberry Sorbet.<br /><br />Recommendation: Excellent addition to a home cook's bookshelf.", "images": [], "asin": "1605294705", "parent_asin": "1605294705", "user_id": "AHLKUGG2Z4M5V6FEHNQUV43QHC4Q", "timestamp": 1288270124000, "helpful_vote": 60, "verified_purchase": false}
{"rating": 5.0, "title": "Great visit back to 90's culture.", "text": "I enjoy this book more every day. I viewed the feature film first and enjoyed the characters so much I wanted more time with them. When the book is over, I will likely view the film again just to watch Sigourney Weaver as the boss and Margaret Qualley as our protagonist. Both actresses were endearing and loveable in their roles. And the wardrobe from the era is worth another visit!", "images": [], "asin": "030794798X", "parent_asin": "030794798X", "user_id": "AEPYR455SGMBEFTZEK2CFG4HYO3A", "timestamp": 1620933647867, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Thought provoking.", "text": "This one put me through the wringer a bit. It's definitely not a feel good novel, though it does have its heartwarming moments. Most of it is bleak and raw. I'm happy to discover what I think is a very talented author and look forward to reading more of her work.<br />Many years ago, Susan's little brother died while in her care. The guilt from his death continues to rule her life even when she has her own little boy to mother. Shockingly, the tragedy happened when she was only seven and her little brother almost five. A seven year old shouldn't even be left alone to care for themselves, let alone for another. Who is to blame, the child who took mothers pills? The slightly older sister watching him? Or the parents, the father who was working and left them in the care of the unstable mother who left her children alone to go out with another man? Little Mark was the clear favorite child of them both and with him gone, Susan suffers even more than she had before.  When she's grown and has a child of her own, she fears she'll hurt him and is too anxious to mother him in most any way. If she can't face her demons, she'll lose everything.<br />I love books that just seem to flow. You don't want to put them down even if you're uncomfortable, you don't get confused by the characters or distracted from the story. This book flows and I read it all at once. Joan Ellis is one to watch for! I came away from it not only thinking about guilt and maternal instincts, but how small decisions we make every day can alter so much.<br />I received a copy of this book from the author and Booklover Catlady Publicity in exchange for an honest review, thank you!", "images": [], "asin": "0993009123", "parent_asin": "0993009123", "user_id": "AHSBM7HU3TYQHUDAMA6WGCMJSE2Q", "timestamp": 1469668563000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "I love the classics", "text": "Poe is one of my all time favorites and now he goes where I go. I am adding more of these great writers to my Kindle. This collection is a great one and the price is good too. You won't regret ordering this one, I know I don't.", "images": [], "asin": "B00CFRGIEI", "parent_asin": "B00CFRGIEI", "user_id": "AFKW5SFKNQTBJ4TFIN6SQMHY7ZLQ", "timestamp": 1392128805000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Fun Cinderella retelling for all ages", "text": "Loved this modern-day fairy tale where our princess rescues herself! Very cute and appropriate for middle grade readers, but with a developed story line that all ages will enjoy.  I flew through this, needing to know what was going to happen next!", "images": [], "asin": "B00I805O7I", "parent_asin": "B00I805O7I", "user_id": "AG2P2S7WZEBX3EC4W45UI3H37S6Q", "timestamp": 1555016325601, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Book quality", "text": "fully satisfied", "images": [], "asin": "191130402X", "parent_asin": "191130402X", "user_id": "AF55ZDEOBQHPLBZBHSIROJGZ4L5Q", "timestamp": 1572088162508, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "My son loves these books.", "images": [], "asin": "0545685443", "parent_asin": "0545685443", "user_id": "AEVFGFMOZEGCW5UUUALUEV7BW5IQ", "timestamp": 1454467379000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great Children's Book", "text": "Wonderful children's book!  Fantastic illustrations!  My grandchildren loved it.", "images": [], "asin": "1973614391", "parent_asin": "1973614391", "user_id": "AFG475LEOVOXSN4HYFFZM7H5XM5A", "timestamp": 1516143557670, "helpful_vote": 3, "verified_purchase": true}
{"rating": 4.0, "title": "Pretty kickass.", "text": "Violent is really not the right word for this spare-no-detail fantasy monstrosity. Insane? Maybe. Really, the only way to describe Remic's Kell's Legend is with a phrase: a bloody, violent, fantastic journey through carnage, terror, and a downright epic tale that makes Underworld and every zombie movie look bad. That sounds about right.<br /><br />Kell's Legend is the first is Remic's Clockwork Vampire Chronicles. It follows Kell, a legendary warrior who has grown old, and a number of other characters, from his granddaughter Nienna to Anukis, a clockwork vampire-turned-exile in her own homeland. When strange, twisted albino soldiers descend upon the city of Jalder, Kell must take up his axe once again to defend his family. But with that action comes a flood of memories hinting at his dark past, at the Kell nobody remembers or everyone chooses to forget...<br /><br />Remic certainly managed a tour de force with Kell's Legend. I've never read anything quite so unapologetic about its violence, but also brilliant in its brute force. Kell's Legend is rough, for sure; at the same time, however, it's entertaining and powerful, taking all that is wonderful about truly epic, adventurous fantasy and twisting it like Quentin Tarantino twists the movies. Remic is the Tarantino of fantasy (and science fiction, I presume), and if that isn't a compliment, then I don't know what is.<br /><br />Kell's Legend isn't just about action and brilliantly detailed fights. It's packed full of amazing dialogue (and some clever witty banter to boot), and the characters are three-dimensional, something I think many fantasy writers of the more action-packed vein (including myself) have issue with. Remic has managed to put together a tale that pushes the boundaries while maintaining the necessary elements of a good fantasy novel (interesting characters, gripping conflicts, etc.).<br /><br />There were only two problems I had with Kell's Legend:<br />1) Sometimes the action can be a bit much. For the most part it's entertaining and propels the plot, but sometimes it feels overbearing; there aren't a lot of breaks.<br />2) The language is outside of my comfort zone in one scene (and only one, as far as I can recall). If his language had kept in that vein for more than one chapter, then I would have tossed the book at the wall, but, thankfully, that is not what happened. However, if you cannot stand foul language in any form, this is not the book for you.<br /><br />Both of these problems are personal preferences and not indicative of any significant fault of the novel or Remic. If you aren't bothered by these things, then this is definitely a book for you. If you're already a Remic fan, then you'll love Kell's Legend.<br /><br />I look forward to the second book in the series. I'd love to know what happens with the Clockwork Vampires, Kell, his granddaughter, and some of the other characters.", "images": [], "asin": "0007324154", "parent_asin": "0007324154", "user_id": "AE7GYCYSPV76DQZL3HB4SOQVRZRQ", "timestamp": 1254331984000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Awesome book to start my journey", "text": "Great book!", "images": [], "asin": "0544559118", "parent_asin": "0544559118", "user_id": "AFDZNHMJHJW4SY4URCQSWLLV3GRA", "timestamp": 1563746089840, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great review book", "text": "Extremely good - using for usmle step 1 review.<br />Great tables and easy to read.", "images": [], "asin": "1506208363", "parent_asin": "1506208363", "user_id": "AEHC346JM3SX56ISGBNU4D22XF5A", "timestamp": 1512777802380, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Four Stars", "text": "Enjoyed reading.", "images": [], "asin": "0738536687", "parent_asin": "0738536687", "user_id": "AHHSZO3SJ7U3HDTWYFDMWONRUWKQ", "timestamp": 1446169452000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Review of Songwriter Deluxe by Fan & Friend", "text": "In the mid 90s Ricky Roberts tried to make a revival of his R&R career with his &#34;An Evening with the Composer &#34; tour. Too bad he didn't have this book to guide him through that sorrowful attempt at a comeback. This book explains all the facts behind the creative compositions of Rick's songwriting from Flying Burrito Brothers to solo to Firefall to him as song contributor to Linda Ronstadt, Stephen Stills, Chris Hillman, the Nitty Gritty Dirt Bad, etc. Without being a scandalous &#34;tell all&#34; Rick takes the fan on a remarkable sojourn through the 80s always building interest as he was moved by his Muse ( no pun intended David or Mary) to write the next earmark of our lives. I suppose since Rick never took music composition you'll have to forgive him for not including the notes and written score. It would have been a big aid to the younger fledgling Rock Stars of tomorrow who would do well to cover Mr. Roberts' ballads & lullabies.", "images": [], "asin": "1500622044", "parent_asin": "1500622044", "user_id": "AH5WZA6D5YWTOJYAALLABHZXZCYA", "timestamp": 1466451053000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "as expected", "text": "as expected", "images": [], "asin": "0618226117", "parent_asin": "0618226117", "user_id": "AF4IY6WBSQ67Y5J75DMZKJJNFE3Q", "timestamp": 1436211471000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A Russian classic.", "text": "Classic. Every word is a gem.", "images": [], "asin": "B001DC5T2S", "parent_asin": "B001DC5T2S", "user_id": "AGVJ4YBHF3HMQLEDF7XBKTJQE24A", "timestamp": 1544099533793, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Great book.", "text": "After the first several chapters, I was ready to shut this book and not read again because I greatly disliked the book within a book stuff. I felt that those extra things distracted the reader from the main plot of the story itself. I would have rather have Jack Browning's books be more talked about than the non-relevant writers (since he is one of the main characters).<br /><br />Diane is a character I can relate and I enjoyed reading about her and her relationship with Jack.<br /><br />Overall, pretty good book.", "images": [], "asin": "0758213964", "parent_asin": "0758213964", "user_id": "AFXE5UAY5S73377ANVY4UO5E54VQ", "timestamp": 1355705510000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "A Sobering Assessment of the Mideast Peace Process", "text": "Reflects the bleakness associated with the entrenched positions among all the stakeholders. A clarion-call for a new approach to peace negotiations and a warning about the oncoming simian takeover of humanity. A must read.", "images": [], "asin": "1312039477", "parent_asin": "1312039477", "user_id": "AHY6GUOCSNYYMNWG3KJZI3F5VOKA", "timestamp": 1396635145000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 2.0, "title": "Not a fan.", "text": "Not a fan.", "images": [], "asin": "B06XJYDST8", "parent_asin": "B06XJYDST8", "user_id": "AGXP6VPVFXD2IISIAQUGGQRQVVAA", "timestamp": 1525381808622, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "A genius at work.  Don't miss this one.", "text": "Though long books exhaust me, I just finished this book and absolutely loved it.  I could not put it down and read the entire thing in less than a week.  I was so happy that Greg Iles dedicated it to Stanley Nelson, editor of the Concordia Sentinel, who is a true hero when it comes to reporting on unsolved murder and missing persons cases from the 1960s in east central Louisiana.  Using real events as a basis for part of the story, Iles demonstrates sheer genius in his ability to capture the reader's attention and hold it throughout the book as though he is reporting on non-fictional occurrences, complete with real people (many of whom are known to the reader).  My one frustration was related to the introduction of so many names that I sometimes got lost as to who they were and had to flip backwards in the book to remind myself. I would love to see a list of characters at the beginning of the next book in this trilogy.  This has to be an award winning piece of fiction.  Can't wait for the next one!", "images": [], "asin": "B00FJ3AC10", "parent_asin": "B00FJ3AC10", "user_id": "AGL35IBGD74NSS6NLELQWFCBQ5LQ", "timestamp": 1400603860000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Learn why prayer is good for you", "text": "This simple book (only around 50 pages long or so) is quite inspiring. In it, Mr. Bounds expounds upon not only the many different reasons why we should pray, but also that we are being called to pray. He reminds us of how essential prayer was to the fathers in the Old Testament and how much prayer centered in the lives of Jesus and his disciples. While this book is written for pastors and other preachers of the gospel, it's a good inspiration to anyone wanting to grow closer to God the Father, Jesus the Son, and the Holy Spirit. While I do not think anyone will literally \"study\" this book, I believe that reading it once or twice in our lifetimes would benefit us in more ways that we might imagine. Pray, pray, and then pray some more!", "images": [], "asin": "1602065411", "parent_asin": "1602065411", "user_id": "AFXUJSKJDFHECCCMTNULFFZPMSBA", "timestamp": 1183405987000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 3.0, "title": "Rail networks?", "text": "The publisher's description mentions that this map features, among other things, \"rail networks.\"  On Kauai?  Er, no.  Read the description above and see.  Makes one wonder how much we can trust the map itself if their ad copy is not even checked for accuracy and plausability.  My guess is that like so much of this modern day world, people rely on pre-written templates out of laziness.  One size does definitely not fit all.  Go with Canada's ITMB map instead.", "images": [], "asin": "3865742238", "parent_asin": "3865742238", "user_id": "AHF6QDOILD3J5HMM2BRFHJH3FSTA", "timestamp": 1366363619000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "It's has a good amount of photos", "text": "This book was a treasure trove of information. It has a good amount of photos, but is not a photo book. I was particularly impressed with the authors treatment of the shootings of civilians. We have all seen allied propaganda which accused Germany of killing innocent people during the march into Belgium. I was able to interview a few remaining German vets in the 70's and they stated the same facts the book deals with. Civilians, under the rules of war, are forbidden to attack military personnel, doing so subjects you to legal reprisals. The civil population was aroused by priests and politicians to attack German soldiers by sniping. This in turn, caused a German reaction that executed these provocateurs according to the rules of war. Any nation would have done the same, and did the same. As with most propaganda, it's based on fact that is twisted to suit the accuser.", "images": [], "asin": "184884445X", "parent_asin": "184884445X", "user_id": "AF7LJ346X6BE3VQEXWB5UNKGZXFQ", "timestamp": 1456249909000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 1.0, "title": "a waste of time", "text": "save your time!", "images": [], "asin": "B074F3BX79", "parent_asin": "B074F3BX79", "user_id": "AHQ6NMBSY7QKD33K4OPNWPZMNBHQ", "timestamp": 1554495040160, "helpful_vote": 1, "verified_purchase": false}
{"rating": 4.0, "title": "Great book, but sometimes a little bit unorgnized", "text": "I found this book great.<br />In brief, the message of the book is crystal clear. The author heartens us to love God in a crazy way. He provides a couple of practical examples whereby a church member can express his/her love for God. To name a few: money, career, etc.<br /><br />More precisely, I like the way the issue of money is dealt along this book. I think Francis Chan did a great job on elaborating this issue from many angles and pointing out pertinent Scriptures.<br /><br />In my humble opinion, the chief problem with this book regards its organization. Some chapters are over-extended. Some ideas are repeated all over the book which makes it a little bit tiring to read. Some points are belabored. Nevertheless, I do understand that this kind of repetition helps us to grasp the main message easier.<br /><br />All in all, I highly recommend the purchase of this book to any Christian who wants to get a fresh view of some key topics within the life of the believer.<br /><br />----------------------------<br /><br />Me pareció muy buen libro. El mensaje es claro y básicamente trata de mostrar como podemos amar a Dios con locura. El autor da ejemplos prácticos de ésto: dinero, carrera, etc.<br /><br />Francis Chan aborda en profundidad el tema del dinero desde diversas perspectiva proveyendo al mismo tiempo los fundamentos bíblicos.<br /><br />Desde mi perspectiva el problema del libro es su organización. Algunos capítulos están sobre-extendidos, algunos puntos son tratados de manera tediosa. No obstante, entiendo que ésto puede ayudar a algunos a entender las cosas mucho mejor.<br /><br />En resumen, recomiendo este libro a cualquier cristiano que quiere obtener una mirada revitalizadora de algunos temas importantes de la vida del creyente.", "images": [], "asin": "1599795515", "parent_asin": "1599795515", "user_id": "AERSWGPLD2CMWZO6JGVDQTKFAGMQ", "timestamp": 1318737586000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "Beautiful book and images", "text": "I absolutely love this book. The images are unique and large enough without too much detail. A page won’t take long at all to complete. Markers are ok to use just make sure you use a blotter page.", "images": [], "asin": "1777502071", "parent_asin": "1777502071", "user_id": "AFG3VOFCW2PCYEP4IDBAHDNSFYZA", "timestamp": 1611763671138, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "book", "text": "My grandson will read anything, if it's about star wars.  He is a big star wars and legos fan. Can't say anymore.", "images": [], "asin": "0756636027", "parent_asin": "0756636027", "user_id": "AEQEKT2ZFDWUWCGEAOSAIMPHJUTQ", "timestamp": 1390396043000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "Entertaining", "text": "The Book of TOAD is an entertaining story that opens the door to a backstage view to the world of psychiatry as an  industry and career choice. In a clever and original premise, the narrator, a psyciatric resident at UCLA Medical Center, inadvertently inspires a patient to invent a web application that turns out to be a popular, wiki-like source of religious wisdom, called TOAD.<br /><br />The book is populated with a dozen or so interesting characters, and kept my interest all the way through. The main thrust of the story, however, is not TOAD. The first half of the book reads like an autobiography, focusing mainly on the narrator's ambivalence about his own career. Only in the second half of the book does an actual plot develop, involving chicanery within the political and professional world of psychiatry. Structured more like a mystery yarn, the intrigue of the second half succeeded at drawing me in to the conclusion.<br /><br />Unfortunately the book missed some interesting possibilities in exploring the \"wisdom\" of TOAD and the narrator's relation to it. Despite being seen as the project's inspiration, the narrator remains aloof from it, surprised that anyone is taking it seriously. We're told that TOAD enjoys legions of users who genuinely benefit from the program. It might have been fun if the narrator learned something from it, or an equally interesting possibility, learned to disagree with its teachings and became a heretic to his own following.<br /><br />Still in all, a good read told with inventiveness and humor, and lots to chew on.", "images": [], "asin": "1477569146", "parent_asin": "1477569146", "user_id": "AGXA56DLMCVNS5LY7F4RXZOV64YA", "timestamp": 1346513266000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Superb! Love it! Fantastic!", "text": "Order did not take too long to ship from Brasil. Book came extremely well packed in plastic and inside a padded envelope to add extra cushion and protection. Not a single defect due to shipping. This is a<br />brand new book and exactly what I hoped for. Amazing and easy to follow music arrangements. This is a must have for any Roberto Carlos fan and collector. I am very happy with this purchase. I wanted this book for a long time and finally was able to get buy it. Highly recommend Livraria Seline in São Paulo for its awesome services!!!", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81CTUJFWSSL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81CTUJFWSSL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81CTUJFWSSL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81GP9A7Zz4L._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81GP9A7Zz4L._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81GP9A7Zz4L._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81MK8OGZ6SL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81MK8OGZ6SL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81MK8OGZ6SL._SL256_.jpg"}], "asin": "8574070114", "parent_asin": "8574070114", "user_id": "AHO3MPXC5YYKUMMSIEYU2HUBWNAQ", "timestamp": 1634090944061, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "So cute!", "text": "Did you know that the author of this book, Alecia Whitaker, is from Cynthiana, Kentucky? Did you also know that I live about an hour away from there? Crazy! I could just relate to this book so much. What Alecia Whitaker wrote was so relatable and so true for this area of the country.<br /><br />The story is about an all country farm girl Ricki Jo, but please call her Ericka if she is at school. She is fourteen years old, lives on her father's farm, and her best friend Luke Foster lives just right down the street. This coming of age novel talks about all the things a girl wants to happen once she enters High School. Ricki Jo wants to be popular and fit in with the cool crowd, but can she still be herself and not change to fit in with the popular crowd?<br /><br />I just loved this book so much! I could relate so much to Ricki Jo at parts in the book. My dad was also a Tabaco farmer, but quite once there was a big buy out which is just what Ricki Jo's dad did also. I live on a farm with cattle, crops, and barns. So I just got really into the story. Ricki Jo lived in a town that isn't too different from mine. The author uses a lot of references that I could understand.<br /><br />I also really enjoyed the characters. Ricki Jo is friends with a bunch of mean girls, but at the end you really see redeeming qualities in them all. My favorite character was Luke and he really held the book together at times. While there relationship was perdictable, I just couldn't wait to see what was going to happen with them in the end. I am glad that Ricki Jo's friend Mackenzie turned out to be a true friend. I really liked her at the beginning and thought that she was nice to Ricki Jo when the other girls weren't.<br /><br />Ricki Jo is relatable to me because there have been a lot of times that I have been in the same position as her. I never really fit in at my high school and I remember putting up with mean comments, just to say that I have friends. But I never had as good as friend as Luke. Ricki Jo is lucky! I also loved all her funny commentary; there were parts when I was laughing out loud.<br /><br />I also just got to say I love Kentucky! It is so beautiful and I love how the author you a lot of descriptive language to describe their farm and how farm life was.<br /><br />Overall, The Queen of Kentucky has a very good message that I think everybody should take the time to read. I would recommend this to any girl that is in middle school. I really enjoyed it and glad that I had it down in my 2012 Debut Author Challenge. I really wish that the author would write another one. There is so much that could go on with these characters! I also just want to read more about Ricki Jo and Luke! Along with Mackenzie and Candace.", "images": [], "asin": "0316125067", "parent_asin": "0316125067", "user_id": "AEIAGYEGZU5S3UAWZDV67VBV57FA", "timestamp": 1358660551000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Best book of the series hands down.", "text": "LOVED IT!!!!! Loved every story, loved how how some intertwine in some of the most curve ball kind of ways, and loved how it makes you feel life and that dust ball or a planet. Fantastic.", "images": [], "asin": "0553564684", "parent_asin": "0553564684", "user_id": "AHLKZ4PPGJST4E5Z7QDUUZEBTAYQ", "timestamp": 1553830766962, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Journal", "text": "I am always journalling, and this book is perfect.  Love the colors and have almost filled up the pages already", "images": [], "asin": "144130424X", "parent_asin": "144130424X", "user_id": "AENS2CTRZKNETZQBBRHDOOOC6CLQ", "timestamp": 1357085707000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 2.0, "title": "Two Stars", "text": "Cover was pasted on.", "images": [], "asin": "1566706165", "parent_asin": "1566706165", "user_id": "AFU5VNODIGPP4GZVITRL7BK52LIA", "timestamp": 1446693178000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 2.0, "title": "As a woman-- this book irritated me", "text": "I am certainly a foodie and love books that take place in Asia, so this book seemed like it was made for me. Unfortunately, the plot was undeveloped, and the food descriptions were so distracting that it was hard to read; however, I kept going. I even began to cheer for the female protagonist as she struggled to find herself. Once I was finally compelled enough to finish the book, the ending slapped me in the face.<br /><br />*SPOILERS* The female protagonist, a career woman with a love for food, finds true love for her coworker, an arrogant misogynist. And on top of that-- he validates her existence so much that she magically becomes happy/content in herself and her life and she loses weight? Perhaps this is a \"happy ending\" that was lost in translation, but to me, this was highly offensive, and had the opposite effect, at least on me. The book could have finished without this very outdated conclusion, which seemed tacked on to the end.", "images": [], "asin": "B071HXVJQF", "parent_asin": "B071HXVJQF", "user_id": "AGEBTLWGAX5CY5YTSJBFNTQERVXQ", "timestamp": 1533828887789, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Perfect!", "text": "This book is everything. I wish I had this as a child. The artwork and detail to the African American characters is outstanding.<br /><br />I bought this for my niece, and my mother daw it and ended up taking it to work to show it around, 4 more people bought it for their kids as well.<br /><br />My niece who is 5 loves it and wants me to read it to her all the time.<br /><br />Also, in case your wondering Goldilocks is called Goldilocks because of the Gold Beads in her hair. Genius use of Black Characters Traditional Fairy Tales<br /><br />I love this book, and children do too.", "images": [], "asin": "0486796817", "parent_asin": "0486796817", "user_id": "AE4QWLAML35YUVYI2ZRLRXCE244A", "timestamp": 1486727682000, "helpful_vote": 5, "verified_purchase": true}
{"rating": 5.0, "title": "Right There All the Time", "text": "An exciting read by one of my favorite authors of Christian fiction! Whitlow actually makes law sound interesting without using a lot of lawyer jargon. With numerous roadblocks and several critical junctions, I liked the winding route he took getting to the conclusion of the story. The characters are so real and cover such a broad spectrum of personalities. For me, the best scene in the story took place on the evening when Buddy and Gracie joined Beatrice and the judge for dinner. I would have loved to have heard Gracie as she prayed before their dinner. Some books have a faint spiritual undercurrent with an over-abundance of romance, action, and suspense. I appreciated the manner in which Gracie was able to just be herself and let her inner beauty shine out to light up the world around her. Unlike many who try to force their beliefs on others, she had a way of living her beliefs in such a way that people gravitated to her and trusted her with their deepest concerns. In so doing, they often opened themselves to receive a special touch from above in such a natural and unrehearsed manner. The world could use a lot more people like her. A wonderful story!", "images": [], "asin": "0785234659", "parent_asin": "0785234659", "user_id": "AHDBMPZPVJT345QIL5OVZT2S6IYQ", "timestamp": 1615438041876, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Five Stars", "text": "awesome", "images": [], "asin": "1888659009", "parent_asin": "1888659009", "user_id": "AGT2JCVKHKZ37BZ6SXROBNEUEUJA", "timestamp": 1489716499000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "super cute!", "text": "This book is perfect for the season & just about anyone who loves cats.", "images": [], "asin": "0578069350", "parent_asin": "0578069350", "user_id": "AF4WPWRIJORITX5MHR6DQEERO5YQ", "timestamp": 1538370691123, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "Masterful plotting, credible characters provide new view to a tumultuous time", "text": "Authentic, credible characters give the reader a different perspective of this tumultuous time as seen through the eyes of a man and his family caught in the middle of it.<br /><br />Percival Chen is headmaster of a school that teaches English to Vietnamese in Cholon, a suburb of Saigon.<br /><br />It is the early 1960’s and business is good as an ever-growing presence of American military personnel in the country means there is an increasing need for translators.<br /><br />Chen is a weak individual, a gambler and whore-monger while at the same time pompous and arrogant. Because of his vices and his pride he is incapable of making a realistic assessment of unfolding events and his changing circumstances.<br /><br />And events are indeed unfolding, momentous and violent ones, dramatically and rapidly. The war in Vietnam is coming to a bloody climax and neighbouring China is in the throes of the Cultural Revolution.<br /><br />The Headmaster’s Wager is a big story that embraces powerful issues like culture, family, love and betrayal, loyalty, war, espionage, profiteering and politics and yet it never falters.<br /><br />Vincent Lam has created a masterful plot full of unexpected twists and turns though none seem impractical or forced as the reader harkens back to revelations earlier in the narrative that were carefully embedded by the author.<br /><br />One of the few novels that is truly worthy of the prestigious Scotiabank Giller Prize.", "images": [], "asin": "0307986489", "parent_asin": "0307986489", "user_id": "AHFLUNO7YPB5RHNFV5AJQFLFGYLA", "timestamp": 1411090618000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Great read", "text": "Very exciting book. I couldn’t put it down once I started reading.", "images": [], "asin": "0385544154", "parent_asin": "0385544154", "user_id": "AFH3QDXQVSU3ELTV2MK6HHPBCDIA", "timestamp": 1549889449083, "helpful_vote": 0, "verified_purchase": true}
{"rating": 2.0, "title": "shocking language", "text": "This book is on the list for the International Baccalaureate Organization for English A1 HL as an approved work under translation.  However, the language and themes are quite shocking, and I am nervous about introducing this to high school students.  I would never have put it on the syllabus or ordered so many copies of the book if I had known more about it.", "images": [], "asin": "1564784371", "parent_asin": "1564784371", "user_id": "AHWTHHNJKHP4UK3HCJNBWCKNX66Q", "timestamp": 1343349878000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Amazing Nutrition Information!!", "text": "I bought this book because I was interested in the nutrition aspects of vegetarianism.  This book has an amazing amount of nutrition information. It is a great resource for planning a complete vegetarian diet.  I haven't tried any of the recipes yet, but there appears to be a great variety of recipes.  The book is worth having just for the nutrition information.", "images": [], "asin": "089815166X", "parent_asin": "089815166X", "user_id": "AF4CHR633PKARCVK7PF3X3CZ3WLA", "timestamp": 1075307718000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 3.0, "title": "Beautiful & underwhelming", "text": "This is a wonderfully written children's book but is not what I expected.  Andrea Beaty just set the bar too high.  Pro tip- Buy every single Questioneer book that is published!!!", "images": [], "asin": "1419748076", "parent_asin": "1419748076", "user_id": "AETLLMK3CCM5GFO5UWK5RAS75KUQ", "timestamp": 1652755818900, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Family favorite!", "text": "This is our Christmas eve book. We read it every year. When we visit someone on Christmas eve we bring this book as a gift to them and we read it together.  They love it just as much as we do.", "images": [], "asin": "0316102490", "parent_asin": "0316102490", "user_id": "AFGOBPNTWME3Q5KRIMPVKDUVESXA", "timestamp": 1575738927366, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Kids have bad hair days, too", "text": "The three star rating is only because I am horrible with hair and I thought I would get more in depth instruction.  However, this is a great book for the basics of hair care for children.  Instead of hair washing time being a chore, it has become something of a treat to my daughter.<br />I have learned to take my time and respect SOME of her decisions about styles, and I have also learned to trust myself when it comes to her hair.", "images": [], "asin": "093918303X", "parent_asin": "093918303X", "user_id": "AEEO5SZFESR5447ZUDJS6MLXDZKQ", "timestamp": 997637129000, "helpful_vote": 6, "verified_purchase": false}
{"rating": 4.0, "title": "I enjoyed the book and had several good laughs from the ...", "text": "One must remember from start to finish that this book is extreme satire. After I accepted this, I enjoyed the book and had several good laughs from the extreme situations described that would otherwise go against most of my values.", "images": [], "asin": "1250083257", "parent_asin": "1250083257", "user_id": "AECIEDWFIHRG7FHWGZNL3YFKLOCA", "timestamp": 1485546467000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Take off your shirt and wallow in the luscious footnotes", "text": "The night I heard about this book, I could barely sleep. I love the War Poets of WWI, I love the Greeks, and I love the lectures of Prof. Vandiver (her lectures are available from The Teaching Company). Talk about an intersection of delights! Would it live up to my desires?<br /><br />Having read several books on the British literature of WWI (starting with The Great War and Modern Memory when I was in college), this was the most enlightening so far. Full of fascinating tidbits to support her conclusions, well edited, a lovely long read, and did I mention the great footnotes. (I'm a softie for good footnotes, and they were such a nice icing on a well-frosted cake.) It is a serious book, one that rewards a careful reader, but not full of specialized nomenclature known only to grad students. Give us more, Lizzie!<br /><br />(And if you've heard her lectures, you can hear her mellow Floridian accent run through the whole thing.)", "images": [], "asin": "0199542740", "parent_asin": "0199542740", "user_id": "AFA4LYMOMDSTWM5EAFXGL7UCYKQQ", "timestamp": 1292647364000, "helpful_vote": 21, "verified_purchase": false}
{"rating": 5.0, "title": "Insightful Devotional", "text": "This little book provides big insight into God's Word.  The book is divided into 40 days worth of devotionals focusing on 40 questions that some are afraid to ask or free uncomfortable asking.  Not only will this book provide insight into those questions, it will provide answers to give to new Christians and those seeking God's will in their lives.  Even if you are a mature Christian with an understanding of the bible, this book will serve to be an invaluable tool for your own walk and for those you disciple.<br /><br />Some questions reflected upon in this book are:<br /><br />Why do I get angry with God?<br />Why do I so easily  lose self-control?<br />Why can't I overcome sin in my life?<br />Why am I bored with church, the Bible, and Jesus?<br />Why do I always feel exhauted?<br /><br />The author, C.D. Baker, uses scripture and life experiences to answer these questions.  You will no doubt relate to some of the 40 questions in this book.  You will also know those in your life who will relate as well.  I have found in my personal walk with the Lord that once I ask the tough questions, I find myself closer to God and walking straight on the path laid before me.<br /><br />Book provided by Waterbrook for purpose of review.", "images": [], "asin": "0307444902", "parent_asin": "0307444902", "user_id": "AFXLKLSYZRAOVGX3O4Q27VWVZ4PA", "timestamp": 1260900240000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Love", "text": "Love this book. Great for fifth graders.", "images": [], "asin": "0142426423", "parent_asin": "0142426423", "user_id": "AH4IBGOIIHF2KTDCQGQZMLKDETOA", "timestamp": 1530251651939, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Another fun N. Roberts book", "text": "I thought this was a great ending to the Bridal Quartet. Roberts's books tell of her love of close friends - large families,  sinking her fingers into God's abundant green earth and Hugh dogs!  Sorry to have finished the last one! Will be sharing this one as I have the other three with my sisters.", "images": [], "asin": "1594134030", "parent_asin": "1594134030", "user_id": "AGJIRNTU3TTGRCB6ECY7ZOQN7JLA", "timestamp": 1360383519000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Super, super story. . .I've since purchased two sequels!", "images": [], "asin": "034553302X", "parent_asin": "034553302X", "user_id": "AHMNNGF7V3BFJXJIUJNTRR4G4QSQ", "timestamp": 1430091577000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Five Stars", "text": "Great", "images": [], "asin": "B01MSAN0SV", "parent_asin": "B01MSAN0SV", "user_id": "AESUKNSNHTSGKTEJL7DFQSMUTUMQ", "timestamp": 1508274140253, "helpful_vote": 0, "verified_purchase": true}
{"rating": 1.0, "title": "Really Disappointing", "text": "This 'book' consists of ONE page of a description of labyrinths and their uses throughout time, along with their 'mystical' properties. There are then rather repetitive renderings of various mazes and none of them intricate or engaging at all. I bought this thinking that at the very least there would be something cool to color or some new shapes or ideas but nada. I'm especially bummed because I like Wil Stegenga books. Honestly, even as just a plain old book this is rather lame. I'm not sure what the intention was in publishing it. Like I said, ONE page of text and 52 mazes. Pages are double sided.", "images": [], "asin": "0880450630", "parent_asin": "0880450630", "user_id": "AHJ3BGOKHWCPY44EUKDEWTXYEJAQ", "timestamp": 1286128815000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "Such a great, fast read!", "text": "I don’t normally have time to read at home. I took this book on vacation. It captured my attention right away. I got lost in this beautiful love story. If I had to put it down, I was excited to pick it up again. Highly recommend!", "images": [], "asin": "B09RM4DR5H", "parent_asin": "B09RM4DR5H", "user_id": "AGRGORKUSBASWCD63J4IZCUPQS2A", "timestamp": 1656517222128, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "100% Deliciousness ~", "text": "Just received this cookbook yesterday! In reading through, nearly every page is tagged to prepare!! This is going to be a VERY well loved cookbook in my house!!<br /><br />Proceeds of these cookbooks go back to their locations to help the people!! All around benefit to everyone. It's beautiful.", "images": [], "asin": "096136002X", "parent_asin": "096136002X", "user_id": "AGUXVPWQVKHS4UJ43A2WV4I5CN7A", "timestamp": 1300550965000, "helpful_vote": 1, "verified_purchase": true}
{"rating": 2.0, "title": "Good pictures, very poor organization", "text": "Finding anything is very difficult. At the beginning of the chapters there are great tables that show all of the topics/subtopics covered in the chapter but they reference no page numbers. To make things worse the topic section titles are turned into sentences that often times don't even contain the topics name in them. If you want to find anything in this book you have to use the index for everything. Also the pages are so thin you can see through them, and I don't mean barely see through them, you can read the words on the next page. The paper quality is literally comparable to some bibles and if you take any notes with pens/highlighters they will bleed through.<br /><br />Content wise I like the pictures more in this book than in my copy of Robbins, but the way it is organized and with how thin the pages are it is hard to justify using it instead.", "images": [], "asin": "1605479683", "parent_asin": "1605479683", "user_id": "AFICQJZJTDBC4FH45J4KA3ER3TNA", "timestamp": 1390151034000, "helpful_vote": 2, "verified_purchase": true}
{"rating": 5.0, "title": "How can you go wrong with Dr. Seuss?", "text": "We have bought about ~20 Dr. Seuss books thus far.  All of them are great to sit and read to the grandkiddos!", "images": [], "asin": "0679805273", "parent_asin": "0679805273", "user_id": "AE36V574UGA55WNUS73T4JFUYMUA", "timestamp": 1623682321213, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Lovely Read", "text": "Sarah Rosenthal's long-awaited book Manhatten is a deeply introspective yet lyrical read about her time spent in New York City. The characters and humor popped off the page, and the setting was a vivid recollection of the city (which I especially appreciated because I grew up in New York). But the book is not just a portrait of Manhattan, it's Rosenthal's portrait of Manhattan. It's about her relationship with the city (and with being young and insecure and inspired and in search of one's identity IN the city). I think this is one reason why the title spells the city's name incorrectly - because this Manhattan is a private Manhatten, a skewed Manhatten. I loved this aspect of it, this searching for your footing in the big city that is only just a symbol or microcosm of the big world. I certainly had my own private relationship with Manhattan as a young adult, and this brought me back to that time of uncertainty, excitement, and the sense that everything simultaneously hangs in the balance and lies up ahead.", "images": [], "asin": "1933132329", "parent_asin": "1933132329", "user_id": "AEQHASC5MMGCXBXSJL7WXVWAVDXQ", "timestamp": 1254504345000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Perfect condition. Just what I expected", "text": "Brand new.  Perfect condition.  Just what I expected.  quick shipping", "images": [], "asin": "B00RN84Z12", "parent_asin": "B00RN84Z12", "user_id": "AENQ2ABLWLKMBYALZ3EKHW6WR4XA", "timestamp": 1526664429485, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great book", "text": "Loved the dialogue and character development.  Enjoyed hearing about post war Germany on the east side. Learned couple things I was not aware of such as people in gdr really did love their country. Looking forward to more books", "images": [], "asin": "B089Y26Z56", "parent_asin": "B089Y26Z56", "user_id": "AG67LPIUODL4X6DJA52D6BSWGEHA", "timestamp": 1617082398067, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Great intro to Danish, wish there were a longer version too", "text": "This was my first Pimsleur course.  It is remarkable how well it teaches you a spoken language - all of which you can do in your car.  Because they are constantly asking you how to put together words and phrases that you know, they reinforce what you have learned and force you to invent new combinations.  Very effective.  Unfortunately there isn't a longer version of this available.  It is just 10 lessons.", "images": [], "asin": "0743550625", "parent_asin": "0743550625", "user_id": "AF54ZISQ4IZUO56KHYKT6IQUQR4A", "timestamp": 1181363977000, "helpful_vote": 6, "verified_purchase": true}
{"rating": 4.0, "title": "A painful portrait of the poor in Colombia", "text": "This book is a chilling collection of voices first published in the UK.  The accounts come from the very poor in Colombia.  To that end, most of the voices are female.  Journalist Constanza Ardila Galvis does an outstanding job of capturing the views of the poor in the Colombian countryside.  However, she is guilty on two counts.  One...the views are overwhelmingly pro-guerrilla and secondly her prose is too melodramatic.  Nevertheless, this is an important book that documents the suffering of the rural and urban poor war inside Colombia.  Two quotes stuck in my mind when I finished this book.  The first was by Laura who said,\"the hatred against those who persecute and murder us kept me in the struggle.\"  And Angela who said, \"I continue to be convinced we must keep dying, giving birth and bringing up soldiers for the revolution.\"  On a positive note, all the voices in this book conclude that a non-violent and just solutions must be sought in Colombia.  The bad news is that no one knows how to get there.", "images": [], "asin": "1899365427", "parent_asin": "1899365427", "user_id": "AFMUXMUBRBEBZPFPN2DZODAGOVUQ", "timestamp": 1026416485000, "helpful_vote": 6, "verified_purchase": false}
{"rating": 5.0, "title": "Five Stars", "text": "Nott many recipes, but all the information you need to make artisan breads of many different kinds.", "images": [], "asin": "160774273X", "parent_asin": "160774273X", "user_id": "AEFMBHFIMVZTG64K6GMLONZRMHQQ", "timestamp": 1528661688724, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Houshold simplification based on big family examples in article style chapters", "text": "The book is a summary of blog entries, which is mentioned in the headline.<br />The articles themselves are focused on a big multi-generation family, which renders some advice too specific and hard to &#34;downsize&#34;.<br />Overall the topics give you an idea how to &#34;declutter&#34;, fun anecdotes are included, the chapters - based on original articles lacked for me a red line for structure.<br />If you look for a quick read on how to deal with family clutter and probably won't read the book in one sitting but each article individually this might be just the perfect book for you.", "images": [], "asin": "B0089H5XXA", "parent_asin": "B0089H5XXA", "user_id": "AHHGOCNOWPJZKJLXXGW2LLOGUP6A", "timestamp": 1381917839000, "helpful_vote": 3, "verified_purchase": true}
{"rating": 5.0, "title": "A Killer Midlife: (Witching After 40 Book 10)", "text": "Loaded with joy,pain,success,failure and a ton of unexpected twists, this book really delivers! The romance was top notch, the humor really delivers. The best of all the reads up to now. I'm excited for the rest!", "images": [], "asin": "B0984PFFJT", "parent_asin": "B0984PFFJT", "user_id": "AFG35VUEW2HY33LH6R5B7AKNMZ2A", "timestamp": 1646592024473, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Gorgeous!", "text": "I was blown away at the detail in this coloring book, every page is gorgeous, feminine. There's so many colors to choose, you could go wild with this and it always comes out beautiful! :)", "images": [], "asin": "0486481697", "parent_asin": "0486481697", "user_id": "AF2T3JH64FHBEOLIBC6WOAS3ACYA", "timestamp": 1382502782000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "This doesn't disappoint.", "text": "Big Linda Howard fan.  This doesn't disappoint.", "images": [], "asin": "0345476255", "parent_asin": "0345476255", "user_id": "AFEFR6D5YLHZB4J2Z3HLM4OQQTHQ", "timestamp": 1417090459000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Two things we need more of today...Devotion to Christ and more horses.", "text": "Beautiful photography that goes along perfectly with the spoken word.  There are two things this world needs....IMO.  More devotion to Christ and more horses.", "images": [], "asin": "1400303311", "parent_asin": "1400303311", "user_id": "AERFQHVZAGV5GW7M2AT7INUUGHEQ", "timestamp": 1595094019711, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "LOVE these books, just like i remember!!!", "text": "Just like I remembered it when I was a kid! A great book with neat illustrations! I feel like even as an adult I can always learn a thing or two from the Frances books (like how to get my toddler to eat better using reverse psychology). The only bummer is I can't quite do the voices the way my mom did.", "images": [], "asin": "0060838000", "parent_asin": "0060838000", "user_id": "AGIQIHOYKORTRELGGXQ6SHYHXRVQ", "timestamp": 1616601932804, "helpful_vote": 3, "verified_purchase": true}
{"rating": 4.0, "title": "Entitlement Isn't Nice", "text": "Don't jump to conclusions. Entitlement on the surface is not what you think. As defined by Townsend entitlement is expecting things to be easy and blaming others for the hardness of life. It is expecting people to recognize your greatness and treat you favorably.<br />  It may start when you say to a young girl she is pretty and leaving her to feel she must be pretty to be accepted.<br />  Townsend talks about a hard way in contrast to the easy way.<br />  I found this book to be a delightful read and would recommend it for parents in the raising of their children. Get this book and read it. Pass it on.", "images": [], "asin": "0310330521", "parent_asin": "0310330521", "user_id": "AGRTP2UMLK7SAPNGOKOJLVV5U4UA", "timestamp": 1447973711000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Surprisingly, awesome!", "text": "This case is amazingly thin and does offer some protection. It has a matted feel and has plastic bumpers. Keep in mind, even though it offers some protection, this is no otter box. But definitely a &#34;must have&#34; if you don't like bulky cases.", "images": [], "asin": "B019JUZ5MO", "parent_asin": "B019JUZ5MO", "user_id": "AFUXOT24CGCDK55FLGSFTQRJVC4A", "timestamp": 1457313790000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Nothing New", "text": "I expected new insight and commentary. Basically, it is another research book of history of a well known event, at least from my background. I may be overly harsh since I have a BA in Religion and most of the content was familiar. My intent on purchasing their other books is on hold.", "images": [], "asin": "B00BIOG1ZU", "parent_asin": "B00BIOG1ZU", "user_id": "AE5YLOMG64UWADEYRMNDOEYJRJTA", "timestamp": 1382364583000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Enthralled!!", "text": "An author, Seeley James, from Elements 42, recommended Brett Battles’ books to me. Mr. James recommended the Excoms series, which I did purchase all four books from the series, then my eyes strayed towards the Jonathan Quinn series…received a complimentary ebook, The Cleaners, from him..that’s all it took…couldn’t put the book down..and, yes, Mr. Battles also owes me “some” forty winks, but it was worth every minute that I didn’t sleep..currently, I am waiting for the second installment to arrive. Not to worry, while waiting, I am currently reading the second book of the Excoms series…I definitely recommend this book to anyone who loves a good book.", "images": [], "asin": "0440244382", "parent_asin": "0440244382", "user_id": "AEXNI7MDGE7Y6B7LIQYE5BDRKE4Q", "timestamp": 1641699919705, "helpful_vote": 1, "verified_purchase": true}
{"rating": 5.0, "title": "home run mr king", "text": "Stephen King was at his finest when writing this loved it so much , couldn't put it down no matter what!", "images": [], "asin": "B00GEEB52S", "parent_asin": "B00GEEB52S", "user_id": "AFDHHAEQ3JYYKW2YTFOSJR6WSVMQ", "timestamp": 1403506806000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "Dispelling the Myths...", "text": "This book does an incredible job of dispelling the myths associated with leadership and gives clear and compelling insight on what great leadership is and how to get there. Highly recommend", "images": [], "asin": "0578365855", "parent_asin": "0578365855", "user_id": "AH4ZHM2BZCI6J4YYCOPD4LCAG63Q", "timestamp": 1653357176213, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Good Book", "text": "This was a gift for my husband.  He read it in one sitting and said it was good.  He is a big Louvin brothers fam.", "images": [], "asin": "0062069039", "parent_asin": "0062069039", "user_id": "AETBN4RLQFOBWFPBM3MFA7PZ3MFQ", "timestamp": 1420915204000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 2.0, "title": "Great Book! But.......", "text": "I was really excited to get this book because my son stuggles with history. We already had the textbook through our homeschool curriculum. There is only one problem. There is NO answer key! It is very time consuming to have to check his work without an answer key. Although I know the answers to the questions (or most of them), I don't always have the time, nor does it help in gauging if his answer needs elaboration.  I think it is totally ridiculous to not provide an answer key, thus, I only give this book 2 stars. It would have gotten 5 otherwise.", "images": [], "asin": "0395891426", "parent_asin": "0395891426", "user_id": "AGNL23CERIZYXXOEBTDG7GYS2A4Q", "timestamp": 1317309404000, "helpful_vote": 2, "verified_purchase": false}
{"rating": 5.0, "title": "Good grief, this was fun !!!", "text": "I found this adventure of a book quite entertaining and worth the read.  Had me either smiling, snickering or laughing out loud through out each chapter with its innuendos, slapstick sarcasm, and double entendres.  Moreover, it was fast-paced and quite suspenseful that I finished it in 4 hours.  So, when is volume 2 coming out?", "images": [], "asin": "0615771513", "parent_asin": "0615771513", "user_id": "AGCAVK5UNRFLEPUC3M7JSC42IFDQ", "timestamp": 1365187515000, "helpful_vote": 19, "verified_purchase": true}
{"rating": 5.0, "title": "Wow!", "text": "Well written, I couldn't put it down!<br />Intensive, fast  paced.<br />A great read over all. Congratulations on swimming  piece of literature!", "images": [], "asin": "B01CMGZLIU", "parent_asin": "B01CMGZLIU", "user_id": "AGMTT2NIXVBPJ3LD3OBC4ZC7TG4A", "timestamp": 1479416291000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 5.0, "title": "\"Lion Man\" \"Green Eyes\" loved it", "text": "The Secret Enemy Saga “Fracture” Book #1 by Virginia McKevitt<br /><br />Where do I start??? I just recently had the pleasure of meeting Virginia McKevitt at a book signing function in New Orleans.  I hadn’t heard of her as an Author and was not familiar with her work.  I read all types but heavy into the paranormal, erotic, sci fi and contemporary romance.  None of which really are YA or NA.  I picked up both the books at the signing and promised Virginia I would read them.  Well since I hadn’t brought my kindle with me I decided to start the first book.  I was a little tired and didn’t get far along.  I didn’t have the chance to pick it back up until I got back from New Orleans.<br /><br />When I started reading I’ll be honest I wasn’t sure if this was something for me, I realize the first few chapters most authors set up the characters so it might be a tad slow, once we got past the formalities of the characters (BTW the set up was actually very interesting.  Good back ground info for later in the read), the read took off.  OMG I so wasn’t expecting that.<br /><br />Kristina based on all accounts is one feisty, strong willed, strong headed no nonsense young lady.  When her parents were murdered she didn’t crumble and fall apart, now don’t get me wrong, yes she was devastated, but she was out to seek revenge.  She wanted to see whoever did this dead. Kristina was what we might call a half breed. That’s all I’m saying on this subject. In comes Tegrin Guardian/Assassin and the King’s right hand man. Tegrin was sent on a mission by his King to dispose of the Couton (A clan of Women who feed off others emotions) who had found the opening between the two worlds.  They wanted out from under the King to do as they pleased.  On top of the pleasure they experienced from feeding on the memories of the humans they were experiencing other emotions and it became an addiction.  In the small town of Blessings the bodies were piling up and Tegrin was sent to stop them. It’s in Kristina’s home Tegrin meets his destiny “Kristina” (grant it he doesn’t know that yet).  Tegrin was to get in and out and not let any humans see him.  That didn’t work out so well. He ends up allying with Kristina’s two friends Sissy and Jimmy and of course Sissy’s dog Bo a retired CIA operative in order to stop the Couton.  So much for humans not finding out.<br /><br />There was a lot unknown about Kristina and we do find out what she is.  The story played out perfectly.  From the tattoo appearing after her first kill, to her warrior like instincts. What happens when she finds her real Dad’s military foot locker left to her when he died, to her going to Potwain with Tegrin to meet her Grandfather and be trained as a guardian and taught how to use her powers.  She’s the best of both worlds.<br /><br />There is a little touch of humor, for example when Tegrin brings Ahmor (a Guardian) to train and fight with Kristina (because he can’t be around her) and she breaks his nose. My favorite was when Kristina smacked Maketi’s nose (Tegrins Stallion).  Now you have to understand everyone feared Tegrin but they feared his horse also.  She had those two spinning.  She showed absolutely no fear.  As in all good reads there is a sad part but you’ll need to read for yourself I don’t want to give too many spoilers.  Hmmmm but I’m going to give one now Tegrin and Kristina do the deed. YES.  The stone cold hearted Assassin who has no emotions fell for our girl.  Everyone saw it.  The King, her grandfather everyone.  I loved it.  Now I can’t wait to jump into “The Hunted” Kudos Virginia I really did love it.", "images": [], "asin": "B007HOOLUM", "parent_asin": "B007HOOLUM", "user_id": "AEWBOSM2T2MPHWXWLFPZ744JMZDA", "timestamp": 1413841342000, "helpful_vote": 1, "verified_purchase": false}
{"rating": 5.0, "title": "Beautiful and very flattering", "text": "Beautiful and very flattering!  I bought this in two colors and love them both.  It is very soft and silky.  Well made and a good length.", "images": [], "asin": "B01LZ41CES", "parent_asin": "B01LZ41CES", "user_id": "AH6CK354TGTB5ICR72RG35W7XKFQ", "timestamp": 1491063019000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Good story but could have been tighter", "text": "The story was interesting but they could have edited out a lot of irrelevant info about the history of Egypt and other tangents that did not seem to go anywhere.", "images": [], "asin": "B01K2R15SG", "parent_asin": "B01K2R15SG", "user_id": "AG6UAELTV6XWWQCNOYLHK3VBEGZA", "timestamp": 1569602068280, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "A captivating memoir", "text": "I started this book this afternoon, intending to read one chapter. And hour later, I was so caught up in the story that I read the whole thing. Dinner was late. It was worth it.<br /><br />Girl at the End of the World is a memoir by Elizabeth Esther,  a woman who grew up in a fundamentalist branch of Christianity founded by her grandfather.  It’s essentially the story of what happens when enthusiastic followers of Jesus (her grandparents were influenced by the Jesus Movement) slowly shift from the faith that drew them in and get wrapped up in rules and behavioral codes and the strict dictates of one charismatic, unaccountable leader.<br /><br />The storytelling here is so good. The author masterfully shares the scenes of her childhood without bitterness – towards God, faith, or her family. It’s impressive, and the book is one of the best I’ve read in this genre.  I was surprised by how relatable this story is. I grew up as far away from a faith based cult as one can imagine, and yet I feel like I want to sit down with the author, pour a glass of wine, and talk about the amazing ways God works in our lives. She really succeeds in making readers feel like friends.<br /><br />The story is divided into three sections: her childhood, her experience breaking out and trying to navigate mainstream culture, and then her process of figuring out a new way to engage with God outside of her strict, abusive upbringing. I loved it all. Her descriptions of her childhood are so vivid, I felt like I was right there (which was difficult at times – there are some tough moments).  Her take on first encountering Oprah Winfrey’s show and how quickly television commercials stirred up a dissatisfaction with her life she’d never felt before is a great reminder of how much we’re being manipulated by what we watch.  And there’s a real sweetness to how God pursues her as she and her husband seek a new way to raise their own family.<br /><br />Note: I received a copy of this manuscript from the publisher in exchange for a review.", "images": [], "asin": "0307731871", "parent_asin": "0307731871", "user_id": "AFG3AKZLOUOGEPVO35TBMVFM74ZQ", "timestamp": 1395448695000, "helpful_vote": 4, "verified_purchase": false}
{"rating": 5.0, "title": "Tender, Funny, Provocative", "text": "The Twelve is a beautiful fable of what 2012 just might mean to us all. Max, the hero, is a classic, modern \"everyman,\" struggling with work, romance and a creepy brother. He tries to listen to his inner voice, but it seems to go quiet for long periods as he tackles \"real life.\" Sound familiar? Unlike many overzealous metaphysical books, The Twelve is quite amusing in a very human way. Like another reviewer here, The Twelve reminds me a lot of The Celestine Prophecy. But the \"spiritual\" scenes are a lot better; they're done with respect and finesse. All in all: Tender, Funny and Provocative.", "images": [], "asin": "1593155565", "parent_asin": "1593155565", "user_id": "AEFQU6DKQWTX5CU3UXC722M3ZNLA", "timestamp": 1252765500000, "helpful_vote": 5, "verified_purchase": false}
{"rating": 3.0, "title": "Good but not SEP's best", "text": "I am a huge SEP fan - her books have had me laughing out loud and crying too, but I didn't feel the same emotional connection in this book.  Of course this is a well written book and the dialogue is engaging, but I agree with many others that there wasn't enough of a story line to fill the book, and in the end was predictable.<br /><br />And to the reviewer who said this seemed to mirror Brad Pitt/Angelina Jolie vs. Jennifer Aniston saga -- I thought the same thing!!!<br /><br />So, all in all, worth reading if you are a SEP fan, but rent it from the library as it won't be one you are likely to re-read.", "images": [], "asin": "0061351504", "parent_asin": "0061351504", "user_id": "AEE3WEZZBXUVY6MO7CTN3NODR4NQ", "timestamp": 1233443126000, "helpful_vote": 4, "verified_purchase": false}
{"rating": 5.0, "title": "5 star author and story!", "text": "I couldn’t put it down!", "images": [], "asin": "0312577222", "parent_asin": "0312577222", "user_id": "AFMRQB2EBQYUOMPVPQBABUG4OV5A", "timestamp": 1615447931527, "helpful_vote": 0, "verified_purchase": true}
{"rating": 4.0, "title": "Four Stars", "text": "Enjoyed the humor a lot. Good story.", "images": [], "asin": "0312274920", "parent_asin": "0312274920", "user_id": "AEKTB4LB2L4HJI6TFUTS2KO6IRPQ", "timestamp": 1412164686000, "helpful_vote": 0, "verified_purchase": true}
{"rating": 3.0, "title": "Steroids?", "text": "The author looks like she’s (unfortunately) on steroids, which undermines the fitness  message, although there is some good info.", "images": [], "asin": "0440534267", "parent_asin": "0440534267", "user_id": "AF3JTYFT5MBDXG5QYSNSZHP3MIPA", "timestamp": 1590859580872, "helpful_vote": 1, "verified_purchase": true}
{"rating": 4.0, "title": "well crafted, old-fashioned style thriller", "text": "First of all, I read the book because I learned that JK Rowling had written it under a pseudonym. As an adult, I read the Harry Potter books and loved them, and now, my 11-year old daughter loves them also. Though their target was another age group, I noticed that, if you looked close enough, the situations, comments, etc., portrayed in the books hinted at a world of values that had permeated the fantasy story without burdening it without need. Afterwards, I read The Casual Vacancy and was confirmed in my theory. Now, with the first Cormoran Strike book, I was once again confirmed that, quite apart from the HP books, JKR is a writer on her own right. Come to think of it, the HP books are also a kind of whodunnit .... If you enjoy an old-fashioned thriller, with lots of sociological allusions, all of them absolutely functional to the story, slow-paced but not dragging, with twists and turns, character development and good vocabulary, I think you will enjoy this book.", "images": [], "asin": "1408704005", "parent_asin": "1408704005", "user_id": "AF47LFAAZARA7GFCDZWHRX7SUJOQ", "timestamp": 1506450778197, "helpful_vote": 16, "verified_purchase": true}
{"rating": 3.0, "title": "Disappointing for Nelson", "text": "I thought I would want to read whatever Blake Nelson published, but I was wrong. Girl was by far his best book, but this one was a big letdown. The characters were uninteresting and sometimes repellent, the poems inserted every now and then added nothing to the work (and bored me), and the \"gritty city\" subject matter just didn't interest me.<br /><br />It's possible that the NYC writing scene could really dig this, but I didn't. (And I like Neresian.) Not really worth the time.", "images": [], "asin": "0684838389", "parent_asin": "0684838389", "user_id": "AF4AWDAGQXLBD5VOYLPQICZSSZ6A", "timestamp": 1177688323000, "helpful_vote": 0, "verified_purchase": false}
{"rating": 5.0, "title": "Good buy", "text": "Very nice quality coloring book", "images": [], "asin": "1540780260", "parent_asin": "1540780260", "user_id": "AE2GNINIUYOPGTWI4OGJZAFKCS5Q", "timestamp": 1505697685839, "helpful_vote": 1, "verified_purchase": true}
