{"label": 1, "rating": 5.0, "title": "Fast-paced and interesting read!", "text": "I liked how each chapter was told from the perspective of a different character as the story unfolds. Everyone had a different voice and different stakes.  I enjoyed it very much!", "images": [], "asin": "B06XGFQ23J", "parent_asin": "B06XGFQ23J", "user_id": "AGEMKUMBGXDZT2PHP6ABVGI3DG3Q", "timestamp": 1514735374192, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Lyrical, haunting masterpiece", "text": "Incredible writing and a vivid sense of place make \"Housekeeping\" a modern masterpiece, marred only by a bit of Oprah Book Club-style melodrama. The lake and the Idaho community this book is set in come to life as a kind of timeless archetype of the Far West, complete with climate calamities, sudden violence and extreme isolation. In some spots, Robinson's lyricism makes the plot a bit hard to follow, but that said, certain images from this book will stay with me forever.", "images": [], "asin": "0374525188", "parent_asin": "0374525188", "user_id": "AGRKG25VOBXMKI6NHHZ4MVMKG7IA", "timestamp": 1092713331000, "helpful_vote": 7, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Captivating Read", "text": "Intriguing and captivating. Loved the characters.  Was eager to keep reading but sad for the book to come to an end.", "images": [], "asin": "B07415PPP1", "parent_asin": "B07415PPP1", "user_id": "AF55CFTTGF7HWNKSPXQ4VH46JVQQ", "timestamp": 1578949719971, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Art on Art", "text": "I had the opportunity to attend a reading Eleanor Davis gave of &#34;Why Art?,&#34; and she had the audience laughing and crying; I teared up a little myself. This funny, strange, and haunting graphic novel explores our relationship with art (as both creators and consumers) through deceptively simple pen and ink drawings. In fact, I think that simplicity is important to its charm-- the cartoonish portrayal of the characters makes them feel vulnerable and innocent, which lends a sense of humanity to the abstract narrative. The metaphors here are powerful and thought-provoking, but not inscrutable. Any reader who loves art is bound to feel what what it means, and see themselves within these pages.", "images": [], "asin": "1683960823", "parent_asin": "1683960823", "user_id": "AETGSRRECMAHGHEOHULFU4PCVTOQ", "timestamp": 1521259700492, "helpful_vote": 4, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "An intelligent, intriguing, mysterious work.", "text": "This book surprised me. I guess I've been let down so many times by poorly conceived, blandly written and inadequately edited books that I assumed 'She Does Not Fear The Snow' would be more of the same. Not so.<br /><br />Bobbie Ann Cole is an intelligent writer who has produced a perceptive and well written account of a significant life event. The heart of the book rests on three catalytic events: Cole's cancer diagnosis, her failed marriage and her examination of Hebrew and Christian faith.<br /><br />In a form of pilgrimage Cole travels from England to Israel, Switzerland and Canada, along the way encountering remarkable people and events. Her guide and confidant is often Terry, an impish, intuitive, serendipitous lover of life who emerges from her log cabin in Canada to join Cole in mystical discovery. The  friendship leads to another person - a quiet, humorous man who engages Cole in ways that surprise her.<br /><br />The romantic interludes may be of more interest to female readers but it is the stunning mysticism that intrigues me. Throughout Cole bravely approaches events that appear to supersede logic. Some are natural: an eagle flying beside her for miles on a frozen river, whitetail deer approaching fearlessly, the menacing, powerful appearance of a moose. And there are unexpected human events including the offering of a rug and its emergence as a map defining Cole's and Terry's natures and perhaps their futures.<br /><br />'She Does Not Fear The Snow' examines suffering, searching, finding and the place of mystery in transforming lives. It is a testament to friendships honed on a crucible of truth. This is an honest book that takes chances and gets away with it.", "images": [], "asin": "0991760425", "parent_asin": "0991760425", "user_id": "AHOG2X5T2FE42UHWVFFF24SKT4MQ", "timestamp": 1389441927000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "So it Goes.", "text": "I really enjoy the vast majority of the Modern Classics but Slaughterhouse-Five just didn't make the cut.  I didn't put this book down at all after I started reading it because I just wanted it to be over.  The story was too out there.<br /><br />Kurt Vonnegut wrote this book to protest war, but I think that he failed horribly at that.  The only reason I even gave this book two stars was because of the humorous moments in the story.", "images": [], "asin": "0385333846", "parent_asin": "0385333846", "user_id": "AFGEGABCLAPP24GJOLTU4FZ5J5IA", "timestamp": 1453772105000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Training!!", "text": "Great Air Force story.", "images": [], "asin": "1626524734", "parent_asin": "1626524734", "user_id": "AGBXIXGXWITYTZH2X3HXHQWNNAJA", "timestamp": 1517200416839, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I'll keep looking", "text": "I expected more - this is not very well written or well organized. It's not terrible, but I kept feeling like the author's mind works completely differently from mine, but in my experience this is usually a sign that an author isn't doing a good job communicating. The graphics aren't very helpful either.", "images": [], "asin": "0982368135", "parent_asin": "0982368135", "user_id": "AGCVFCUXUOU2L5GMKC74AF3NCVAQ", "timestamp": 1423973702000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Good book.", "text": "Good reading.", "images": [], "asin": "9178940214", "parent_asin": "9178940214", "user_id": "AGPEVQEQYYCXIBAHVWIXBU3XJPGQ", "timestamp": 1566762615317, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Oh my!", "text": "Truly a memoir of mixed emotions starting on page one. I loved this story. Reminiscent of my mother's storyline., growing up in Kiev.", "images": [], "asin": "B07791M17S", "parent_asin": "B07791M17S", "user_id": "AEEJEJGMICHHN52HBQEOVGMARYPA", "timestamp": 1520269870754, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "excellent book", "text": "well written and although a part of a  series, it stands alone. I like the respect<br />with which the Native American aspects are treated.", "images": [], "asin": "B00H0FIZAU", "parent_asin": "B00H0FIZAU", "user_id": "AGUDKDTKOUSTJVM4ELO4RGN4GN7Q", "timestamp": 1406392661000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Great Writing Lessons for GED", "text": "It's one of the main books we use in our GED related classes.  I bought it for a student's summer use.", "images": [], "asin": "1564208613", "parent_asin": "1564208613", "user_id": "AFT6664ZGA3M5L3HVMEHO7ESMFWQ", "timestamp": 1469151188000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "The Russian may be OK, but some English words are mispronounced", "text": "Listen to the audio sample provided: this is essentially a long list of vocabulary words that are recited, first, in English, then in Russian, with a pause in between.  I was going to buy this, but listening to a list of words seems a bit boring.  In addition, the narrator has a strong accent (in English) and mispronounces some English language words (e.g., \"bicycle\", \"boat\").  If that doesn't bother you, this may be fine for learning Russian if you don't mind listening to a long list of words.  But it is quite obvious from the sample audio that the narrator is not a native English speaker.", "images": [], "asin": "B07LFHZLWD", "parent_asin": "B07LFHZLWD", "user_id": "AGTJIFHY76U3DC7GIAR2RGEBLAIQ", "timestamp": 1586490616597, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Very happy I bought this book!", "text": "Lots of interesting details - and good photos as well.", "images": [], "asin": "0295988703", "parent_asin": "0295988703", "user_id": "AERPC7UTSLWJ7YEJ5CE3BWMRQCQQ", "timestamp": 1489354825000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Good Read", "text": "I loved learning about the three generations of women and what their life was like. Their stories are told in a heart felt,eye opening way. This is a long read but it keeps you coming back to find out what happened next.", "images": [], "asin": "B0036QVOIW", "parent_asin": "B0036QVOIW", "user_id": "AGKRKGMPVQLLHOEXHNAZUGCNT2YQ", "timestamp": 1435116139000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Coben is always a good read.", "text": "Drop Shot is involved enough to keep one's interest throughout the book, but not so complicated that it is hard to follow. There are twists enough so that I could not figure out 'who done it' until near the end. That makes it a good read.", "images": [], "asin": "B000S1LESI", "parent_asin": "B000S1LESI", "user_id": "AEKO3LVXFMVJA4XHZUKGLWADHFMA", "timestamp": 1403320945000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Good for the inexperienced but weird to reach out on Instagram for a sale", "text": "I was enjoying the book despite the likeability of the main character. She paints herself in a very real way, but pushes her insecurities to the forefront more often than is admirable. My least favorite part about all of this is the fact that when I was 3/4 of the way through the book, I decided to follow her on Instagram. Probably a day or so later she sent an obviously copy and pasted message to me on Instagram saying thanks for the follow and that I should check out her book. It honestly rubbed me the wrong way. This whole book is about her dealing with her insecurities but it was a little earth shattering to get a current message from her obviously still dealing with being incredibly insecure. I bought this book because I'm an adventure climber and I wanted to read more accounts of women in the wilderness, but this was not the story I wanted to hear.", "images": [], "asin": "173484180X", "parent_asin": "173484180X", "user_id": "AENNEIGYFUJ7BCDAPJM435FWDC7Q", "timestamp": 1646065183975, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Everything you need, no frills though", "text": "The booklets covered all the material that was on the test. It wasn't the most exciting read and lacked some of the diagrams and formulas that I would have hoped for, but if you have the time to study all of this book, you should be fine on the test.", "images": [], "asin": "1627330909", "parent_asin": "1627330909", "user_id": "AF6MKKZAW2L432K7I2Y5NKVTOAKA", "timestamp": 1433274798000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "How to use the Windows Command Line", "text": "This book presents a clear explanation of some of the commands that can be used with the Windows Command line. The author provided the meaning of various acronyms like FAT and NTFS  for example, and others, of which the reader may not know the meaning.  Even though I started computering with DOS, and the command line is a leftover of that system, I felt that the book provided helpful reminders of how to navigate with basic commands.  The author's warning to cautiously use some of the commands is well taken because the command line is a powerful tool and not forgiving if the user makes a mistake.  I liked the book and believe that it is a good read for one who is interested in knowing what the Windows Command Line can do.", "images": [], "asin": "B005NRXU0W", "parent_asin": "B005NRXU0W", "user_id": "AFOJJLSAZEPXD6RGFHSDDZGBE4KQ", "timestamp": 1426011754000, "helpful_vote": 8, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Best book in interesting trilogy about US Navy career, flying in F-14 Tomcat fighter", "text": "As other reviewers have indicated, Dave “Bio” Baranek has completed his trilogy of books about his US Navy career, flying in the F-14 Tomcat fighter, with a flourish. He has written what many, including myself, find to be the “best of the best” among his three excellent books.<br /><br />Bio takes you through his Tomcat flying days from the time he left the Navy’s Topgun school as a still-young Topgun Instructor, all the way through the rest of his 20-year Navy flying career… as he advances in experience, rank, and responsibilities… to eventually became the Commander of an F-14 Squadron.<br /><br />Tomcat RIO also provides a look at how the previously air-to-air-only Tomcat adapted to a new additional role as a “Bombcat”,  with potent LANTIRN-assisted day and night air-to-ground strike capabilities. Bio details the varied real world armed-and-ready missions his squadron of Tomcats flew in support of Operation Southern Watch. This was the joint operation enforcing the no-fly zone over southern Iraq, which was implemented following Gulf War One.<br /><br />If you like books about military aviation, I predict you'll like this one....  it's a keeper for the personal aviation library.  BF (former USAF A-10 Warthog pilot)", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/41ToArY+19L._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/41ToArY+19L._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/41ToArY+19L._SL256_.jpg"}], "asin": "1510748229", "parent_asin": "1510748229", "user_id": "AGOTH6RZPULDN5NWEAZ36LB6GSJQ", "timestamp": 1602619024923, "helpful_vote": 7, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Good read", "text": "As always with Cussler there is a good historical bent to the book.  He always weaves an intro story to set the scene for what will eventually take place.  I love the interaction between the macho hero types, be it Pitt or Austin and their cronies.  I don't miss a Cussler book and this was a good read.  It's not his best and I did miss him in the book.  If you like Cussler, you'll like this book.", "images": [], "asin": "0399154191", "parent_asin": "0399154191", "user_id": "AGMCTLTIXSSNNH34TR2DQOCM5HVQ", "timestamp": 1187120935000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not what I was looking for", "text": "Maybe alright for some people. I wanted more information on the formation of rocks. I didn't return it and will give it to my club.", "images": [], "asin": "0878425659", "parent_asin": "0878425659", "user_id": "AHEQEIYKN4EDH3LNN5N4PNWSVCIA", "timestamp": 1387548321000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great resource, great inspiration", "text": "I like others received a full copy for an honest review, I think it is a great resource for both new GMs and experienced ones alike. I thought the tables were great because sometimes you get in a rut designing new dungeons and just a simple roll can get you out of that and thinking a new way. Sometimes answering what the walls look like for the 15th time that night you can have a new response.<br /><br />If I had known about it before I was offered it I would have gladly purchased it. In fact I enjoy it so much I am considering having it printed myself so that I can have when I design dungeons as I still prefer to draw them by hand. The section on dungeon designing was very much needed as when I started 20 years ago, we did not think about the realities of how did monsters get there, we just created a dungeon and filled it with things to go boo. Now with this you think more about the ecology of how monsters and that river got there.<br /><br />If you ever agonize about what to make the 5th room look like, or create a dungeon at the 11th hour pick this book up. If sometimes you need inspiration, pick this book up, I saw no cons with this book and have thoroughly enjoyed using this resource.", "images": [], "asin": "099285136X", "parent_asin": "099285136X", "user_id": "AE7VSV6GYDVBDGARZCKPQ7NXO6EQ", "timestamp": 1434671625000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Ended up loving it!", "text": "The first page was a little hard for me to focus on but after that I was hooked. Jane builds excellent characters. The book had unexpected twists and hidden deeper meanings. I couldn't put it down once the plot was revealed. It made me smile, cry and it made me think about the life I'm living. Thank you Jane Smiley.", "images": [], "asin": "1400033837", "parent_asin": "1400033837", "user_id": "AESONQIBOGOIA2OR2OJP7U6453YQ", "timestamp": 1582151023915, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Buckle up", "text": "This is book #8 of the Gabriel Allon series, and at this point, the art restorer/spy/assassin feels an old and dear friend. He gets pulled out of retirement - again - and the story flows in a typical manner - various locations, murder and mayhem, a dash of history, a thrilling operation. Buckle up for a fun ride.", "images": [], "asin": "B003STCMQ0", "parent_asin": "B003STCMQ0", "user_id": "AGX5ACW4Q54YGQOIL5GYIDHBDXEA", "timestamp": 1318958280000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "!!!!!", "text": "Great book. My grandchildren love it", "images": [], "asin": "1406384933", "parent_asin": "1406384933", "user_id": "AF7BMCYF4PF6UFMPXQ6NSZZQEGVA", "timestamp": 1604091962990, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Wealth of Knowledge!", "text": "I loved the heart behind the message in this book.  The author is certainly knowledgeable about subject material.<br />The detox and some suggestions are challenging. All in all, I was very encouraged!", "images": [], "asin": "1401603726", "parent_asin": "1401603726", "user_id": "AESPTJDZBXKTTNIBXC4LQ5DKSUCQ", "timestamp": 1252001440000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "AMAZING BOOK!!!!!MUST READ!!!!!!!!!", "text": "I’m living proof of this book. So proud of my mommy I can’t believe she told my brother & I story to the world. It is such a beautiful story & I am so grateful for both my parents. I love them so much & they are the most amazing parents in the world. Being adopted I don’t care they are not my biological parents to me they are my real parents. I love this book", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/718lExbMyfL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/718lExbMyfL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/718lExbMyfL._SL256_.jpg"}], "asin": "1953596118", "parent_asin": "1953596118", "user_id": "AHTT32VLN4P2LMUNQEUZLLOLZR5A", "timestamp": 1620299347203, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Wonderful book", "text": "Wonderful book. Arrived in fine condition.", "images": [], "asin": "0060611758", "parent_asin": "0060611758", "user_id": "AEKBRJLOYX7HCXQY7IBUJKLNUJWA", "timestamp": 1434930401000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not bad.....slow read!", "text": "Not one of his best....lots of analyzing things in his head and from the past...the end had some good action but overall just average.", "images": [], "asin": "B07Z44FL56", "parent_asin": "B07Z44FL56", "user_id": "AG3ODS5FCFTFEB5OYXDDEO3PYFKQ", "timestamp": 1602958360656, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Wonderful Calendar", "text": "Well made and plenty of room in each day so you can plan and keep track of your life.  Lovely Collie on the front is a boon.  A must for the busy Collie fan in your life.", "images": [], "asin": "1790983770", "parent_asin": "1790983770", "user_id": "AFJKYGC7RKZRF7LFMQQBYM2D3TNQ", "timestamp": 1553107927483, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Love it!", "images": [], "asin": "1477820469", "parent_asin": "1477820469", "user_id": "AEU64KR4Y34JJOQWQP6D4NUPARFA", "timestamp": 1431456139000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Good, but could be better.", "text": "These work well with our homeschool curriculum, but the three levels have almost no difference between them. There should be more difference in difficulty imof comprehension questions.", "images": [], "asin": "1338284746", "parent_asin": "1338284746", "user_id": "AG44BXPGVPVDEBBF5MXYWEBVIC3Q", "timestamp": 1588746195619, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "... Julie Nutting doll stamps and this book gives some pretty good ideas and tips for using the stamps", "text": "I have recently discovered Julie Nutting doll stamps and this book gives some pretty good ideas and tips for using the stamps. I would definately recommend it.", "images": [], "asin": "1440308314", "parent_asin": "1440308314", "user_id": "AFQRKRCQV647ZNT3ZFWGA3AMTKDA", "timestamp": 1472698948000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Historical disappointment", "text": "I cannot stand this book.  The author's writing suggests that all that is left is good and all that is right is evil.  He rewrites the history of the fall of communism to try and show Bush and Reagan as fools, while conveniently skipping the Carter years. The Pillars of the Earth will always be one of my favorite books, but I am not sure I will ever read another Ken Follett book after this horrible experience.", "images": [], "asin": "0525953094", "parent_asin": "0525953094", "user_id": "AGMIEREZ2KFPYS6SK5AGLBUTHVHA", "timestamp": 1434930719000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "good book", "images": [], "asin": "1118120280", "parent_asin": "1118120280", "user_id": "AFLKIK6FFXXLBEIBKFGK723DYNDA", "timestamp": 1426359293000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great book!", "text": "A timeless classic. Although, hard to read without tearing up. 😉", "images": [], "asin": "0920668372", "parent_asin": "0920668372", "user_id": "AHOYA3XU34GF4C3B5F6RHEFK3H7A", "timestamp": 1517597900968, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "OUTSTANDING! Incredibly MOTIVATING!", "text": "Kelso does it again in this adaptation of Romeo and Juliet for young people! My sixth graders seized upon this book and mounted their own production in just 2 days with absolutely no adult assistance! The author knows just the right words to get kids motivated to read and perform this work. My entire class is now captivated by Shakespeare and wants to learn more about his work and life. Anyone who teaches young people can really use this book!", "images": [], "asin": "1439213526", "parent_asin": "1439213526", "user_id": "AEGU7VFNBETXFAH7BWM2NTKEHCSQ", "timestamp": 1244695074000, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "You must read A Candidate for Murder!!!", "text": "Wow what a page turner! And like her first book with these characters-- Inn Keeping with Murder it has an important social justice message. The writing is very witty and engaging. I hope she keeps this series going because I can't wait to hear what is next for these women!", "images": [], "asin": "0991245547", "parent_asin": "0991245547", "user_id": "AE6XLWYEZFQCUOBTXWOPJZMYQIRQ", "timestamp": 1457380244000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Not a let down", "text": "I cannot believe how amazing this was for me. Loved the time travel aspect and twist and turns. A book that I couldn't determine the outcome of. Great job Mr. Saul!", "images": [], "asin": "B00GJ2IHAS", "parent_asin": "B00GJ2IHAS", "user_id": "AHXCUQDRFF4627LWXX7O2YZWZFCA", "timestamp": 1466544918000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Nice but could've been handled better", "text": "Wow some of my beauty and the beast items have not been coming in the greatest condition. Nice book for my collection I'm working on. There was a big dent in the front of the book and a rip on the back. I guess I will still keep it.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71oHGWU5KOL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71oHGWU5KOL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71oHGWU5KOL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/812z1iTEzlL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/812z1iTEzlL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/812z1iTEzlL._SL256_.jpg"}], "asin": "148478099X", "parent_asin": "148478099X", "user_id": "AEYWW4JAIUWU7RUOHA6S4SMIZ4TQ", "timestamp": 1546101179595, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Amazing!", "images": [], "asin": "0985562226", "parent_asin": "0985562226", "user_id": "AELHZCKAA2KN4OWQ7VSD74OKNJ5Q", "timestamp": 1427066565000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "My daughter and I have a great time reading this", "text": "This book is hilarious! My daughter and I have a great time reading this. It makes us laugh and teaches grammar along the way.", "images": [], "asin": "0544087208", "parent_asin": "0544087208", "user_id": "AGSMX6WTBOQZAYDN3V4X6JXDJLYQ", "timestamp": 1531836683901, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Classic King!", "images": [], "asin": "B00GEEB52S", "parent_asin": "B00GEEB52S", "user_id": "AEJ6EWCMOQIPXP2Q7FUFBGBQZ6XA", "timestamp": 1433783198000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Greece", "text": "Beautiful pictures, but no captions or explanatory notes. If you have never been to Greece you will no idea where or how to follow up on any locations that interest you.", "images": [], "asin": "B00OPR6GKM", "parent_asin": "B00OPR6GKM", "user_id": "AGOVTC2A5FZMNL6CZA2ACZRHJQGA", "timestamp": 1437708735000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A+", "text": "Seldom am I surprised anymore at the twists and turns of a novel.  I was engrossed with the main character and sad because of her psyche breaking childhood.  Good job!", "images": [], "asin": "B07MQRGWXM", "parent_asin": "B07MQRGWXM", "user_id": "AGA4LLMTA2LB64ZRICYZWYEZ65DQ", "timestamp": 1583248217157, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Picoult is a good writer", "text": "Jodi writes good dialogue. It's believable and clever. It was a bit difficult getting acclimated,but once I knew what  Picoult was attempting to do I enjoyed myself and the book", "images": [], "asin": "1439102767", "parent_asin": "1439102767", "user_id": "AEV4RYKVUKD2UQBB3ZJVOC6GLROA", "timestamp": 1369230203000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Very helpful and informative.", "images": [], "asin": "1599635755", "parent_asin": "1599635755", "user_id": "AGPVIG2XKXOIZ3NVJRUHU3DNNBNQ", "timestamp": 1442289712000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Loved the story.Kept me on my toes all the way through the book", "images": [], "asin": "1400097460", "parent_asin": "1400097460", "user_id": "AFDWXWPB4OOV2YXLBTC6ZTH46TLQ", "timestamp": 1478370547000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "DONT GIVE UP!!!", "text": "I have not seen the movie \"A Clockwork Orange\" and at my 3rd attempt at reading the book, I finally finished. The lanuage is very hard to understand AT FIRST. Once you get more into the book, it starts to clear up. My message is this: Do not give up on reading it. Its GREAT.", "images": [], "asin": "0393312836", "parent_asin": "0393312836", "user_id": "AHN35HPGFLBDFUQ5JVA2GJNHZNIQ", "timestamp": 1136198097000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "I want a dog like Wrigley when I move into senior care hopefully much much later in life", "text": "Loved this book which detailed the life of Wrigley, a 4-legged canine caregiver at a home for senior adults (nursing home in my southern vernacular).  Told from the dog's point of view.  Highlights why I love dogs so much.  Treats the aged with dignity.  I highly recommend this book if you're a dog lover.", "images": [], "asin": "B00X6J4Q1G", "parent_asin": "B00X6J4Q1G", "user_id": "AE5LVJPQIJHCILWNYAGFZMK2YJCA", "timestamp": 1451789526000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Wonderful book!!!!", "text": "My 8 year old boy read this and immediately asked for more like this!  He loved these books.  They take the kids into the Middle Ages with three fictional kids from our time.  Plus they fill it with fun facts from that time period.  A great book, for learning and for fun reading!", "images": [], "asin": "1550745409", "parent_asin": "1550745409", "user_id": "AGCIRANMWVR35ZIRVGAXSHP3F2JQ", "timestamp": 1152113882000, "helpful_vote": 6, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "My favorite so far!!!!", "text": "I loved this book. It has been my favorite so far of the Silver Springs Series. The story was very well written.<br />In the story you are just never sure how if Ellie and Hudson will ever find each other. These books even though they are a series are stand alone books.", "images": [], "asin": "0778330257", "parent_asin": "0778330257", "user_id": "AHTIX5COKW5BGQKPUQMXBBP56QOQ", "timestamp": 1501007104448, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Bought as a gift for my wife and she loves it.", "text": "To keep it simple, I bought this as a gift for my wife who is an absolute Christmas junkie and starts planning the next Christmas somewhere just before Valentine's Day.  This book is very short, but it hits home with ladies that are like her and all the female \"Clark Griswald's\" of the world.  It's about overdoing Christmas and it struck a chord with her on almost every page.  I read through it, she read it, and she laughed a lot - I take that as a good sign.  I've also noticed most people who don't like this book are not from the south.  Surprise, if you're from Montana, you're probably not going to find this book very amusing.  Also, if you're not a chronic Christmas over-achiever, you're also probably not going to find this book very interesting.<br /><br />Not a bad little book at all and I'd recommend it for anyone with a wife who thinks she's Martha Stewart.  My only complaint, it is a brief read - one or two hours, tops, and you're done with this book - not very much text.", "images": [], "asin": "0060850531", "parent_asin": "0060850531", "user_id": "AEWQ4KU73U7GJ5SR7QTYB5TD6KYA", "timestamp": 1337030877000, "helpful_vote": 9, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Nice", "text": "This was bought for some friends that just got a new RV.  Good for them but first part is too focused on what to buy", "images": [], "asin": "1615641890", "parent_asin": "1615641890", "user_id": "AHVBR7PLELFQTTAT46FHOA62Q43Q", "timestamp": 1504120648822, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "One of the best books ever written and series developing", "text": "The first couple of pages into the book I thought this was just going to be one of those stories but what a twist, I was so surprised and thrilled with this book, that I grabbed off of my teachers shelf to borrow, that I stayed up all night reading it then bought the next one, silver eyes, online the next day, I've been waiting for the third book, angel eyes, and encouraging Nicole Luiken on Facebook to continue to write it, I can't wait! if you go on Facebook she posted a link to read the first two chapters of angel eyes for FREE its going to be fantastic!", "images": [], "asin": "0743400771", "parent_asin": "0743400771", "user_id": "AHSGQEO4NTRNN7RQGDQPBQ4LFFEQ", "timestamp": 1339730466000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 5.0, "title": "Nice condition", "text": "It's a good book. But I don't like it as a textbook, the words are too small and it's content is very lengthy. The book is in great condition though.", "images": [], "asin": "0321580028", "parent_asin": "0321580028", "user_id": "AFAOP7L3VWA3ORN3ULRBHP3LBC5A", "timestamp": 1319049101000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Irvine Welsh strikes again", "text": "if you like his books, you'll love this one!  almost everything i've read is great!  can't wait for the next book!", "images": [], "asin": "039333077X", "parent_asin": "039333077X", "user_id": "AF7WBQN4XB65M2PWZXWTXUXLBYGQ", "timestamp": 1361216510000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Great Book - Did not Like Oprah Notes", "text": "I loved the book.  Sue Monk Kidd's new book is almost as good as &#34;Bees&#34;.  I read the Kindle edition.  The Oprah comments are extremely annoying to me.  As I read a new book, I like to form my own conclusions and opinions.  With the Oprah underline and directions to read and return, I was continually reminded that this was just a book.  About the time I would lose myself in the text again, there was another Oprah comment.  I like Oprah.  I would like to have read her comments AT THE END of the book.  With my Kindle Paperwhite, I could only &#34;turn the page&#34; without reading the comments by very carefully touching the screen to turn the page--and when I did go to the comments, I did not always get back to where I had been.  I am giving the book 5 stars--a great story, beautifully told.  But I will never again buy one with notes from Oprah.", "images": [], "asin": "B00H58VGIA", "parent_asin": "B00H58VGIA", "user_id": "AEM6WK3JLSLEA7M33I6WWRRQUZBQ", "timestamp": 1391004459000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Fell short", "text": "I've had this book on my shelf for a while but never read it until now... I recently rewatched a couple of documentaries then the movie and I wanted to compare. There were a lot of inconsistencies across everything.  This book was clearly written for Azie for absolution and I hope he felt that he achieved that.<br /><br />I will give credit where credit is due and I believe others should do the same.  I don't think Azie did that. It seemed to me the he was taking more credit than I felt was due to him with the influence him, Rich, and Alpo had on EVERYTHING,  but then, that's just me.  There was an excessive amount of name-dropping in the book as well, from DJs, rappers, and singers to actors and music producers. Was that really necessary? Azie<br />boasted about the flashy, customized cars with the sound systems and wearing customized jewelry to match the cars, the money, and the flashy clothes,  then turned right around and said something about keeping a low profile... yeah, no...<br /><br />After watching the documentaries and the movie and reading the book, I have my thoughts and opinions about dude's role in the game and what would've happened hadn't certain other people not have gone to jail. It's his story though and he told it well enough.<br /><br />I had higher hopes but the book just fell short. Maybe my expectations shouldn't have been so high? I get that he wanted to write the book to tell about the ugly part of the game but I'm not so sure he accomplished that. It seemed to me to hype up his experience while telling what could happen if things go wrong... I felt it could have been better.", "images": [], "asin": "0743282310", "parent_asin": "0743282310", "user_id": "AGWZKOHRPTPLMXG4RFIHICAYJKLA", "timestamp": 1642465545884, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Only alright, much better of the Touch and Feel collection.", "text": "We have a lot of the Baby Touch and Feel books but this one gets a miss with my two little ones. Oddly balloons on the cover aren't inside as a first word. I only mention that because usually cover art is featured on a page inside, not that I miss it as a word for them, but the collection as a whole doesn't hold their attention as much as most of the other Touch and Feel books. Seems like random things just tossed in rather than any firsts for babies you'd think to put in. Would skip this one.", "images": [], "asin": "1465454713", "parent_asin": "1465454713", "user_id": "AH7Q3M5CZB5TFLKGDHEHZ5U6XS7Q", "timestamp": 1493212602000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Five star book. One star author editorial. Wish I could give it a five.", "text": "Great story that really captured my attention. Two different plots that tangled together nicely with some unexpected twists. However, when reading the author's view on the have's and have not's in the world and how every one \"deserves\" things just because they exist, I immediately became turned off and will not read or recommend this author. Entitlement is a HUGE problem in our society. No one deserves anything. If a person wants to go to college, that's great. Take out student loans like I did. And pay them back, like I did and shut up about it. I didn't expect someone to give me a free education just because I exist. I worked damn hard for it. Then I got a job that offered excellent benefits so I had great health care. Before then, my parents covered my through their great jobs that they worked hard to earn benefits through. No one DESERVES anything just because they exist. There is no such thing as \"free.\"  If you, Daniel, want people educated and insured, who do think is going to pay for that? The rich, you say? Because they \"deserve\" it?  Unfortunately it will be me, the middle class paying, not the rich. I already pay for other people's health care, while I have my own, so I guess I should now pay for their education, too. If someone wants to go to college, pay for it -- student loans are available -- or don't go. It's that easy. Unfortunately, our esteemed President has made it impossible to go without insurance, even if you're a man and don't need prenatal care -- according to law, you still must carry it. But get a job and EARN the benefit instead of being a leach on society and thinking it's DESERVED. I really enjoyed the book, but you ruined it with your \"debt free, free health\" nonsense. There is no free.", "images": [], "asin": "B00G2G13RU", "parent_asin": "B00G2G13RU", "user_id": "AENPXNR75YEHM4OYC4AZNWSYMA7Q", "timestamp": 1434088081000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Good Read", "images": [], "asin": "B01071REAA", "parent_asin": "B01071REAA", "user_id": "AH2ZMOJGD7ISIUMTY2FXDT55B7TA", "timestamp": 1463870868000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Another Marti McAlister book where she must juggle home life with murder.", "text": "Best so far.", "images": [], "asin": "0312968183", "parent_asin": "0312968183", "user_id": "AEAFDX2QRLUGLZOGTBVNIOMKOFMA", "timestamp": 1623969760509, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Good read", "text": "Sweet story.  Our five year old really likes it and asks for this story.  He loves the animals.", "images": [], "asin": "1484722841", "parent_asin": "1484722841", "user_id": "AF7U4M4TYOIYQB3W7B5C7SCF6PPQ", "timestamp": 1462320781000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Terrific Treatment of a Difficult and Complex Subject", "text": "I really said it all in the title to my review. This is an enormously useful book that opens the expansive (and still rapidly expanding) world of APIs to PHP programmers like myself. His writing is meticulously clear, the examples work (or at least get you nine-tenths of the way there), and the chapters on actual APIs (PayPal, eBay, FedEx, Google, etc.) are useful. Of course, I'd have loved even more chapters on still other APIs (there are so many), but you'll probably learn enough about Web APIs from these examples to tackle any not covered. Easy download access to the source code is also appreciated.<br /><br />I was personally less interested in the section on Web Feeds, but this is also well presented -- interestingly in context as a counterpart of Web APIs.<br /><br />One final word: To get the most out of this book, you need to be an intermediate level PHP programmer. (If you're not, I recommend \"PHP and MySQL Web Development\" by Welling and Thomson as a good way to get there -- particularly if you're interested in tapping the power of MySQL along with PHP.) But back to the book in hand: 5 stars with thanks to Mr Reinheimer.", "images": [], "asin": "0764589547", "parent_asin": "0764589547", "user_id": "AEN46BHUEJX7PPPXS3JJIDGI3IJQ", "timestamp": 1279258545000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Incredible", "text": "I purchased 2 of these for Christmas presents. One for my daugher (7) and one for my neice (10). They both LOVED them. The pictures are beautiful and inspiring. The women who wrote these words were truly inspired. An excellent book for any age.", "images": [], "asin": "157734880X", "parent_asin": "157734880X", "user_id": "AHWDBPGDQQT2R62TBO5CUZXOE4RQ", "timestamp": 1294525980000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "My honest assessment of the book.", "text": "Skill for Growing by Charles Dowding is a gardening book meant to help and teach the reader how to grow his own vegetables in the garden all year around. I liked how the author provided only the essential pieces of information without charging the book with useless words. I liked how it takes you from 0 to the final product so that you can find an answer to any question regarding your garden, from how to prepare the ground, the space needed between seeds and plants, the characteristics and proper time to plant each seed, how to grow strong seedlings, the rotation between vegetables, and many others. I also appreciated the visual support provided by all the pictures and tables that can be found in every chapter.", "images": [], "asin": "1916092047", "parent_asin": "1916092047", "user_id": "AEJV7ZJRGTGUBZKBUWBXWDFB427A", "timestamp": 1674928568456, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "One of the WORST Earp-Tombstone books ever written!", "text": "This book is an absolute disaster. I received an ARC of Clavin's latest \"study\" of Tombstone and while he alleges through his bibliography that he cited numerous credible sources in his research he clearly did not use the information to his advantage. Please, save your money on this error-filled book. It was lazily written and poorly executed. Among the true historians of Earp and Tombstone history, this will surely go down as one of the worst books ever written on the subject.", "images": [], "asin": "1250214580", "parent_asin": "1250214580", "user_id": "AGMS6ZZET46GBPUKYHYUGM7SK3AA", "timestamp": 1592225426433, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 5.0, "title": "Frist hand review of actual cases", "text": "I like the first hand review of cases because I was familiar with several of them, but not in the detail that the book furnishes.", "images": [], "asin": "1633635104", "parent_asin": "1633635104", "user_id": "AEBTGDBYNAUVNNVLCKJS74QOJMTQ", "timestamp": 1634327416685, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Love it", "text": "Kept me on my toes.", "images": [], "asin": "B07T81FH2K", "parent_asin": "B07T81FH2K", "user_id": "AFZGMVH5B7ASFRB43YH674ZV5YAA", "timestamp": 1593036619017, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A Fun Read", "text": "I enjoyed reading this and plan on reading it again. The protagonist takes a while to grow on you, but by the end of the book you are sorry to see it end.", "images": [], "asin": "B01I9FFDI6", "parent_asin": "B01I9FFDI6", "user_id": "AHVN4G23AGQRGYZMCBADHPS55V2A", "timestamp": 1488171439000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Real Story of Moby Dick", "text": "This book is an amazing read. Makes a subject that I could've cared less about (whaling) very interesting. Well written and exhaustively researched. The story in itself is an amazing tale of greed, pride, adventure, and tragedy. My copy came in fair condition, as promised, and within the delivery window I was given. A+ Bookseller. Would definitely purchase from them again!", "images": [], "asin": "0141001828", "parent_asin": "0141001828", "user_id": "AFRJZIVC45WKJ3XEALPDQBMCYXRQ", "timestamp": 1547189837844, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Bought this to help me learn French vocabulary and have found it very helpful.", "images": [], "asin": "0794502830", "parent_asin": "0794502830", "user_id": "AEJYQTNGWAWNRVD2K45VBJC7LGVA", "timestamp": 1507733499828, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great settings for this multi-generational quest for answers!", "text": "This author takes us on a journey that crosses and ocean and generations. The protagonist is the product of a rich family history and unanswered questions. In the process of trying to get answers she encounters some very dark characters in a remote and desolate place. Nice twists and turns to keep you reading towards an interesting resolution.", "images": [], "asin": "B008BU75D6", "parent_asin": "B008BU75D6", "user_id": "AGGK3UZJDD4CRHZ4DVUOISZXWQQA", "timestamp": 1459273653000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Had great info on each car.  Exactly what I needed.", "images": [], "asin": "B00RIKLHJI", "parent_asin": "B00RIKLHJI", "user_id": "AFXN55TX2ZTPLZXP4EVZMTSKJE5A", "timestamp": 1426443646000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "THEY TOO WERE AMERICANS: THE GERMAN-AMERICAN BUND IN WORDS, PHOTOS,AND ARTIFACTS", "text": "THEY TOO WERE AMERICANS: THE GERMAN-AMERICANS BUND IN WORDS, PHOTOS, AND<br />  ARTIFACTS<br />SCOTT FREELAND<br />R. JAMES BENDER PUBLISHING, 2011<br />HARDCOVER, $66.95, 320 PAGES, PHOTOGRAPHS, BIBLIOGRAPHY, ACRONYMS, TERMS<br /><br />The 1930's proved to be a fertile time for demagogues and radical movements to appear in the United States, whether on the left or the right of the political spectrum. Huey Long combined populism with quasi-dictatorial rule in Louisiana while Father Charles R. Coughlin broadcast a popular national radio program blending religion, economics, and politics, lacing it with ever-increasing amounts of anti-Semitism. With mainstream strands of anti-Semitism, popularity of the KKK and worsening economic conditions in the Great Depression, German-American ultra-nationalism provided a voice for thousands in America. This was another side to the \"melting pot\" theory by demonstrating how two different traditions converged in the United States with immigrant families offering new ideas to their local communities. These ideas also united other groups, such as German fascists in Long Island holding rallies with Italian fascists under the American flag. Indeed, the United States didn't escape public displays supporting fascism and the terrain served as grounds for different groups to \"melt\" their ideology together.<br /><br />The German-American Bund boasted in the late 1930s, that it had 250,000 members in 42 states-patriotic Americans all, dedicated to the democratic principles of the United States. Many of its leaders and members were sincere not only in their personal convictions but also in the best interests of their country-the United States. Yes, there were some who had negative attitudes towards Jews and other minorities but then so did the majority of Americans at that time. The author has unearthed that some Bund chapters had working relationships with Hispanic and other minority groups and even had some Jews as members. Yes, they flew the swastika because it was central to their racial identity.<br /><br />Discovering how the local Bund blended fascism and democracy has been made difficult by local hesitations to revisit a negative chapter of the past. This is further compounded when people seek to hide history. One notable example was in 1995 when Suffolk County, New York legislators passed a resolution, sponsored by Herb David (R-Yaphank), \"for the removal of pro-Nazi references on the subdivision records\" from original documents. This proposed re-writing of history on the original records failed since it wasn't approved by the state government. Despite these obstacles, this new book, THEY TOO WERE AMERICANS: THE GERMAN-AMERICAN BUND IN WORDS, PHOTOS, AND ARTIFACTS sheds a whole new light on an often neglected part of local and national history in order to paint a more accurate view of history prior to the U.S. entry into World War II.<br /><br />Author Scott Freeland skillfully uses primary documents to sketch a history of the Bundists as they might have viewed themselves as well as to be more understanding of the German-American Bund members place and time in the history of this country. His book (published by the well-known and respected R. James Bender) is a very detailed and well-written account with excellant photographs accompanying the text. As one reads this book, you are impressed with both the dedication and knowledge the author has managed to put together on a subject that has been not only overlooked but much misunderstood in our nation's history.<br /><br />Lt. Colonel Robert A. Lynn, Florida Guard<br />Orlando, Florida", "images": [], "asin": "1932970193", "parent_asin": "1932970193", "user_id": "AHITRKESSQHVMSXBITHR6KKS2RAQ", "timestamp": 1346003726000, "helpful_vote": 6, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Excellent Introduction to Container Gardening!", "text": "I'm new to gardening in any form, and I'm starting with containers. So far, I have bought containers. 🎉 I tried last year to grow tomatoes (one late frost took then all out), and strawberries (they migrated to other pots and took over but didn't yield much fruit). I had no idea what I was doing! I'm so happy to have this beautiful, comprehensive guide to growing food in container gardens!<br /><br />I love the organization of this book as well as the overall tone and style. This begins with explaining why container gardening has became important in our times and then moves on to detail how to prepare and gather the materials to be successful. This book never talks down to beginners like me, but it fills in the gaps between buy seeds... Then harvest. That's a big gap, and I love the way this book takes the reader through the process.<br /><br />I feel much more confident as spring approaches that I will be able to successfully grow food in my container garden. This book provides a wealth of information on overall strategies as well as particular techniques to use with different herbs, fruits, edible flowers, and vegetables. If you're looking to grow a successful container garden, this book is for you! Highly recommend!", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/7110p9wh9PL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/7110p9wh9PL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/7110p9wh9PL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81GtyY9458L._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81GtyY9458L._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81GtyY9458L._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81MfWMt2mIL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81MfWMt2mIL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81MfWMt2mIL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/81rgw7h0ZHL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/81rgw7h0ZHL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/81rgw7h0ZHL._SL256_.jpg"}], "asin": "0785255761", "parent_asin": "0785255761", "user_id": "AF2Q5KJADNUQJKAAOUH4FOLAIIQA", "timestamp": 1677207560005, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A wee bit of Irish lore, a whole lot of swoon", "text": "This story is a pinch of Irish lore, a whole lot of heat, action,and soul mate love.<br />Listen to the audio book to be completely ducked into the story", "images": [], "asin": "B0BCHJRHTC", "parent_asin": "B0BCHJRHTC", "user_id": "AECRE7C2XF4OAISJOD7NYALOHUYQ", "timestamp": 1673216674657, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Fun Calendar", "text": "My mother was born and lived in Italy until she was 14 when they moved to America.  She is now 101 and this calendar allows her to continue to read in Italian.  She can also write and speak in Italian.  Plus, she loves reading it out loud and then translating it to me.", "images": [], "asin": "1524873314", "parent_asin": "1524873314", "user_id": "AHMOVE6B7CAFVHHNMGNLWAHHCWBA", "timestamp": 1678145880566, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Enjoy beekeeping", "text": "My bee keeper husband found it informative and humorous. I’ll read it next.", "images": [], "asin": "1615190325", "parent_asin": "1615190325", "user_id": "AHH5VRMCWD5OXYYX2DHIGJ5XQ3MQ", "timestamp": 1573423683663, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Perfectly Perfect!", "text": "Jane Porter knocked this one out of the park. Absolutely fantastic in every way. Emotional- I cried tears and I laughed out loud. Being nearly 50, it's nice to read about love from a later in life perspective. Andi and Wolf were so real and raw and this story hit me in all the right places and kept me turning pages long past bedtime. I will read this one again...and again.", "images": [], "asin": "059343840X", "parent_asin": "059343840X", "user_id": "AGB2RA3ARWDJWQFB35RX43D76CFA", "timestamp": 1669778738331, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "I have enjoyed learning many new things about how to charge and ...", "text": "Some crystals not listed, but  am sure are in the following works. I have enjoyed learning many new things about how to charge and meditate with my crystals.", "images": [], "asin": "1582972400", "parent_asin": "1582972400", "user_id": "AFHEJMTP6Q2JFI6JWPWJ5SUPX43Q", "timestamp": 1467706127000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good book", "text": "I would like to have seen more depth in the book, perhaps more detail on what the operation consisted of.  It may even be that as a combat veteran in Vietnam, some of it brought back similar memories.", "images": [], "asin": "0062238868", "parent_asin": "0062238868", "user_id": "AF552TZRQJ3RL5CXOHZI64FOSK4Q", "timestamp": 1364133140000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great", "text": "Great for kids lots of ideas", "images": [], "asin": "1465417273", "parent_asin": "1465417273", "user_id": "AEWAHYZQSU5HYAFTBMUSUGB26CVQ", "timestamp": 1571590393147, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Five Stars", "text": "k", "images": [], "asin": "0879385189", "parent_asin": "0879385189", "user_id": "AG3T7SS7MOU5VFLYCQOUTL7RTA3A", "timestamp": 1443147850000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "We are very pleased with the book and the bookstore that sent it ...", "text": "We are very pleased with the book and the bookstore that sent it to us. Thanks. Tom and Michelle Westmoreland", "images": [], "asin": "1936493969", "parent_asin": "1936493969", "user_id": "AEDCKI45W5PY5D7GH5EGL4ORVP7Q", "timestamp": 1429222995000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Game", "text": "This game is so much fun. I am a college student and this game is super fun to play on a night in. Makes you think and have a good time while bonding with your friends.", "images": [], "asin": "0913866687", "parent_asin": "0913866687", "user_id": "AH4OM26CRMMP4ZR7SMLFUMWYH4JQ", "timestamp": 1362162981000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "An excellent book on a subject about which I have always been curious.  Very readable.", "images": [], "asin": "0465030750", "parent_asin": "0465030750", "user_id": "AFOKQW7P4FWXJZDTLIYD4KCOMZVA", "timestamp": 1425235040000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Beautiful Book and fun to color", "images": [], "asin": "1540503364", "parent_asin": "1540503364", "user_id": "AFZJXI66VF436IB4F3TJPQXTFFVQ", "timestamp": 1488216453000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Twists and Turns", "text": "What isn't there to like?  It kept me focused but never once did I see what might be coming.  A good read.", "images": [], "asin": "B00U6DNZOY", "parent_asin": "B00U6DNZOY", "user_id": "AE3Z2ECAHBYWFC3KX4WD335BRXXQ", "timestamp": 1451017069000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Really good read!!", "text": "Fast paced, holds your attention.", "images": [], "asin": "1250064708", "parent_asin": "1250064708", "user_id": "AGPAE6CNSUWWZSVWEBDIRZNM6VCA", "timestamp": 1626199275864, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Ok", "text": "Ok I guess", "images": [], "asin": "1894953738", "parent_asin": "1894953738", "user_id": "AEEZOJZPONRF7RCD7VURUKL2I5IQ", "timestamp": 1490188596000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Met my expectations. Put in book bags for Elementary ...", "text": "Met my expectations. Put in book bags for Elementary  children. They fitted right inside of their notebooks. I will purchase again.", "images": [], "asin": "1596950560", "parent_asin": "1596950560", "user_id": "AFD6OKDCBWD6M63E656XOEZ5QQKA", "timestamp": 1411462235000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "This is an amazing, wonderful book", "text": "As someone who think a lot about habits - and how they strengthen families, make children more resilient and happier, and give our lives deeper meaning - I can say, with absolute conviction, that this is one of my favorite books. Jenny Rosenstrach is a gifted writer, a warm and encouraging chef and, to anyone reading, the friend whom knows more about how I should live than I do myself. Buy this book.", "images": [], "asin": "0804176302", "parent_asin": "0804176302", "user_id": "AHNESDL32YASDWFQDABGBHFE3ZFQ", "timestamp": 1475167554000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Very cute but arrived dirty and damaged", "text": "Very cute item but arrived dirty and damaged.  Pages damaged, cover filthy, binding squashed.", "images": [], "asin": "1839646942", "parent_asin": "1839646942", "user_id": "AGXNHOSK6CEQHQVVZZUURZCBXIVQ", "timestamp": 1640398932185, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Awful look and find", "text": "This is a terrible look and find. Parents, don’t buy this unless you want to spend 30 minutes looking for slightly different brachiosaurus. Awful.", "images": [], "asin": "1503737519", "parent_asin": "1503737519", "user_id": "AFNP52LABMS24CLAXB6GGKSD7X5Q", "timestamp": 1593011707807, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Read to understand FLASHPOINT", "text": "Came packaged well and sealed in plastic.", "images": [], "asin": "1401270727", "parent_asin": "1401270727", "user_id": "AHRW5QI36I3Y6C6PQUI2QRBMTH5A", "timestamp": 1613411372790, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Quality", "text": "This is a great book for babies and toddlers who are learning to identify items and learning to talk. Started reading this book to my 6 month old son. He is now 1 and this is one of his favorite books. The bright colors on each page and simplicity is what makes this book great. I definitely recommend this book to families with little ones.", "images": [], "asin": "1846109574", "parent_asin": "1846109574", "user_id": "AGMIMKAVZBLKBZL5NBEVH3IGJ6ZQ", "timestamp": 1486347960000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Best gift", "text": "Best gift I've ever gotten.<br />A book for basically every bed time. All the classics", "images": [], "asin": "1838528598", "parent_asin": "1838528598", "user_id": "AGLANUUPV5IU6ZTBV4SCISQANJSA", "timestamp": 1579722053418, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Humor with a dose of truth", "text": "Tails Don't Lie not only shows the humor in our pets, but tweaks our conscience every now and then with a look into the deeper truths of dog/human relationships.  I really love this book.", "images": [], "asin": "1550175998", "parent_asin": "1550175998", "user_id": "AF3TWRDQQKFDAVXLRA3GMZWUHIYQ", "timestamp": 1390910213000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "i'm not a gardener but i can be one now!", "text": "this prepared me for he coming spring season. my backyard is literally 10x10. tht doesn't mean i can't grow anything in it. mi have pots ready for a lemon tree, tomates, chilis, peppers, and herbs.  every bit counts when it comes to growing your on food, right!", "images": [], "asin": "1603421386", "parent_asin": "1603421386", "user_id": "AEHKX35R3XMJFUKYS3EUYMGHXU5A", "timestamp": 1380749431000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Good job!!!", "images": [], "asin": "0133830853", "parent_asin": "0133830853", "user_id": "AGS2D5H5XIYYYHWRTHG4Y2SELEJQ", "timestamp": 1441676489000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "MORE HILARITY AT WORK THAN ALLOWED....", "text": "PLEASE write a Part 2!! We have rationed ourselves to one a week we do as a group at work...we will run out soon - but they are hilarious!!", "images": [], "asin": "0843182660", "parent_asin": "0843182660", "user_id": "AGB62FSLUDUW55EVOMMRVBQR3L6Q", "timestamp": 1432449793000, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "This is a much needed book. Dreamweaver changed directions with CC and bootstrap.", "images": [], "asin": "0134309995", "parent_asin": "0134309995", "user_id": "AFSG3IBR6K7PBDJ2SI4EEH5CNHFA", "timestamp": 1454508220000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Relaxing into a better life is possible.", "text": "A very unique read. An absolute vibe. In our current culture to come into this relaxed form of eating is rare. In fact I've not met anyone my age that is into the artful slow style of fine dining. The book can get a bit slow and really hard to read at times as it goes into a vast series of topics but the vibe is really awesome.", "images": [], "asin": "1594770603", "parent_asin": "1594770603", "user_id": "AFQPXJSHLWDQC5J67MKENIBWXEYQ", "timestamp": 1571853484924, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Story captivated me from start to finish", "text": "A Jew was inside a German camp during WWII and experienced monstrosities in a more secret part of the camp.<br />His Nazi guard with in the secret section, looked startling like this particular prisoner.  The guard took this one prisoner as his &#34;favorite&#34; but forced him to kill fellow Jews just to survive.<br />No one incarcerated w/in the secret cell had gotten out alive except for this one Jew's impromptu cunningness.<br />Many years later, after the war ended the Nazi guard was hiding in England to avoid being prosecuted as a Nazi.  Thinking the Jew was dead and buried in the trench w/scores of others at the camp, and, since he looked so alike the victim, he was able to pose as the Jew prisoner, taking on the Jew's name, and identity.<br />The victim Jew, also, was living in England under another name.  Due to several murders of Jews in England, the two men were suspects of being the murderer.<br />Each man claimed to be the same man.  A trial was held to determine who was whom.....<br />Many twists within the tale.  I recommend reading this story.", "images": [], "asin": "B00DNL6XRC", "parent_asin": "B00DNL6XRC", "user_id": "AG2QBESX4SZQ6EXHTM7MJONE7SJA", "timestamp": 1403478324000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A classic for my daughter.", "text": "I have a 9 month old and am collecting classic story books for her to enjoy.  I love reading it to her, but I can't wait to hear her read it for herself!  This book should be in every childs collection.", "images": [], "asin": "0060254920", "parent_asin": "0060254920", "user_id": "AHY4HHKLQWS72OJFNDTMU3MA7NLA", "timestamp": 1264032855000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "It was great for it", "text": "This book was bought for a class I took in College. It was great for it, and it was a good book to study with. The definitions and information in this book are golden!", "images": [], "asin": "B004RVCOLG", "parent_asin": "B004RVCOLG", "user_id": "AESDQOR55YI56YIEQKTWHV7TCISQ", "timestamp": 1458755551000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "great read-listen", "text": "James Michner stories never disappoint!", "images": [], "asin": "B011LXZ0CW", "parent_asin": "B011LXZ0CW", "user_id": "AFL6NOVVFI7LGFOAN6HEYSY6S4VA", "timestamp": 1534252035698, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "I knew the book already - it is lovely!", "images": [], "asin": "0870703412", "parent_asin": "0870703412", "user_id": "AGC2FULXHYIVEBAP2GXE4KCGG24A", "timestamp": 1434321190000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Sci-Fi of value", "text": "This isn't just your average piece of fluff fiction. This excellent read has quick pacing and teaches great values without coming off preachy. I highly recommend this novel and its extremely likeable characters.", "images": [], "asin": "1599928485", "parent_asin": "1599928485", "user_id": "AEDTS27JZNPH6HPCQEAZLR3NTILA", "timestamp": 1331832126000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Good book!", "text": "Good book, patterns are really nice. I am making all the patterns, for a friend. I am on the third pattern, find them easy to read and am using the yarn suggested. I haven't found any errors so far, so am glad about that .", "images": [], "asin": "0578124688", "parent_asin": "0578124688", "user_id": "AGVMGNILKMX76JETF45CRHX46GNA", "timestamp": 1422061127000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Very good", "text": "She is a very distant Relative of our Family,  including me, so I was delighted to find the book....So I am a happy person..", "images": [], "asin": "0870043684", "parent_asin": "0870043684", "user_id": "AF3BQGP7WDYIIZAYLIDG6B5HMLAA", "timestamp": 1355773684000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Definitely a must read for all historical fiction lovers.", "text": "“When a man is denied the right to live the life he believes in, he has no choice but to become an outlaw.”<br /><br />----Nelson Mandela<br /><br />Lucy Cruickshanks, an English author, has penned yet another enticing and poignant tale, The Road to Rangoon that is set across the beautiful yet sad land of Burma which is centered around three characters whose lives are entwined and engulfed in the clutches of the civil war against the Burmese Military Armed Forces, officially known as Tatmadaw.<br /><br />Synopsis:<br /><br />In 1980s Burma, the British ambassador’s son goes missing.<br /><br />Discovering himself in the north of the country, Michael Atwood is in imminent danger, trapped between sides fighting a bitter civil war and with no way back to Rangoon. His best hope of salvation is to trust Thuza, a ruby smuggler who offers to help him escape.<br /><br />Beautiful and deeply scarred, Thuza has spent her entire life in a frontier town between rebel and government forces, never choosing a side but trying to make a living from both. For Thuza, the ambassador’s son is her ticket out of poverty. For Than, an ambitious military officer, exploiting those caught in the war offers an opportunity for promotion and distinction.<br /><br />But as all three learn to their cost, in this enigmatic and savage country, everyone has a price.<br /><br />From the heart of Burma’s exotic Rubyland comes an emotional thriller, as three lives are thrown together by the desperate choices they make to survive in a country gripped by civil war: a tale of ambition, salvation and hope that confirms Lucy Cruickshanks as a master storyteller.<br /><br />Michael Atwood, the son of a British Ambassador in Burma goes missing and soon he realizes that he is caught in the war from both the sides and the power they holds on his capture is invaluable, that is when he needs to trust the only person who can help him to rescue from the grips of the rebels.<br /><br />Thuza, the local Burmese girl, is a ruby smuggler, who knows her job well like the back of her hand, on how to differentiate ruby from the rocks, as it is the only salvation to buy her parents' freedom from the right officials.<br /><br />Than, works and abides by the strict rules of the Tatmadaw army, is soon tested on his loyalty towards the Army, and he is forever desperate to climb the ladders of success by pleasing the General. Things change when he forces his son, Min, to join the forces and to take strict measures against those who wrong by the Armed Forces.<br /><br />These three lives in Burma, now known as Myanmar, will break the hearts of the readers as their lives unfold and when their fate plays a major role to bring them together under dire circumstances.<br /><br />The author has once again delivered a spectacular tale of love, freedom and loyalty towards one own government set against the back of another country from the far east- Burma, which harbors a difficult era in Burmese history, which not only torn apart the lives of the common man, but which made it impossible to survive under the dominance of the Tatmadaw army.<br /><br />The author has evocatively captured the time frame as well as the location with her eloquent words. The background of Burma is dominated by lush and dense green forests and the tombs of the many Buddhist temples and that the author has vividly captured in her story line. The land where beauty of mother nature and repressive army plays a major role, is well painted into the canvas of the story as the author strikingly captures the culture, the local dialect and the grief of the citizens through her story. The author has done her research quite well with the ways how to find a ruby among the rocks, where to find it, and also the governance of the army and their torture among common people.<br /><br />The author's writing style is spell-binding that I lost track of time as I devoured the novel in just one sitting. The book is highly addictive as articulate narrative shifts from one character to another. The pacing is really fast, despite the fact that the author has written the scenes descriptively, that made it easier for me to picture the events right in front of my eyes. The story is engrossing and kept me glued till the very end. The author has penned with so much deep, moving emotions and it definitely felt like she has poured all her best emotions into it.<br /><br />The characters are drawn with realism and simplicity. The challenges thrown on their track made me rooting for them. All the three characters are inspiring and sad laced with grief and their demeanor is something to watch out for when they are caught in the politics and the war with the government and they are bound to leave an impression long after the end of this powerful historical fiction. The story has a complex and nostalgic ending that definitely moved me. The supporting characters are highly well-developed.<br /><br />Overall the story is enthralling, thought-provoking and thoroughly gripping till the end set against the back drop of Burma in the late 20th century.", "images": [], "asin": "1782063455", "parent_asin": "1782063455", "user_id": "AETUBLKBW5GFAPS4CXF574L55DQA", "timestamp": 1460301529000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 4.0, "title": "Great calendar, just small errors with names", "text": "Fantastic calendar!! Only took off 1 star because of the obvious errors on names for CASSIDY (not that previous name that shall not be mentioned, this mistake earned the deduction of a full star) and Mei. Unless, like the previous reviewer stated, we’re meeting her secret twin Mel in OW2. Lol! Otherwise, the calendar is well made and the graphics are awesome. I also love that holidays from all around the world are listed. Will definitely use this all year long 😉", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71RYOEiC82L._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71RYOEiC82L._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71RYOEiC82L._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71zVIny2qML._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71zVIny2qML._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71zVIny2qML._SL256_.jpg"}], "asin": "1975442008", "parent_asin": "1975442008", "user_id": "AH3TUPBR2EM3LDYEZHYLJM74BXYQ", "timestamp": 1641680208804, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "I only wish this Pas de Deux was Longer!", "text": "I am again blown away by this talented author!  I loved 'seating arrangements' and am happy to report that ms. shipstead is not a one-hit wonder! 'astonish me' is a wonderful book that will have you wanting to watch movies such as 'the turning point' and 'white nights' and of course 'black swan'.  while this book isn't as broad as 'seating arrangements' - and that's my only complaint that this book is too short!!! - it's an intense story of the ballet world, and also a family drama and a love story...ms. shipstead is becoming one of my favorite authors with her deft story telling ability and wonderfully drawn characters...", "images": [], "asin": "0307962903", "parent_asin": "0307962903", "user_id": "AGGMVW6UXAV3HPYQSWAPSGEMH25A", "timestamp": 1400426604000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Prejudice", "text": "To Kill a Mockingbird contains criticism of the prejudice and moral laziness that allowed Southern society to have a double standard of  justice. The novel also presents a somewhat optimistic view of white  Southerners that was somewhat unusual at the time the novel appeared. The  story indicates there are good human beings like Atticus Finch everywhere,  even in the midst of a corrupt society. Even those who do wrong, the novel  goes on to suggest, often act out of ignorance and weakness rather than a  deliberate impulse to hurt others.<br />Another theme of the novel is the  transition from innocence to experience. At the beginning of the story  Scout's world is limited to the boundaries of her immediate neighborhood.  She feels safe and secure, and totally confident that the way things are  done in her home is not just the right way, but the only way. The arrival  of Dill, who comes from a broken home and has lived in another state, gives  Scout her first hint of a variety of experiences beyond her narrow  horizons. Then, on her first day of school, she begins to discover that not  everyone agrees that the way things are done in Maycomb, Alabama, is  necessarily correct. She also learns that sometimes it is necessary to  compromise in order to get along. Even though Scout's teacher's ideas about  how to teach reading may be wrong, Scout must respect the teacher's  authority. Her own father advises her to ignore the teacher's ban on  reading at home, but to pretend to go along with the teacher's methods  while in the classroom. This kind of social hypocrisy is new to Scout, and  she is surprised to hear her very moral father advocating it.<br />Related to  the theme of innocence and experience is the novel's suggestion that  innocent children can often see large moral issues more clearly than  adults. Scout, Jem, and Dill never waver in their horror at the injustice  done to Tom Robinson. The adults in the story, however, see all the  complexities of the situation to the point of being blinded to the central  issue of right and wrong. However much Scout may grow through her exposure  to new experiences, one hopes that she will never lose her childlike  undertaking of justice. In the view of this novel's author, justice is a  simple concept. To recognize the difference between justice and injustice  does not take any special degree of wisdom or sophistication. In fact, the  learned members of the community--such as the judge and prosecutor--and the  proudly religious Baptists who are spectators at the trial are, willingly  or not, allied with the machinery of injustice.", "images": [], "asin": "0446310786", "parent_asin": "0446310786", "user_id": "AHU3DFXHWWRCNVHNIBDAWF5M3UFQ", "timestamp": 966759867000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Even Better Than The First", "text": "Enthralling mystery that keeps you in suspense right up until the end, and even more suspenseful than the first in the series.", "images": [], "asin": "B00VXPW6IU", "parent_asin": "B00VXPW6IU", "user_id": "AGN255MSZ2LACDTTUMEWE47ZR7MQ", "timestamp": 1565748413692, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Reading, thinking, & reflecting all in one!!", "text": "Love the think/relate aspect. I’m able to write my own reflection as I go. Being able to do so makes it more meaningful to me. I also feel as if I can hold myself accountable for my next steps upon reflecting.", "images": [], "asin": "1704124921", "parent_asin": "1704124921", "user_id": "AFKGDVEMSMGWBODDX22WFZDPKDBQ", "timestamp": 1575254143804, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "A good scare but not too scary!", "text": "The novel takes you back to Victorian times, with its fascination for Egyptology and mysticism. Good story and well told, in a language that captures the turn of the century to the 1900. Not too heavy, though.<br />A good read!", "images": [], "asin": "B079SCSXSM", "parent_asin": "B079SCSXSM", "user_id": "AH4ERMALGGHU2IIPSQ3LBRW4WJKQ", "timestamp": 1609267525217, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The best book ever.", "text": "I love this book , it is very cute and colorful. I read this book to my sister and she loved it. Now I can't get her to read anything else! Barbara Miller you are amazing author and I have to say you have taste in making wonderful story's .", "images": [], "asin": "B007K81D60", "parent_asin": "B007K81D60", "user_id": "AEI6DX7HPW6JC33PY4TZIMVSLTGA", "timestamp": 1433182411000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Well written book", "text": "Good read. The ending is not what you would expect and the book goes from one plot to another smoothly.", "images": [], "asin": "B00M2INCN0", "parent_asin": "B00M2INCN0", "user_id": "AEE7EWTE3KBXAV7QSGRPHZGVTVYQ", "timestamp": 1428804676000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Alice?", "text": "Since everyone knows the story, I love the twist this story has. I love the characters and the situations poor boy gets into. Can't wait to read the next one!", "images": [], "asin": "0316250953", "parent_asin": "0316250953", "user_id": "AECG4MLA7PSMFRRGDHS5XE6DGCSA", "timestamp": 1396184054000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "❣", "text": "We love this book.", "images": [], "asin": "1338789627", "parent_asin": "1338789627", "user_id": "AHJ3NIL3EENCD4GHXERP33WOZUGA", "timestamp": 1677246997349, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Steamy and adventurous novel", "text": "Another great novel by Madeline Hunter!  This story is the 2nd in the Wicked trilogy about three brothers.  It is a very steamy and adventurous novel.  Although it seemed to start off a little slow to me, soon caught fire and I couldn't put it down!  I like how we learn more about all three brothers in this book.  I think I'm going to really like reading the Duke's story!<br /><br />In this story, Ives, the younger brother of a Duke, is a lawyer, and is asked by a Padua to defend her father at trial.  However he has already been requested by the Prince Regent to prosecute the case. Ives looks into the case further, and finds there is more involved than it appears, and because he is drawn to her, decides to delve further into the truth behind the accusations.<br /><br />I liked the character development, and the chemistry between the characters.  I like how we can learn to love a character for the very attributes that seem to keep us from liking them at first!", "images": [], "asin": "0515155179", "parent_asin": "0515155179", "user_id": "AGAEC7W4NEQGQSRERMWQQDG7PS5Q", "timestamp": 1444157764000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "wonderful, wonderful, wonderful, thank you", "images": [], "asin": "0984392742", "parent_asin": "0984392742", "user_id": "AFOQRNN4OIQNU4N4DGTVNMMD6MEA", "timestamp": 1442704566000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "An appalling book", "text": "The thesis of this book is that the South lost the War because of insufficient nationalism.  To call this argument preposterous is to be kind.  Out of a white population of nine million the South lost a quarter of a million dead and many times that number in wounded.  The South kept fighting until every Southern city was controlled by the Union.  A small agrarian nation, the South fought a large, industrialized nascent world power.  Unbelievably the South came close to winning this unequal contest.  To contend that the South failed because of lack of will is ahistoric and a contemptible insult to the brave rebels who fell under the stars and bars.  A better judge of Southern will during that war was General Grant who, while attacking the Southern cause, admitted that never had men fought harder for a cause than the Southerners.", "images": [], "asin": "0820313963", "parent_asin": "0820313963", "user_id": "AGMMXYPHZK3C2FHAIQJWJOIDB2RQ", "timestamp": 1017619109000, "helpful_vote": 13, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great book. Clearly a lot of time and effort went into this novel.", "images": [], "asin": "1541048601", "parent_asin": "1541048601", "user_id": "AHIXXDF7YYWRW3PH3VZ44DD3IPBA", "timestamp": 1502846953151, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Six Stars.....", "text": "The best fiction book I've read in many months.<br />And I'm fussy.", "images": [], "asin": "0374175624", "parent_asin": "0374175624", "user_id": "AHTFYQCUJJ27HY7UA5TUSKMVIFGQ", "timestamp": 1407780758000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "If you liked the movie then reading this book is a must", "text": "I had the movie and book related to it. I bought this thinking I would find new information and it's is truly full of choice info on Nam<br />  I feel it is a great piece for anyone interested about Nam.<br />  I served in The Nam 1967/68 , with the Big Red One , First Infantry Division,. 1st/4th Calvary and was in the first Tet in 1968<br /> I was a M-60 gunner on a Armored personnel Carrier and there is no BS in the book.<br />It's the real deal<br /> Also a very good and intesting book to read, Hard to put down and regretted it when I came to the end.<br /> Hal Nailed it again as he did with his other book and movie", "images": [], "asin": "0679411585", "parent_asin": "0679411585", "user_id": "AHE4MN47SXGRIWSLWTJJPTS42CAQ", "timestamp": 1360188861000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Medieval Fantasy", "text": "This fantasy has a strong medieval feel with a dash of Fullmetal Alchemist.", "images": [], "asin": "0765395959", "parent_asin": "0765395959", "user_id": "AEWNWMIJ4OT3QP2TB5N52CIXMDUQ", "timestamp": 1523075297746, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Best ever sounds silly, but this book was really, really good!", "text": "Following Bull Mountain, this book brings together a lot of loose ends. Read it, read it soon, and don't ever go visiting north Georgia! Seriously.", "images": [], "asin": "B07J4WBB81", "parent_asin": "B07J4WBB81", "user_id": "AF45T3ABXYCW4IRPMBYN2A6O6FOQ", "timestamp": 1633979769203, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great story, pulled me immediately!", "text": "I was.literally hooked.within the first.few.pages and then sacrificed sleep to continue reading. I enjoyed the intriquses woven throughout of the murder mystery while beginning to cheer on the heroine created as Katie Freeman.", "images": [], "asin": "B00Q5OGJ46", "parent_asin": "B00Q5OGJ46", "user_id": "AHFG6UJIUHFH6P7QTWWMWA5D3WDA", "timestamp": 1596851398284, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The love is evident on every page…both for his wife and St. Martin", "text": "To say that I devoured this book would be an understatement.  I downloaded the Kindle version and read it while laying outside on my porch, all cozied up on the loveseat.  Many times, I was crying or laughing.  What a four-hour journey.<br /><br />From the beginning backstory of Shanie’s fight with cancer you become keenly aware of the love this man has for his wife.  To say that Billy pays attention to detail is putting it mildly! This writer can recall and describe things that make you feel as if you were there seeing what he sees.<br /><br />When he wrote, “She is sporting a black sun hat, black mini dress and black flip flops.  Her smile and sheer enjoyment of her life during this café stop seems to emanate out of her soul.”….I was a goner.  I knew they were kindred spirits to my love of the island of Sint Maarten/St. Martin.<br />That is exactly how I feel after my plane touches down each and every visit.  I am relaxed.  I am at home.  Having visited SXM two to three times a year for over 27 years I know her well.  My heart hurts for what Irma did to so many people and good friends.<br /><br />Given that this was Billy’s first visit to SXM he could have chosen to paint the island in a negative light, especially given the lawlessness and tear in the thin fabric of society that he was witness to.  He did not.  His story is one of community, friendships, and survival.<br /><br />I wish Billy would write an Epilogue!  I became invested in the people he encountered along the way.  Did he ever return to SXM?  Have they stayed in touch with Alain and Martine?  Did they try to salvage anything from the first condo? What became of Joyce, his angel taxi driver?  How did she and her family survive Irma?  So many untold stories.", "images": [], "asin": "B07T5MGTCF", "parent_asin": "B07T5MGTCF", "user_id": "AELVXE7L5PJWT3XUQCKH3LW6CXXQ", "timestamp": 1564246319007, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Well Done", "text": "This book is great on multiple levels. It is a unique prospective on young children's challenges with having alcoholic family members. I highly recommend it for all ages.", "images": [], "asin": "0985956208", "parent_asin": "0985956208", "user_id": "AF6JGYRXDWBK67SHG2G2SANXSSUA", "timestamp": 1355846770000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Just read it already!!", "text": "I love Heidi.  She's irreverent, fun, sexy, silly and has a unique view of the world that will make you laugh out loud.  Her life reads like fiction, but you can't make this stuff up!  It's a great ride.", "images": [], "asin": "0692216847", "parent_asin": "0692216847", "user_id": "AH43UWDFDXJAMUZ3IFEGJQJMXVRA", "timestamp": 1439265731000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Painful", "text": "Stephenie Meyer can describe it so perfectly, that you can even feel the pain and the joy of the characters.", "images": [], "asin": "0316160202", "parent_asin": "0316160202", "user_id": "AH5UGGJORDEOKSF55LJWMWIEPSJQ", "timestamp": 1242655215000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Nice memento book", "text": "This would make a great gift for parents on their child's birthday, and I wish there were more opportunities inside it to use as a scrapbook. The illustrations are beautiful, and there is a fair amount of negative space to allow for adding your own photos or mementos to match the milestones in the book.<br /><br />That being said, it would not go over well as a read-aloud for a 2 year old -- the illustrations and concepts are too complex for a toddler audience. Older siblings might appreciate it, but this is really for a parent audience.<br /><br />I received this book via Netgalley in exchange for an honest review.", "images": [], "asin": "1771470739", "parent_asin": "1771470739", "user_id": "AGIICMNEOMS6EU4CIQJOQNDEUIPA", "timestamp": 1475517411000, "helpful_vote": 4, "verified_purchase": false}
{"label": 0, "rating": 4.0, "title": "Not as good as some others", "text": "This wasn't her best book, but it was good.  I thought it was unrealistic -- but then again, it is a romance novel!  I'm really tired of virgin heroine's who have no experience and don't know anything about life and  heros who have slept around and been with dozens of women.  How about some  real world people!", "images": [], "asin": "1551664887", "parent_asin": "1551664887", "user_id": "AETEVTG65HAGMMKRIE7ZJO2XPYZQ", "timestamp": 959287534000, "helpful_vote": 13, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Genuinely liked this book", "text": "Genuinely liked this book. There are quite a few twist and turns, I would have appreciated more, but definitely a good read. It kept me interested and I read this quite quickly due to that.", "images": [], "asin": "B00PG8UCGS", "parent_asin": "B00PG8UCGS", "user_id": "AE3M43VYDMNQMFAFECMN6IJIBYWA", "timestamp": 1444150976000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "It is a good comic book and I like it to", "text": "I like it and I read it yesterday and it is a good comic book and I'm glad I got it then and I don't regret getting it eler no way 😀😃😄😁😆😅🤣😂🙂🙃😉😊😊😊", "images": [], "asin": "B099KJF5V3", "parent_asin": "B099KJF5V3", "user_id": "AGHJLJOETOFHXQWMAB6NXURHHFDQ", "timestamp": 1640155585113, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Audio CDs for Exploring Medical Language, 8e", "text": "I liked that the CD pronounces the words for you. I suggest that anyone can gain some type of knowledge based on if they are working in the medical field or preparing for the medical field. I guess the only disadvantage to the CD is finding the time to listen to it on the go if your car doesn't have a CD player or if you don't own one. I usually listen to it on my laptop while studying so I can hear the words out loud and so that I can pronounce them correctly. I thought it was okay especially since it's a refresher class for me but it would definitely help in other areas of the biology such as A&P, medical term, biology in general because the classes build off of one another. I would definitely recommend if you are having trouble or just want to brush up on some things this would be the CD.", "images": [], "asin": "0323077048", "parent_asin": "0323077048", "user_id": "AG5Y3QVTE3FGYGP7O3DKGWU5YIBA", "timestamp": 1375717205000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not what I expected", "text": "I was expecting more of a historical fiction book. I had a hard time following the Chinese political parties and what their motives were. There was very little about the Japanese take over of China, which I was hoping to read about. It was hard to get through, but I made myself finish it.<br />SPOILER:<br />She killed off both the dogs AND puppies?! That broke my heart and left me feeling badly.", "images": [], "asin": "B07VDFNJLZ", "parent_asin": "B07VDFNJLZ", "user_id": "AEJ5ZV56DT3NMP6VO3IYYAFRAINA", "timestamp": 1602851487832, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Sometime He Wants Them Back", "text": "We may encounter over time people who go through a tragedy in their life and may wonder how do they cope?  This book provides an insight into what this family went through when their child was diagnosed with cancer.  It tells how their faith kept them strong and how this faith also helped their son to deal with his disease. After reading this book any parent will feel fortunate to have healthy children and it makes the small trials in life feel unimportant.  It ends by giving parents who are dealing with a smiliar situation a list of suggestions that may help while going through this ordeal.", "images": [], "asin": "1579217362", "parent_asin": "1579217362", "user_id": "AHUFW3VSSBMWXAIO6VFBRUMEVBFQ", "timestamp": 1112969491000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Great Read", "text": "For me, this book is the best read of the three books in the &#34;killing&#34; series Mr. O'Reillly has written.  I enjoyed it from the opening chapter until the end.  It kept my attention through out and was hard to put down once you started reading.  Great book!", "images": [], "asin": "0805096663", "parent_asin": "0805096663", "user_id": "AGUYZTPFCM6Z4I5CFUQFE4W2SA6A", "timestamp": 1387692658000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Great for Beginners", "text": "This is a great word search for beginners. The puzzles only have a few words to search (6 or less) for each one. The book does offer fill in the blank puzzles also where you fill in the blank and then search for the word you used to fill the blank.<br /><br />This would be a nice book for children and adults where they may get overwhelmed with a bunch of words to find.<br /><br />I received a free copy of this book via Booksprout and am voluntarily leaving a review.", "images": [], "asin": "B09LGK5G71", "parent_asin": "B09LGK5G71", "user_id": "AHCTYAKFUIX4WPXASCRQDT4BCQ6Q", "timestamp": 1637078684007, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Great American road story!", "text": "Amazing story about challenges in taking two giraffes across the country. A young man grows up during the trip.", "images": [], "asin": "1542023343", "parent_asin": "1542023343", "user_id": "AGIC7JMFAOIBTRNCEOMYHIZ67GWA", "timestamp": 1618451893755, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "This is filled with portions out of the Chronicles of ...", "text": "This is filled with portions out of the Chronicles of Narnia, with questions intended to trigger insight after each portion.  It would, I think, be well targeted to an individual of the junior high level, but it is suitable even for an adult.", "images": [], "asin": "0061985511", "parent_asin": "0061985511", "user_id": "AFKVEMJOUNEZ5XYUDZRJRVD2GE5A", "timestamp": 1490717781000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Hook, line and sinker!", "text": "Wow! That was quite the introduction you started with...War is not pretty and this definitely shines a light on the darker parts of war that nobody wants to hear about. Is it realistic? It seems so but I am no operator. I do, however, enjoy a good read and with this book Jack hits it out of the park. I think I read it in three days and that was taking my time as I could not set it down when I had some time to read.<br />Excellent plot and characters you both love and hate, perfect!<br /><br />Keep up the good work as I look forward to more books in this series and wherever you decide to go.", "images": [], "asin": "1495405192", "parent_asin": "1495405192", "user_id": "AEOO4T5Y42AW7OVONLBH7E5J2GSA", "timestamp": 1394128245000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Awesome", "text": "This is a fantastic book. Alhough I received an &#34;A&#34; in my college calculus class, I did not feel that I learned the material as well as I should have. It was more of a &#34;memorize the stuff to get a good grade&#34; instead of &#34;learn the material&#34;. So this summer, I decided to study calculus as a whole, both to master the concepts of last semester and to prepare myself for Calc II in the fall. This book is fantastic and challenging. I love it. I cannot stress enough the benefits of learning something intuitively versus memorizing formulas. Get this book. I paid only 15 dollars because I bought it used, and it was WAY BETTER than my textbook.", "images": [], "asin": "0486404536", "parent_asin": "0486404536", "user_id": "AFCZIUZ3KMLEJ45BYYUSDWXF7K4A", "timestamp": 1369274042000, "helpful_vote": 8, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "perfect in every way", "images": [], "asin": "0060577312", "parent_asin": "0060577312", "user_id": "AHQHINSI6D6WSI43ORDJDFRXYF4A", "timestamp": 1413809470000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Loved this!", "text": "I really enjoyed this story! I loved Katrina, her story is full of teen angst, hope and love. It is a slow burn paranormal reverse harem tale. Looking forward to the next book", "images": [], "asin": "B08H3XP9TV", "parent_asin": "B08H3XP9TV", "user_id": "AG76SQXI5EM6SHLNWSJ4Q7NLFR4A", "timestamp": 1610961834416, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Wonderful story", "text": "This is the third book I have read by this author.  Once I started reading,  I couldn't  put it down. Made me feel like I was right there in Venice with Juliette<br />No noand Caroline.", "images": [], "asin": "B08CV9SPDQ", "parent_asin": "B08CV9SPDQ", "user_id": "AFBAX52BZRM3EVTZARKNO74NVBLA", "timestamp": 1660535178164, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "good story although the reader is pretty sure of the ...", "text": "good story although the reader is pretty sure of the ending from the beginning - good characterization; descriptive - good fast read", "images": [], "asin": "B0140Q2Z84", "parent_asin": "B0140Q2Z84", "user_id": "AHXLL3LVQRX47GSLBFLLEZSDDNKQ", "timestamp": 1464394385000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Reading it now, there's a lot of what he ...", "text": "Reading it now, there's a lot of what he said in his previous book but a lot of new info that he's learned since that book came out.", "images": [], "asin": "098635211X", "parent_asin": "098635211X", "user_id": "AERU67TZYJ3CAF6EGIN3WALZKB2Q", "timestamp": 1501717528584, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A must-have in every kitchen💗", "text": "I really enjoy the originality of these vegan options beautifully written and love the pictures!!! They must have I never healthy kitchen :)))", "images": [], "asin": "0578228807", "parent_asin": "0578228807", "user_id": "AFMCX7E7TI55Q5JJSAHPI3AEUJ6A", "timestamp": 1583155248616, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "unique twist on the bad boy theme....", "text": "Lucifer is ready to retire.  But which one of his three sons is worthy to take over Hell?  Lucifer gives each son a task with success ensuring control of the fiendish empire.<br /><br />  \"Jack\" by Kathleen O'Reilly revolves around Lucifer's oldest son, Jack Vassonovich, and his quest to purchase the Book of Souls.  The lovely Gabriella D'Angelis wants to escape the dreary life of a bookstore owner.  Will Jack complete his task or will he learn to love Gabriella instead?<br /><br />  Kathleen O'Reilly's ability to show any redeemable value in cold-hearted bad boy Jack Vassonovich is incredible.  Jack is more used to the boardroom than the bookstore whereas Gabriella knows that the heart is more important than any dollar amount.  The resulting clash is both sizzling and heart-warming.<br /><br />  \"Nick\" by Julie Kenner is the story of Lucifer's second son, Nicholas Velnias.  Nick is a famous painter but each of his paintings captures a piece of the soul of the model.  His task: to capture the entire soul of Delilah Burnett.  Will Delilah's innate goodness overcome Nick's desire to please his father?<br /><br />  Julie Kenner is an extremely talented author with a gift at creating poignant moments out of some very unusual circumstances.  Her characterizations of Delilah and Nick are captivating and very vivid as one can easily apply their circumstances to other real-life situations.  Julie Kenner maintains the heat level as \"Nick\" is a very sensual story.<br /><br />  Dee Davis concludes this collection with \"Marcus\", the story of Lucifer's youngest son, Marcus Diablo.  Marcus is assigned the task of obtaining an infamous ruby called the Devil's Delight.  He'll have to work with old flame, Celeste Abbot, to locate the ruby.  But what choice will he make if the Devil's Delight is located?<br /><br />  \"Marcus\" is an Indiana Jones style escapade that will delight those who enjoy the combination of steamy romance and high octane action.  Dee Davis produces an excellent modern day historical mystery.  The twists and turns will definitely keep readers on their toes!<br /><br />  HELL WITH THE LADIES is an unusual anthology in that all three stories are intertwined nicely into a much larger story.  Each author contributes a piece of the story and the overall themes are well-managed.  Lucifer, while more of a sympathetic figure than one might expect, still maintains his evil status by assigning each son a task to obtain an object that can be used for great evil.  Kathleen O'Reilly, Julie Kenner, and Dee Davis are to be commended for the superb collaborative effort it took to have such a consistent and smoothly flowing anthology.  HELL WITH THE LADIES is definitely worth reading as it provides a unique twist on the ultimate bad boy theme- the sons of Lucifer!<br /><br />COURTESY OF CK2S KWIPS AND KRITIQUES", "images": [], "asin": "0425211827", "parent_asin": "0425211827", "user_id": "AFUFW6YBIYQHUXZMT24FOKFY5VJA", "timestamp": 1162059441000, "helpful_vote": 5, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Lisa does it again!", "text": "You should buy this book and anything else Lisa publishes. So witty, cute, wise and REAL. That's all I have to say.", "images": [], "asin": "1770463259", "parent_asin": "1770463259", "user_id": "AHH3ATLP6SOZI6A7RISTU4R6QRDQ", "timestamp": 1538086244736, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Humanity Is Not Doomed", "text": "\"Titan\" is a novel about how two astronauts' dream of going to Titan eventually made it possible for life from this solar system to spread throughout the galaxy, but you have to read almost 700 pages of unrelenting pessimism before you get to the payoff.  In describing the book to my brother, I was compelled to point out how the real subtext of this novel is that humanity is doomed.  The book was written in 1996, published in 1997 and describes the adventures of the final crew of the shuttle Discovery during the first fifteen years of the twenty-first century, set against a backdrop of a rapidly declining Earth.<br /><br />The author, Englishman Steven Baxter, gets the development of American society flat wrong.  Disney merges with Coke and forms a monopoly over the web when every other internet provider is shut down.  There is never any doubt that a radically anti-science fundamentalist will be elected President of the United States in 2008.  The U.S. Air Force tries to shoot down America's last manned space mission.  After that, croplands dry up all over the world, segments of the United States secede (but strangely copy the right-wing agenda of the country they're seceding from), and the only really sympathetic character, Apollo veteran Marcus White, is euthanized in his nursing home.<br /><br />Meanwhile, the heroes of the story, Paula Benacerraf and Benjamin Rosenberg, are flying to Titan with three other astronauts who are killed or crippled in nasty ways during or before the landing.  The new President abandons any effort to bring them home so they know they will die on Titan, but they are determined to get some useful science done and broadcast their findings back to Earth.  The focus of the mission changes after a giant bolide propelled by a Chinese nuclear explosion crashes into the Atlantic Ocean: Rosenberg believes their real mission is to store bacterial spores on Titan in a miraculous lake of liquid water, so they will be warmed in billions of years by the expanding sun and evolve into some form of life.  Earth is no longer there to return to even if anyone were interested in bringing them back.<br /><br />This is one novel which I'm glad to say is unfilmable without a complete revision of the plot.  If I were filming this novel I would cast an ex-girlfriend as Paula and her real-life daughter as Paula's daughter Jackie, who is lucky enough to live in Seattle (the Pacific Northwest secedes from the US and becomes New Columbia).  The movie would be about how Marcus White started a space program in New Columbia to build spacecraft capable of retrieving the heroes from Titan and would end with them being rescued at the last second.  The actual ending of the novel beggars belief and is difficult to even describe.  There are lots of better books about the exploration of Titan out there.  Read one of them.", "images": [], "asin": "0061057134", "parent_asin": "0061057134", "user_id": "AFWQEWNTM3LFG3QGHOWKRI2RI6DQ", "timestamp": 1366913248000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Love it!", "text": "I absolutely loved this book!! I love how a young 12 year old girl brought this amazing fairytale to life!", "images": [], "asin": "B07NW4GQ78", "parent_asin": "B07NW4GQ78", "user_id": "AE4WDR5DVH56FPWRINTXS4FGEY7A", "timestamp": 1554679469130, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Great book, great condition, arrived so fast!", "text": "So excited to get this book!!!  Thank you for having such a good quality book available at such an affordable price for those of us who don't have a lot of money.  Cheers!", "images": [], "asin": "0881926892", "parent_asin": "0881926892", "user_id": "AHVSNVV3CQC45YNASCR7X2W6THKA", "timestamp": 1474314510000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "It's the little things.", "text": "Put it in your bag. Read it on the train. This book is quick, easy, tangible, and not to mention, beautiful. I finished the book with more nuggets of wisdom than I started with. What did I take away? Tiny, seemingly minuscule changes make the largest impact on your life. Changes too big for tomorrow aren't what dreams are made of. It's the little things. It's the hairline space between the \"o\" and the \"t\". It's making a new connection. It's having a good attitude. It's Life Kerning.", "images": [], "asin": "1118067827", "parent_asin": "1118067827", "user_id": "AEHZBHDEM35S4B3PZKLVDU4BBFGQ", "timestamp": 1333039851000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Way to meet the bf's family", "text": "Bay, Clove and Thistle are conjuring up more misadventures while meeting Landon's family, including his Aunt Blanche who sets her sights at Tillie's beau. Stir in bones found on their property equals a good read.", "images": [], "asin": "B00ONB98KU", "parent_asin": "B00ONB98KU", "user_id": "AHUZWJYWHSUMB23XJE6Z34KUXMNA", "timestamp": 1461560968000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A great read!", "text": "Well heeled and elegant Claire’s one time spontaneous indiscretion leads to an eruption of escalating consequences that shatter the veil of perfection shrouding her charmed family life.  Robinson’s delicious writing is at once juicy and perceptive - provocative and sophisticated, masterfully capturing the confusing and powerful moments in life where nothing is certain.  The story feels real and human as the well shaped characters navigate an unraveling of a family that reveals more than one page turning twist.  A great read!", "images": [], "asin": "161773375X", "parent_asin": "161773375X", "user_id": "AG33XGHCCZ42ZLG35Q2U5RVIOKZQ", "timestamp": 1424932191000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Great map for the professional", "text": "This map is fantastic--if you're on the road all day every day and need to find every nook and cranny as well as how to get there. This is not the map to get if you just need a regular city map. However for the ambulance driver, utility tech, delivery driver etc, this map is perfect.<br /><br />As far as the first persons complaints--again, they don't waste space with overlap, they keep the same scale on every page--no squeezing the little town into 1 page.<br /><br />You will get used to the page numbers on an everyday basis--they also can be looked up from the front map foldout, find area, look up number and go. It also is used for the CD usage.<br /><br />The roads are easy enough to follow if you note where they leave the previous page...but this is not the \"in-town for a visit\" map.<br /><br />Enjoy!", "images": [], "asin": "0528855042", "parent_asin": "0528855042", "user_id": "AFWA27DY7RVV7OIMVQFNG62Q4C5A", "timestamp": 1184384707000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Wow, couldn't stop reading.", "images": [], "asin": "B000FC12V4", "parent_asin": "B000FC12V4", "user_id": "AFNVZAKCW37AOZDGHYKZBHKVJYWA", "timestamp": 1413114105000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Cute book", "text": "I've never really been into sugar skulls but then I saw this book. I love dogs and this book looked cute. It is indeed cute and there's a nice variety of breeds to choose from. However I did find it hard to tell the specific breeds. Some are pretty obvious but others you can't really tell.<br />The paper seemed a little thin to me and I'm not sure if markers would bleed through. I've only used pencils.<br />I received this item at a discount for my review.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81FhRy3WwDL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81FhRy3WwDL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81FhRy3WwDL._SL256_.jpg"}], "asin": "1530893046", "parent_asin": "1530893046", "user_id": "AGVHTNDATJSKEVTLJFQLZGJUE7AQ", "timestamp": 1463900771000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Good experience", "text": "Super book, and easy transaction.  Can't wait to begin reading/citing!", "images": [], "asin": "0761965874", "parent_asin": "0761965874", "user_id": "AHMSGQGOB5XLAZR7YIMUGN2SMLOA", "timestamp": 1476743238000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Quick shipping and good story.", "text": "If you like british naval fiction, pick this up.  Get the entire series. Same class with Hornblower, Kent, Ramage and the other stalwarts -- but a lot more fun too.", "images": [], "asin": "0312315503", "parent_asin": "0312315503", "user_id": "AGKOPSNTL7BCDTKWQAOUHDHQQOHA", "timestamp": 1657832919511, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Complex characters and intriguing plot", "text": "The Trespasser is my favorite of all of French's novels. The novel's characters are fully developed and interesting people. The plot runs in many directions but stays taut and focused. A terrific read.", "images": [], "asin": "B01COJUFIQ", "parent_asin": "B01COJUFIQ", "user_id": "AHTXG2BQ2VGZXZFF7EDVTV4CTCKA", "timestamp": 1487738493000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Undeniable chemistry!", "text": "Two actors who could use a profile boost enter into a staged relationship for the positive press—but is it all positive? I thought this fake dating trope romance would be a breezy and light read but it had a surprising amount of depth and tackled some heavy subjects. I got invested in these characters despite their flaws and their messes (he is her teenage crush and this has some “A Star is Born” vibes) but their chemistry was undeniable and you can’t help but root for them!", "images": [], "asin": "0593358953", "parent_asin": "0593358953", "user_id": "AGWB2ESNTJLAMYIPZRTZAVYVC2JA", "timestamp": 1655633520109, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great resource for natural medical questions instead of relying on modern medicine", "images": [], "asin": "1583334009", "parent_asin": "1583334009", "user_id": "AGBUPF6F6XYRKLRXF4CPTGYN2YXA", "timestamp": 1447446357000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Nice textbook, great price!", "text": "Great study guide for intermediate level!", "images": [], "asin": "0618656537", "parent_asin": "0618656537", "user_id": "AGM5BYB5DIAQ66RE6QAL5T5WQIWQ", "timestamp": 1493829179000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Good", "images": [], "asin": "0988225115", "parent_asin": "0988225115", "user_id": "AFYLCIAAISVQWR5KBQHLC6LHEMNA", "timestamp": 1428927356000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Leave your phone at the door.", "text": "A good and entertaining read, especially relative to some of the other \"canon\" books Lucasfilm has come out with recently. Alexander Freed is a decent author and I think he should be give other opportunities to write SW books. I would have given it 5 stars, but you can tell that Pablo Hidalgo had a hand in shaping this story. There were a lot of \"San Francisco values\" in this book. He seems to be too focused on Twitter while at work, which detracts from the quality of work he puts out. Pablo, you seem to be decently talented, but word of advice brother: leave your phone at the door.", "images": [], "asin": "1984821989", "parent_asin": "1984821989", "user_id": "AHQSUWKXLD3T5EXFWJLR74V4NSAA", "timestamp": 1560573607754, "helpful_vote": 41, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "It is clean of any marks and is in very good condition. The book is small and thick", "text": "The book arrived as promised.  It is clean of any marks and is in very good condition. The book is small and thick. To compare it with DVD case it is half an inch taller and half an inch narrower. It is approximately as thick as 3 DVD cases put together. And weight is as heavy as 1 1/2 to 2 of 16.9 fl oz water filled bottles. The font size is small around Arial 8 size. The book doesn't offer or accompanied with online ebook or access nor CD. The material is only the book.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/716yI6Xw5zL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/716yI6Xw5zL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/716yI6Xw5zL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71k6Sl8-CJL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71k6Sl8-CJL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71k6Sl8-CJL._SL256_.jpg"}], "asin": "0781768160", "parent_asin": "0781768160", "user_id": "AG37VHMQZK5J7YLISP6KB7XXMJ5A", "timestamp": 1524616617100, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Adorable! Comfortable and easy to put on!", "text": "These daisy sandals are so stinking cute! The sole has a bit more cushion than typical flat sandals and the elastic back strap means I can put them on or take them off in a hurry.I love them and would buy more if offered in other colors.", "images": [], "asin": "B00WJDZVWI", "parent_asin": "B00WJDZVWI", "user_id": "AFA3OOHVON52ANQ3ZBR4JIHX3KKQ", "timestamp": 1463632624000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A Beautiful Book", "text": "The book is in flawless condition. Arrived in time promised. I could not be happier.", "images": [], "asin": "0062748203", "parent_asin": "0062748203", "user_id": "AFI5DYXVCDARS6GXZOF52SOFS26Q", "timestamp": 1597091354072, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Perfect", "text": "Perfect condition! Thank you", "images": [], "asin": "0307157059", "parent_asin": "0307157059", "user_id": "AG72JUMYAQWBICBHXYHBZ626TXEA", "timestamp": 1546310915632, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great for teaching baby body parts", "text": "It’s so important to teach your kids the correct name for their body parts and this is a fun way for them to learn! My son is 7 months old and like to do the flip part", "images": [], "asin": "0689835604", "parent_asin": "0689835604", "user_id": "AH42VF7M2MMSMNME7525UDEMEDAQ", "timestamp": 1628389752005, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Beautiful photos, great resource!", "images": [], "asin": "142967119X", "parent_asin": "142967119X", "user_id": "AGYKPL7FVJDTX5V2DNSLYBAQKNQQ", "timestamp": 1504535011809, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Could Be My Fav Patterson...", "text": "...and that's saying a lot.  I can see on the surface where the Jester might turn some people (even Patterson diehards) off.  A love story, adventure, mystery all wrapped in the setting of the Crusades?  This is definitely a departure for Patterson and if you go into this expecting Alex Cross I can see where you'd be disappointed.<br />That being said, the Jester has slowly become one of my favorite Patterson novels to date.  I say slowly because I have found that this story has stayed with me much longer than a Cross novel.  This is the type of story that is allowed to stew in your mind and grow with time.  I highly recommend the Jester.<br />Hugh De Luc plays the key role in this novel.  An innkeeper with adventurous ambition, Hugh leaves his family and home to pursue riches in the Crusades.  The Crusade story line does not dominate and should not scare away the casual reader.  The setting merely sets the stage for Hugh's acquisition of a relic that's value is unknown to even him.  Upon Hugh's return home he finds his village in shambles and his family presumably dead.<br />This sets in motion the key storyline of the Jester as Hugh goes in search of those responsible for ruining his life.  A David vs. Goliath revenge story unfolds with Hugh resorting to any means necessary to get close to those responsible for his pain, even resorting to taking up the role of a jester.  Here is able to gain the trust of those responsible and devise a plot worthy of the pain he has endured.  Along the way Hugh gains allies and uncovers truths beyond his imagination.  Patterson's imagery and detail pull you into the story as you root for Hugh in his own personal crusade.<br />Patterson and co-collaberator Andrew Gross tie everything together in a climatic final battle, discovery, and of course a Patterson plot twist.  The plot twist can be seen coming and came as little surprise to me.  While fault could be found in this fact, I still found The Jester well worth the time.  Patterson's trademark rapid pace keeps the pages turning and suspense mounting.", "images": [], "asin": "0316147877", "parent_asin": "0316147877", "user_id": "AFVOQS3RRYYL2L5NPU4WJLFZRI7Q", "timestamp": 1063130810000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Fun and entertaining", "text": "I wasn't sure what to expect when I ordered the Callahan Garrity series. I have long been a fan of Mary Kay Andrews but since some of my favorite authors now had some less than stellar early books, I just kept my fingers crossed.  Much to my surprise, I am thoroughly enjoying this series.  I like her characters, the plot twists and turns, the humor and earthiness.  Although some of the language is not politically correct, sadly it is accurate to the times. I am awaiting novels 6, 7, and 8 in the series and have loved 1-5.  Can't wait!<br />For reference (in case you like to read them in order like I do), the 1st is Every Crooked Nanny, the 2nd is To Live and Die in Dixie, the 3rd is Homemade Sin, the 4th is Happy Never After, the 5th is Heart Trouble, the 6th is Strange Brew, the 7th is Midnight Clear, and the 8th is Irish Eyes.  Phew!", "images": [], "asin": "0062195115", "parent_asin": "0062195115", "user_id": "AFQFLJQ6ZPQNAIBCV53DRDDWXEWQ", "timestamp": 1626910842348, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Looks to be as good as advertised!", "text": "I haven't yet read the entirety of this book.  I have merely thumbed through it some and read a few portions.  I tried my hand at egg tanning a couple of hides some months back and when I was researching how to do that, I came across a large number of recommendations for this book, many touting this as required reading for any beginners in tanning.  I have thus far been very impressed and will change my review if after finishing I am any less happy with what I have learned.", "images": [], "asin": "0965867242", "parent_asin": "0965867242", "user_id": "AFOL2I6ECHRM3E5NWDLKTHSRDI7Q", "timestamp": 1379864938000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great resource for chasing waterfalls in North Carolina", "text": "My only regret is that I found this book AFTER visiting North Carolina in October.  I purchased a second copy for my son right after I got my copy.  Great tool for planning our next trip.  This is the best I have seen.  Photo tips and rating ease of access.  Thanks, Dale", "images": [], "asin": "0895873206", "parent_asin": "0895873206", "user_id": "AEC24SEF3Q4UYUBOQ3T5RI5CVJ2A", "timestamp": 1260403962000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "This book was informative, but I didn't care for the way it was written.", "images": [], "asin": "0827612079", "parent_asin": "0827612079", "user_id": "AE3VLKLS37OFW72T2H7BFEW43XYA", "timestamp": 1523893696410, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Loved it and the next one", "text": "Loved it and the next one ... Finders Keepers was also excellent.  Both good mystery types and looking forward to the next one due in Feb. 2017", "images": [], "asin": "B00GEEB52S", "parent_asin": "B00GEEB52S", "user_id": "AFFDSPYRFEXSOXDUS4C65BFGC6AA", "timestamp": 1471886407000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Given a a gift to a child and was much loved", "images": [], "asin": "0061987514", "parent_asin": "0061987514", "user_id": "AFVVP4VURVSX6O3LD267UYMTDJ7A", "timestamp": 1424118795000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Fine book, fascinating discovery.", "images": [], "asin": "1400078458", "parent_asin": "1400078458", "user_id": "AEDJ6XMDDAWEJNLMEPE2RYZPSOXQ", "timestamp": 1505149716052, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Huge book but well made", "text": "This book makes a nice gift edition with the book stored in a box.  I paid a sale price for it so am very pleased with the thick pages, beautiful illustrations and all around quality.<br /><br />The size of the book/box is huge though.  Picture a little bigger than the average desktop tower and you have a good idea of the height.  The width is just slightly shorter.<br /><br />Whether you are reading for the first time or enjoy the classic story, this is definitely one to have in your library in some form.", "images": [], "asin": "0670061778", "parent_asin": "0670061778", "user_id": "AFP2H5S2KB4WGAOIEEDTQBUMG5ZQ", "timestamp": 1285394865000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The \"Ah-ha\" moment makes it worth the read!", "text": "Such a great book! I love that moment when you figure out how all the stories are connected. Every one is unique but ties together so well.<br /><br />Also, the colors make it a fun visual piece of art too. In my first copy the printing had messed up and part of the color was cut off at the top, so I sent it back for a replacement copy which looks much better.", "images": [], "asin": "0578297825", "parent_asin": "0578297825", "user_id": "AFXMBKSH2AQVZ762GIZ2NAY6IRZQ", "timestamp": 1652893958421, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "As kids' literature it's pretty good", "text": "I haven't really read this closely yet, and don't know if I will. I did breeze through it. It is a good book for kids. I only bought it because my great-nephew is the inspiration for one of the 3 main characters.", "images": [], "asin": "B08BK7J8YV", "parent_asin": "B08BK7J8YV", "user_id": "AF3VPZEPHDNQMLKDWUQLWWXFT5TA", "timestamp": 1602185616105, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Old Bluegrass Songs", "text": "I recently stumbled across this book in a school library.  While the book is quite old, so are the 88 songs, all of which are classic bluegrass tunes.  The melody notes are kept simple, and the chords are given for each song, making it a great book to use for playing in or practicing for jams.  Highlights: many Ralph Stanley songs, interesting anecdotes about bluegrass songs, instruments, and musicians.  Great to have the words to \"Pffftt, You Were Gone,\" made famous on Hee-Haw.", "images": [], "asin": "0020603800", "parent_asin": "0020603800", "user_id": "AEO4SIJCIHOZPFD5JD22ORJ3KTOQ", "timestamp": 1283305399000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A MUST have Kipper book!!", "text": "I've just started learning Kipper and I'm VERY impressed with this book! What I really like is that the lessons are very informative and easy to follow (just like the author is speaking to you). You will feel like you are being guided step by step throughout the book. Great book! Worth every penny!", "images": [], "asin": "1546444432", "parent_asin": "1546444432", "user_id": "AHLPA7W6DWGUDYENUI6GXSGADTYA", "timestamp": 1548563653760, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Could be better", "text": "I would have loved to give it five stars, but I expected a lot more from these flashcards than the redundancy and waste of space that I received. It's mediocre at best and unfortunately few products are available outside Nigeria to compete with it. It focuses more so on vowels and not the entire yoruba alphabet, which would have been great. Also, if you are a native speaker, you will come across some words that seem archaic or belonging to a different yoruba-speaking region. Nevertheless, it is a decent teaching tool for kids and non-yoruba speakers.", "images": [], "asin": "0980124344", "parent_asin": "0980124344", "user_id": "AH4QJAZOR6JGSIVQXFDEY4CKJMHQ", "timestamp": 1316233807000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Old Material Revisited", "text": "A big disappointment. She kept her very conversational style and a promise of continuation, but there was no real plot, no character development, and even an open question and poor resolution of one of the issues. I've read All her other books so I didn't enjoy this rehash of earlier cases. It was like she had to deliver a new adventure and she didn't have any ideas.", "images": [], "asin": "0425282546", "parent_asin": "0425282546", "user_id": "AGZIPY7TUEL223MLT23TAZVQYXDA", "timestamp": 1531253649161, "helpful_vote": 13, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "DESERVES NO STARS", "text": "Shovelware. If I could give it zero stars I would.", "images": [], "asin": "1940992516", "parent_asin": "1940992516", "user_id": "AEKFIXCB324JIRIOMESPZKSXBLPA", "timestamp": 1463586390000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Nice collection!!", "text": "Great collection! Great memories!", "images": [], "asin": "B004S68M8Y", "parent_asin": "B004S68M8Y", "user_id": "AHHRWNLGFRMOUIFB23LCYO34KVPA", "timestamp": 1524595847059, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Super sweet! Love it!!", "text": "This book is so sweet. I won't lie... I only bought it because it was written by Matthew Gray Gubler. I was so excited for it to arrive! Read it to the kids with the shipping packaging on my lap still. We love it! I look forward to any additional books he decides to write!", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61C+09UexHL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61C+09UexHL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61C+09UexHL._SL256_.jpg"}], "asin": "0525648445", "parent_asin": "0525648445", "user_id": "AF276MYDKAL6OUYSSQPLPFJYAOGA", "timestamp": 1589035692520, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Billy has a good ear for dialogue and this was an interesting read", "text": "Billy has a good ear for dialogue and this was an interesting read.  This is not just a love story but a story about a passionate desire to serve in the political arena.", "images": [], "asin": "0996978402", "parent_asin": "0996978402", "user_id": "AECB3IU2OR4AHLZK6NU6HWWYYN5A", "timestamp": 1512620374201, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A very interesting book, i admire the objectivity which ...", "text": "A very interesting book,i admire the objectivity which lead the author in writing his journal which is ,for sure,a real page of important history.", "images": [], "asin": "B0000CMZ77", "parent_asin": "B0000CMZ77", "user_id": "AH6ABUGT4Y57VCOUF3LXNTNDC2RQ", "timestamp": 1406114924000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "I am learning how to use my Instant Pot. ...", "text": "I am learning how to use my Instant Pot. First thing I tried was boneless chicken and it was very tender and juicy.", "images": [], "asin": "1623156122", "parent_asin": "1623156122", "user_id": "AGVLTQSM5KETQXHJCW4RZZMQYCVQ", "timestamp": 1486398659000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "use it daily", "images": [], "asin": "0877799288", "parent_asin": "0877799288", "user_id": "AH53CVTOGPAQE7TPE7INGZDJCW7Q", "timestamp": 1406237011000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Author's first effort a success", "text": "Dr. Young has written a suspenseful, quick-paced mystery with unusual sleuths. He is easy to read, so even though this book is longer than most &#34;mysteries&#34;, it's smooth. It was fun, and I look forward to more books from him.", "images": [], "asin": "1483420639", "parent_asin": "1483420639", "user_id": "AG7LHXJW23SOB7SWVPUA7WK4YA4Q", "timestamp": 1428694140000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Five Stars", "text": "Still working on the different diet the book offered.", "images": [], "asin": "B00NPMDZDE", "parent_asin": "0091948185", "user_id": "AG4OO4DV5M6E65ESUIIFCNX7J6LQ", "timestamp": 1490219086000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Assured Independence", "text": "As one of the series about the Greek Village by Sara Alexi, I believe this was the best of all of them! The plight of the illegal immigrant, the maneuvering of the police, the failure of the political system, and the description of the inadequate facilities used to house the immigrants kept me wondering how I was so blessed to be born in the United States. At the same time, Alexi's description of how her main character changed her life to one of independence pleased me beyond words! Juliet found a way to finance her own decisions and helped others around her do so as well with ingenuity and a certain amount of assurance that many older women would have found difficult. I hope to read more books by Sara Alexi.", "images": [], "asin": "B00R2D6ZLG", "parent_asin": "B00R2D6ZLG", "user_id": "AHF3QG7Y4YXKF5UAKTYNGROU4MQQ", "timestamp": 1494545690000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Disgusted!", "text": "Yes!  The VA system needs an overhaul to get rid of the fakers and give benefits to those who truly deserve it!  When someone can fake a knee injury or get injured off the job and get disability, the system is flawed!", "images": [], "asin": "1494728680", "parent_asin": "1494728680", "user_id": "AH4CGRODNU4LNIEWRUN2CXXRJFKA", "timestamp": 1596152194378, "helpful_vote": 6, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Absolutely Great Stuff", "text": "This is absolutely great stuff,<br />There are links in bonuses inside the book that are super valuable information for expending your business in and out the internet.<br />Jeff is one of a kind.", "images": [], "asin": "1630470171", "parent_asin": "1630470171", "user_id": "AFKCLV4FVXRMFLKFESP2H36WNUMA", "timestamp": 1455398823000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "The action-packed adventures of a librarian!", "text": "Being a librarian myself, I never thought I'd find a book that fit that particular description.  But Beinhart has managed to weave his mild-mannered librarian hero into a web of political intrigue filled with evil right-wing conspirators and provocative women.  Cudos to the author for making the librarians depicted interesting and sexy (even the one old woman librarian is revealed to have had a very active sex life in her younger days), not the usual stereotypes.  My only small problems with it are that it could have been shorter by about 75 pages, and that the election-based plot is so thinly veiled that he may as well have called the incumbent \"Bush\" instead of \"Scott\".  All in all, though a great read for anyone, not just librarians.", "images": [], "asin": "1560256362", "parent_asin": "1560256362", "user_id": "AG4D7VUGKRYYRQ7YWUJFHAOAGP6Q", "timestamp": 1095262318000, "helpful_vote": 30, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "One of my favorite!", "text": "One of my favorite cookbooks. I've gotten it as gifts for others on multiple occasions.", "images": [], "asin": "1561486868", "parent_asin": "1561486868", "user_id": "AFT77MK735L76ENTTQTSXKVDHL5A", "timestamp": 1448820530000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "It was OK Quick read but nothing memorable", "text": "It was OK<br />Quick read but nothing memorable", "images": [], "asin": "B016CDK39G", "parent_asin": "B016CDK39G", "user_id": "AGH4BQO2X2DPXLLDCABHN4OWZ3IQ", "timestamp": 1500403657816, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Worthwhile", "text": "The book has also been published under the title The Penguin Book of Latin American Short Stories. It came out in 1991 and contained 26 works by as many Latin American authors, from seven nations and Puerto Rico. Brazil, with 10 selections, and Argentina, with 5, were by far the most frequently represented countries; the emphasis on Brazil perhaps reflecting one of the compiler's specializations, Portuguese literature. With the exceptions of pieces by the writers Machado de Assis and Quiroga, who were described as the pair marking the start of modern Latin American literature, the book's selections covered the period from the 1940s to 1990, with special focus on the 1970s and 80s.<br /><br />The collection featured old and new voices, the celebrated and the lesser known, and highlighted writers who created unexpected, dreamlike worlds. Some of the works could be regarded as classics: Machado de Assis's \"The Psychiatrist,\" Quiroga's \"The Dead Man,\" Borges' \"The Circular Ruins,\" Cortàzar's \"Axolotl,\" Carpentier's \"Journey Back to the Source,\" Guimarães Rosa's \"The Third Bank of the River\" and Fuentes' \"The Doll Queen.\"<br /><br />Other writers were well known - Onetti, Rulfo, García Màrquez -- but their selections differed from the usual ones in other anthologies. There were other celebrated writers - Amado, Bioy Casares, Lispector, Scliar, Allende, Puig, Arenas, Cabrera Infante, Ferré. And then writers who were comparatively lesser known and from Brazil (Armonía Somers, Murilo Rubião, Joao Ubaldo Ribeiro, Lygia Fagundes Telles, Rubem Fonseca, Paulo Emílio Salles Gomes) or Puerto Rico (Ana Lydia Vega). Writers who might be considered comparable in their creation of dreamlike worlds but who didn't make it into this anthology: Asturias, Levinson, Pinera, Arreola, Monterroso, Donoso and Peri Rossi.<br /><br />Some of the stories were written in a minutely described, hallucinatory style and/or seemed merely to pile incident upon incident (Borges, Carpentier, Bioy Cesares, Somers, Puig, Arenas, García Marquez, Rulfo, Cabrera Infante). The one by Cabrera Infante differed from the rest in that it was a humorous parody filled with light-hearted wordplay by the narrator. But many of these stories were nearly unreadable and couldn't be penetrated in any depth. Exceptions for me were works that described the killing of a pig and a participant's revulsion in grotesque and memorable detail (Ribeiro), the shift in consciousness of a narrator who entered a museum (Cortàzar), and a narrator who sought a character from his childhood (Fuentes). These succeeded in drawing me in to their bizarre worlds.<br /><br />Others were told clearly but in a style similar to folk tales or fables and involved extraordinary, larger than life events and/or fantastic characters, such as a psychiatrist who decided to help humanity by building a madhouse in town (Machado de Assis), a father who went to live in a boat on the river and never returned (Guimarães Rosa), a lover who escaped from an angry husband (Amado), a man who found and \"tamed\" a woman (Allende), a magician who could pull tigers out of his sleeves but was worn down by reality (Rubião), and the plagues of Egypt as described by the Egyptians (Scliar).<br /><br />Others were also told in a more or less straightforward and realistic way but created a strong atmosphere of unreality or tension, as in the description of the death of a man (Quiroga), the events surrounding a murder (Onetti), the description of a plot by two characters against a third (Salles Gomes), a female narrator's budding independence from her controlling grandmother (Fagundes Telles), a narrator's description of the menace involved in several relationships, including her own (Vega), and the friendship of two girls at school that crossed racial and class boundaries (Ferré). Fagundes Telles' writing was described by the writer as closer to the psychological precision of French writers from the 1940s and 50s than to the naturalism and regionalism (or magic realism) of her contemporaries, which won her comparisons with Colette.<br /><br />Aside from the classic stories, I appreciated this collection most for the many examples of writing from Brazil, for a number of the more straightforward, well-constructed stories, and one or two of the folk tale-like stories.", "images": [], "asin": "0452268664", "parent_asin": "0452268664", "user_id": "AFDKCUVFQ3UUTAV2CHXJX6YXJQXQ", "timestamp": 1210988343000, "helpful_vote": 6, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A must-have on your trip to the Big Island", "text": "After reviewing most of the popular guidebooks to the big island, I can say that this one is clearly the best.  Kudos for the authors' attention to detail and objectivity.  Some of the information on restaurants seems innacurate or perhaps outdated.  The condition of some non-paved roads is also somewhat unreliable, specifically the road to Makalawena Beach (what road?!?! its an off-roading expedition).  All in all, the book is an excellent guide for all parts of the island we visited.  The sections on volcano national park and Captain Cook monument give you the locals' scoop.  In many cases, you need to read between the lines to get at the author's real message (eg. viewing lava, etc.)  A must have.  Enjoy your trip!", "images": [], "asin": "0963942964", "parent_asin": "0963942964", "user_id": "AEJPSNAL34IBYNU3CRABF3RTJSAA", "timestamp": 1064550780000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A mixed picture of today's Russia", "text": "In Secondhand Time, Svetlana Alexievich paints a mixed picture of post-Soviet Russia.  While an oral history, the author is skilled at threading a common theme of disillusionment, hope, and sacrifice throughout the stories.  I found this book to be particularly effective at explaining what happened in the lead-up to the fall of the Soviet Union, much better than some of my high school and college textbooks did.  This book reads like a collection of well stitched together short stories.  I was quite depressed to finish it, as it was one of the best books I've ever read.", "images": [], "asin": "0399588809", "parent_asin": "0399588809", "user_id": "AE7MQ67E6JDNKGIK365CBGVZM6CA", "timestamp": 1471976985000, "helpful_vote": 15, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Lots of keeper recipes", "text": "We got this book a couple of years ago at a local book signing event hosted by a local farm. Before this summer we may have made one or two recipes from it. They were good but we didn't use it that much. However, this summer has been hotter than normal. Trying to avoid the stove and oven as much as possible, we went back to this book and tried some more of the recipes. (Note that many of the recipes call for meat or fish so you can't avoid heating altogether). What we've found is many great and diverse recipes. We've tried four or five in the last month and all have been great as well as quite different.<br /><br />Highly recommended, even if you don't normally think of salads for dinner.", "images": [], "asin": "0847838250", "parent_asin": "0847838250", "user_id": "AG2JM37OIRZ7XZVVFPU6EGVP7YHA", "timestamp": 1534005525770, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Great follow-up to Note to Self", "text": "I LOVED Joe Thorn's Note To Self. It is a little book that I've read twice now. If you haven't read it yet, you should, you really should! It's WONDERFUL.<br /><br />Experiencing the Trinity is a follow-up of sorts. Fifty devotionals addressed directly to YOU. Thorn is a big, big believer that believers need the gospel every single day, that believers should 'preach' the gospel to themselves daily. This book does that within the framework of learning about grace and the trinity.<br /><br />It is divided into three sections: God the Father, God the Son, God the Holy Spirit. Entries from the first section include: &#34;He is Holy,&#34; &#34;He Is Present,&#34; &#34;He Is Good,&#34; &#34;He Is Love,&#34; &#34;He Forgives,&#34; and &#34;He Is Father.&#34; Entries from the second section include: &#34;His Humanity,&#34; &#34;His Deity,&#34; &#34;His Poverty,&#34; &#34;His Love,&#34; &#34;His Obedience,&#34; &#34;His Suffering,&#34; &#34;His Death,&#34; &#34;His Resurrection,&#34; &#34;His Reign,&#34; and &#34;His Return.&#34; Entries from the third section include: &#34;He Regenerates,&#34; &#34;He Indwells,&#34; &#34;He Intercedes,&#34; &#34;He Comforts,&#34; &#34;He Teaches,&#34; &#34;He Points to Jesus,&#34; &#34;He Sanctifies,&#34; and &#34;He Resurrects.&#34;<br /><br />Each message is rich in scripture and doctrine. And I loved how straight-forward and relevant the messages were.<br /><br />I loved the scriptural focus. I loved how simple and straightforward it was. I loved how relevant it was. But most importantly I recognized how needed it was. These fifty reflections speak truth--needed truths. Thorn's book is a blessing to believers.", "images": [], "asin": "1433541688", "parent_asin": "1433541688", "user_id": "AEONPU6PQ3GJSJIDRSVXUCBKRPKQ", "timestamp": 1426687109000, "helpful_vote": 4, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "great story line", "text": "so far I'm liking the series hope it keeps up as entertaining", "images": [], "asin": "B00QVKR5TC", "parent_asin": "B00QVKR5TC", "user_id": "AEH3J6UCWQENSKSZI52CMPCJT47A", "timestamp": 1535770219789, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 4.0, "title": "Interesting", "text": "Somewhat confusing at times but I ordered the second book in the series.  Plenty of action but you have to pay attention to the plot.", "images": [], "asin": "B00C2WDD5I", "parent_asin": "B00C2WDD5I", "user_id": "AHU5U4NC4C3GQAH3ZEUJ73AY35JQ", "timestamp": 1400010396000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "great deal and shape", "text": "This book was in great shape! And was a great deal for my kids and they love this book series.", "images": [], "asin": "0439670217", "parent_asin": "0439670217", "user_id": "AGLOMG5GEZWNQ4NGN4OTDPOWYW7A", "timestamp": 1387080437000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Excellent reference for anyone who deals with transportation security", "text": "On any given day at America's airport terminals, grandmothers are asked to remove their shoes, raise their arms, and submit to a wanding with a magnetometer. That is in stark contrast to commercial transportation security, where even nearly seven years after 9-11, risks far greater than grandma go unchecked.<br /><br />The book Transportation and Cargo Security: Threats and Solutions provides a comprehensive look at the myriad details involved with the complex, dynamic world of commercial transportation security. It includes information on maritime, land (railroad, trucking, mass transit), pipeline, and air transportation modes.<br /><br />The book's 14 chapters provide a thorough overview of the specific topics that cross sectors, such as threats, countermeasures, and personnel concerns, as well as laws, regulations, government agencies, and standards for specific sectors.<br /><br />Many books on these security topics include over-the-top statistics and fail to present a pragmatic view. Transportation and Cargo Security takes a practical yet hardheaded look at the core issues, which gives the reader a superb understanding of the various threats to the transportation system.<br /><br />What is frustrating is that the book often refers to laws passed just after 9-11, yet many agencies and industries are still noncompliant with the many requirements contained in those laws.<br /><br />Transportation and Cargo Security: Threats and Solutions is an excellent reference that anyone who deals with transportation security will find extremely valuable. This is the book that everyone in transportation security should have read.", "images": [], "asin": "0131703560", "parent_asin": "0131703560", "user_id": "AHIBC22PKCBLQKDFJC2UCBVISE4Q", "timestamp": 1217594442000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Save your money", "text": "Didn't need to buy.  Nothing new was learned by purchasing this book.", "images": [], "asin": "0692251618", "parent_asin": "0692251618", "user_id": "AFYU6MDSD3XED36KOEBEDFMTTESA", "timestamp": 1537465693235, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Fun Couple Activity", "text": "I have seen books like this in the past but it has always been in the context of writing down things about yourself for your kids to treasure later. I knew that these types of books existed for couples but this is the first one I have seen. I thought it would be a fun thing to do with my wife. There's a lot to like with this little book, but there is some room for improvement too.<br /><br />The idea is simple. The book provides a writing prompt based on a common interest or a past experience. The questions are clearly meant to be discussed or worked through together, unless each has their own copy and they exhange. It's a fun activity either way and it will keep you busy for a little while.<br /><br />The questions tend to be somewhat repetitive in that they are often very similar to others and there usually is not enough room to write everything that needs to be written.<br /><br />This isn't a bad book at all and is fun to work through. It would be better with a little more room to write and more variety in the questions, but it will definitely provide couples another way to connect.", "images": [], "asin": "1685399258", "parent_asin": "1685399258", "user_id": "AFLX66DKF6R3H6OEOC3TIVAYXZIQ", "timestamp": 1670240604593, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "We read it in conjunction with our unit study on ships but the story encompassed so many topics that it was the source of juicy", "text": "This book took our family on an incredible adventure. We read it in conjunction with our unit study on ships but the story encompassed so many topics that it was the source of juicy conversations throughout our days which is a sign of a great read- aloud. We felt attached to the characters and had to remind ourselves that this amazing story was true. We hope that Cheryl Trzasko will write more of her adventures because her style, wit and wisdom were a delicious addition to our days.<br /><br />A word from my daughter:<br />This book is totally meant for the family.The excitement, the suspense, the adventure; I loved it all! And you will too!", "images": [], "asin": "1475975589", "parent_asin": "1475975589", "user_id": "AHV5X5FLQE27MTNKKJGEPV5SEA7A", "timestamp": 1444654568000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Book!", "text": "Love it so much, I purchased five more for Christmas gifts!!!!!  I am devouring my copy like great food and I highly recommend this book.  Thanks so much,", "images": [], "asin": "0892280271", "parent_asin": "0892280271", "user_id": "AFKSKUYGDJ3IG4TFMEKXIEAMQIBQ", "timestamp": 1355255389000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Having Trouble Skiing?  Read This Book!", "text": "This book not only covers the basics,  but also has great sections on equipment and fine-tuning equipment, as well as sections on challenging skiing situations (bumps, steeps, trees, etc.).", "images": [], "asin": "007140841X", "parent_asin": "007140841X", "user_id": "AEE3KWRPYWAD7PZJ6VPVEWE2ZNMQ", "timestamp": 1372261752000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "7 year old loves it.", "text": "I thought it could be a little bigger but the 7 year old boy loves all the jokes.  Some are a little on the corny side perfect for a 7 year old.", "images": [], "asin": "0800788206", "parent_asin": "0800788206", "user_id": "AFQXV43CJR3MY4YUTL6LYFKBDSSA", "timestamp": 1388421033000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The classic, definitive, encyclopedic reference for celebrating Mass ...", "text": "The classic, definitive, encyclopedic reference for celebrating Mass in the Extraordinary Form (the Traditional Latin Mass).<br />Fully updated in accordance with the 1962 liturgical books.<br />An essential companion to Fortescue's 'Ceremonies of the Roman Rite Described', but less terse, less dense, and easier to assimilate.<br />O'Connell fully amplifies and elaborates ceremonies, rites and rubrics with which Fortescue already seems to assume familiarity.<br />Virtually every conceivable question about the Latin Mass is answered and footnoted.", "images": [], "asin": "B000GLOBTY", "parent_asin": "B000GLOBTY", "user_id": "AGIDJJ45YLH7AH2Z6LGJ6J4GNV2A", "timestamp": 1472104357000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Didn't like the main character, Rachel.  Story kept me interested in trying to figure out &#34;whodunnit?&#34;", "images": [], "asin": "B00L9B7IKE", "parent_asin": "B00L9B7IKE", "user_id": "AESKZLLOX5BD663AODTKLENV44NA", "timestamp": 1429896314000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": ".", "text": "I would purchase again.", "images": [], "asin": "0375803297", "parent_asin": "0375803297", "user_id": "AFUOUTSP75OKDPK735RWWLHETWNA", "timestamp": 1588272623334, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Topics to ponder as we age", "text": "I’m in my 60’s and this book really hit a home run. Every topic covered is dead on. It’s told in a humorous but meaningful way. Not preachy, not a self help book — just things to consider as time moves on. The ending is exceptional. I was truly disappointed that the book wasn’t longer but Mr. Burnett gets his point of view across in this short profound masterpiece. I could envision this being a one man play — like Tuesdays With Morrie.", "images": [], "asin": "B0BHC22LX6", "parent_asin": "B0BHC22LX6", "user_id": "AH7NIAKBT24PWWGO43YZPA3RKNHQ", "timestamp": 1677760878324, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "A fun read", "images": [], "asin": "B019B6TVUI", "parent_asin": "B019B6TVUI", "user_id": "AE3AM5TKGH4A2XDTN5UF3FGVRVJA", "timestamp": 1476015876000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The Special Giraffe 😍", "text": "Wonderful book. Educational and fun 🤩", "images": [], "asin": "B08MSQT62R", "parent_asin": "B08MSQT62R", "user_id": "AEAKQQU4IH5QIXKKKD7472GRCPBQ", "timestamp": 1612917255115, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "=(", "text": "I finished the story and now have a full set the book came in early and had none thing on it the book looked new and was a nice addition to my set.", "images": [], "asin": "1591821053", "parent_asin": "1591821053", "user_id": "AFXJ7Y6FJKY54FJ3HQ4ST5Y3YS5Q", "timestamp": 1357057346000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Misses the mark", "text": "A novel about a con man being conned. Sounded good but it missed the mark for me although I could tell the author was trying. It's difficult to follow because it's distant third POV and switches time periods (and many of the characters use fake names so they are sometimes hard to keep straight.) There were no real surprises since it's clear fairly early on what's happening and generally why, although the particulars and the how it plays out remains to be discovered. The biggest problem was I did not care about any of the characters. There was nothing that made them individual or alive to me and nothing that kept me interested in what happened to them. By the end of the book I was skimming large sections. Not awful but hard to recommend.", "images": [], "asin": "006240749X", "parent_asin": "006240749X", "user_id": "AF77WKG632KIF4V4L3BXAEX76UFA", "timestamp": 1476574629000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A Must for Educators", "text": "Anthony Muhammed hits the nail squarely on the head - maybe at last someone will listen.", "images": [], "asin": "1936763273", "parent_asin": "1936763273", "user_id": "AFUT33EWKPOWE5V5WUI5MQMVTKWA", "timestamp": 1457208691000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "World War 1", "text": "Basil Rathbone and Nigel Bruce you have to read about their time in World War 1 to have a chance to understand both of them and their friends later in film that were in that conflict also.", "images": [], "asin": "0498014711", "parent_asin": "0498014711", "user_id": "AG5WABSU6RKEKKGI2VV6Q7LAC5BA", "timestamp": 1424630523000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Excellent Bosch!", "images": [], "asin": "B000FC1MMS", "parent_asin": "B000FC1MMS", "user_id": "AGN7S4ULPIXCQUQFYGS6ZLEFFUVA", "timestamp": 1463136126000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Story", "text": "The book had everything!  Mystery, love, ecology of a marsh, and life in the South.", "images": [], "asin": "0735219095", "parent_asin": "0735219095", "user_id": "AEZ4VVZY4BR5LWDPNUFTEFYTDCWA", "timestamp": 1556848572745, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Love the book", "text": "Love the book!! Such wonderful family memories growing up in the 50s and 60s and 70s. The fear felt by many when called to duty<br />to Viet Nam. It was like a death sentence. Those who survived are scarred for life.<br />Thank you for a great accounting of people growing up in that era!!", "images": [], "asin": "148341115X", "parent_asin": "148341115X", "user_id": "AHXLO4TRFIUUS3JOVSR2W5ZMAX3A", "timestamp": 1406123019000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A fine novel, The Narrows, by Michael Connelly. You will enjoy it.", "text": "Get ready to read an excellent book. Get ready to follow an investigation that will keep your interest at it's peak. I very rarely give novels \"Five Stars', but Michael Connelly's, The Narrows is IT! Special agent, Rachel Walling, and retired Los Angeles Police Homicide Detective, Harry Bosch, begin working together to solve a murder of a retired fellow police detective. The deceased detective is found on his fishing boat dead, and his wife suspects murder. She calls on Bosch to investigate his death. Bosch is retired and working as a private detective. His investigation takes him to Las Vegas, Nevada, with a short stop in route. This is where he and Walling begin their search. Is it a murder? Perhaps not. Is it a self? Maybe yes. Bosch and Walling begin their search for the truth in Las Vegas. There they learn a few facts. Walling's FBI supervisor, does not want her getting involved \"personally\". He wants her just to follow him around. However, Walling does go with Bosch. In fact, they go to a small town north of Las Vegas, the only means of income is one bar and several little \"homes\" for prostitutes. Then back to Vegas and L.A. They do find the answer. If you want to learn how Bosch, and Walling find the answers, then buy and read this excellent novel. I honestly believe you'll thank yourself for buying. Michael Connelly is a former Los Angeles Times reporter. He knows how to write an excellent suspense novel. Rated PG. Little strong language and little sexual content. Rated PG. DP. Castro Valley, CA.", "images": [], "asin": "1455550701", "parent_asin": "1455550701", "user_id": "AFQJFOXV3YPHZVYEFU6NXIYJYEDA", "timestamp": 1574722467022, "helpful_vote": 7, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Absolutely loved!", "text": "This book is terribly sad but at the same time Bobby made me laugh my ass off. I absolutely enjoyed this book from front to back! I recommend!!", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71JC-GWzlWL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71JC-GWzlWL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71JC-GWzlWL._SL256_.jpg"}], "asin": "1982158247", "parent_asin": "1982158247", "user_id": "AGSI64IJQEAP7KZLLBNOL5P4MRBA", "timestamp": 1648063955529, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "very happy with this purchase", "text": "it is a small note book! very convinent", "images": [], "asin": "0486413608", "parent_asin": "0486413608", "user_id": "AH3BHOLNGUXFEHMA6O5RHO6DDRGQ", "timestamp": 1602714304197, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Book", "text": "Very good reference book when your needing to resurch needed materials and solves many questions you have had to know.", "images": [], "asin": "067477759X", "parent_asin": "067477759X", "user_id": "AEV4226NOVV6MSJ67MUHCUU3FYDA", "timestamp": 1358433119000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Very Enjoyable Read", "text": "This book is based on real life experiences which lends to its credibility.  It is an easy read and presents the subject matter in relatable stories.  I highly recommend it for anyone in a managerial position whether you are in sales or in another type of management position.", "images": [], "asin": "164111827X", "parent_asin": "164111827X", "user_id": "AECWEP6BSOJX752DNN3TZN7XRAJQ", "timestamp": 1598042277646, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "too hard to use!", "images": [], "asin": "B000SEGJ5S", "parent_asin": "B000SEGJ5S", "user_id": "AE6CHXYSJJMBEQ3FW7CAHGEZHS4Q", "timestamp": 1485128608000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "This is a great book if you want to learn about finishing wood", "text": "I really like Bob Flexner's writing and I enjoy his articles in Popular Woodworking so I decided to order this book since finishing is what I struggle with the most. I have a few other books on finishing but I definitely like this book the best. I really like how he beaks down the process and simplifies it so that I can understand what is necessary and what isn't. And he covers every type of finish and all the pros and cons. There is just the right amount of detail and the table of contents and index are detailed enough that I can use this as a reference book after I finished reading it.", "images": [], "asin": "1565235487", "parent_asin": "1565235487", "user_id": "AFA7BG6M6QG6GCY67AWNTMFIF2HQ", "timestamp": 1370538282000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "So glad I have it now", "text": "Been waiting to buy this for awhile.  So glad I have it now.  I'm learning from the best.", "images": [], "asin": "1612120059", "parent_asin": "1612120059", "user_id": "AHDQ5GJST6UBZY2IOXY7PJTFZ74A", "timestamp": 1517784688389, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Awesome book", "text": "Great deal", "images": [], "asin": "0425287181", "parent_asin": "0425287181", "user_id": "AF6BUWX7VHNMVIEPLDIOCCZFIY5A", "timestamp": 1569270178557, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Dissapointing", "text": "For me, this book becomes more and more irritating the more I read it.<br />The drawing for tip 94 bares no relationship to the tip. One talks about leg strength while the drawing appears to be about using a wall for club head position. The drawing for tip 97 mentions teeing up on the right side, 'aim for the left' and 'you can now fade the ball', yet the drawing shows the ball flight to the left, surely a draw or hook?<br />Tip 83 \"Bermuda Grain\". \"The more pronounced the grain, the more you'll have to account for it on your read and in your stroke\". Thanks for that.<br />While the drawings are suburb in that Readers Digest 1950's way I am yet to be convinced that they are enough to really clarify the tip sometimes. Golf tips at best are often contradictory and perhaps more than realised, not neccessarily suitable for your type of body mechanics, particularly swing tips. After reading this book several times I am left wanting.", "images": [], "asin": "0789315467", "parent_asin": "0789315467", "user_id": "AECSDT6GIGPWEU7WACB2JL5R56DQ", "timestamp": 1201389098000, "helpful_vote": 4, "verified_purchase": false}
