{"label": 0, "rating": 3.0, "title": "It has some very good points", "text": "The bar was set high for this book (in my mind that is) and the writing hit the mark, however, there were things about the story and characters that I just really wasn't all that much of a fan of.<br />This one was a tough call. I had moments where I would have rated this very high and times I would have rated it lower. I landed on a three. Jane is a down on her luck dog walker/petty thief in the very wealthy gated community of Thornfield Estates. She likes to pocket the little trinkets her dog walking clientele leave laying around knowing they'll not miss them. Nor will they care that Jane isn't even her real name. One day she is gawking and nearly gets struck down by the fabulously wealthy, and recently widowed after his wife died in a boat accident, Eddie Rochester. As they grow closer, Jane begins to feel a bit freaked out by the memory of his wife, Bea, and worries about both his and her own past catching up.<br />This is alright. It definitely draws inspiration from the tale from which I'm sure you've guessed. Though I'd stop at that. Don't go into it thinking it's too similar. Although the book is good, the characters were just so unlikable. I guess they were supposed to be but dang! Who to root for? I don't know. Due to that, I really didn't enjoy the better part of it and I wasn't that big of a fan of the end. Now, I am quite negative here but there were also good things. As mentioned, the writing is good. The story is pretty good, just something wasn't there. I just couldn't love it.<br />I do recommend you give this one a try if you are at all interested in it. There are mixed reviews and you may be one of those who really enjoy this book and I would hate for you to miss out on it, just in case!", "images": [], "asin": "1250245494", "parent_asin": "1250245494", "user_id": "AHWCZ47A7FIYEJ7KEJG3BO3F5YXQ", "timestamp": 1612119482046, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Complicated", "text": "I bought this book to assist with my homeschool curriculum. It is really complicated. The wording is difficult and it is way over the heads of my children.  I dont recommend this book for teaching children.", "images": [], "asin": "1426211686", "parent_asin": "1426211686", "user_id": "AEA4YZZVOU5TXKQIBP2HJPJ4O6BQ", "timestamp": 1634655016842, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "A cute story", "text": "(3.5)<br />This book is great for anyone who misses/missed the summer 2020 Olympics since they were canceled. This fictional account is the journey of one girls attempt to get there, but really it's mostly about the coaches, but the 2020 Olympics are the goal.<br />Avery Abrams trained most of her life as a gymnast all to make the best Olympic gymnastics team there was. However, when something bad happened her dreams were over and she didn't make it. Her best friend did though. Jasmine didn't just make the team. She also married their coach. Their incredibly verbally abusive coach. Causing a big rift in their long friendship. Her current situation has her suffering a bad breakup from her famous footballer boyfriend and moving back home. Hope seems lost but what kind of story would that be? Not this one! She soon finds herself in promising position as assistant coach to an old crush. The girl they are coaching is so good there is an excellent shot at the Olympics. That's about what I'll tell you I think. The rest of the story unfolds as you read it and follow the lives of all those above and get to see how it all turns out. Of course there are a lot of things that go wrong for a different people here and there but... well, you'll see.<br />This is a well written story with characters you'll enjoy spending time with. I thought some of the things that happened were a bit over the top in some ways but in the end when I put the book down and walked away I knew I'd regard it with fond memories down the road.<br />If it sounds like something you would be interested in by the synopsis at the top and the reviews left, I'd definitely recommend it to you!", "images": [], "asin": "1982121475", "parent_asin": "1982121475", "user_id": "AHWCZ47A7FIYEJ7KEJG3BO3F5YXQ", "timestamp": 1598022316846, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "jackie deserved better, this books a no go", "text": "I love Formula 1 have been following it for over forty years, and Jackie is one of my favorite drivers, but this book doesn't do the Flying Scott justice. Poor prose and almost all photos are black and white. I recommend passing on this book.", "images": [], "asin": "1859604366", "parent_asin": "1859604366", "user_id": "AFXC6CK3UBNPWS2WFLOZZYJFV7LA", "timestamp": 1409361212000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It started out great", "text": "***spoilers abound****<br /><br />*<br />*<br /><br />*<br />*<br /><br />But then the twists happened. It seemed like bishop was trying too hard to make it shocking but it backfired. Sure, it wasn't what I expected, but it was messy and I felt like I was watching some bad lifetime movie.", "images": [], "asin": "B07YNJ2JZM", "parent_asin": "B07YNJ2JZM", "user_id": "AFPPFTA2XAIBENWVIKHSKA5PFZ5A", "timestamp": 1627858607258, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "Hated", "images": [], "asin": "B00YF8TIRY", "parent_asin": "B00YF8TIRY", "user_id": "AH5CPD5THSHZRQ7RKW2K7X6RIAHQ", "timestamp": 1485707502000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Not for me", "text": "Terribly boring.  Flat characters.  Got half way through and couldn't continue.", "images": [], "asin": "0345443284", "parent_asin": "0345443284", "user_id": "AHYYNTUYOY643QKQNBOOZGNZSD6A", "timestamp": 1498927289638, "helpful_vote": 7, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "I'm not very impressed with the layout and organization of this book", "images": [], "asin": "1133018211", "parent_asin": "1133018211", "user_id": "AG5RYRWEGJHHZ6CU5BHOKPHXWAGQ", "timestamp": 1467650077000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Missing all the still lifes. Not impressed.", "text": "How can you not include Picasso's still lifes?? I'm sad.", "images": [], "asin": "3822872210", "parent_asin": "3822872210", "user_id": "AH4SYARCDRCRIXIAVKAODBLWUPRA", "timestamp": 1649969929992, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "For those who want their boys to know they can be a xenobiologist", "text": "What do I like about this book: sturdy pages that can stand up to the wear and tear of being in little hands and illustrations that are colorful and engaging. What I don't like: this is a board book for little kids, for crying out loud.; it's an ABC book--what child knows what an environmental engineer or a quantum physicist or a xenobiologist or wants to know what they are. The book explains these vocations, but the subject matter is too advanced. I do like it that this book dignifies all professions and let's boys know they can have untypical careers, but I think this book is primarily written for parents, not the kids. There are other ABC books that are more appealing and understandable for pre-schoolers. My favorite is Jonny Lambert's Animal ABC. Check it out for another alternative.", "images": [], "asin": "1633227243", "parent_asin": "1633227243", "user_id": "AFEP23NFXJI3T44Q4XC55NT6COAQ", "timestamp": 1572830767785, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Nah didn’t like it so much.", "text": "My first impression was is this book from 1970? It comes off as dated and some of the mazes are already intentionally done. Weird!", "images": [], "asin": "1723500828", "parent_asin": "1723500828", "user_id": "AHXPTNSSZU5XADQW7FJHDLASQBFQ", "timestamp": 1607545021407, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Ask about paper stock", "text": "I have 2 other Basford books but this one is on a different paper stock. It's waxy so you have to go over and over with the markers to get bold colors. Very disappointed & not at all like the others.", "images": [], "asin": "1780671067", "parent_asin": "1780671067", "user_id": "AFDS7HDI32LUYRVJT6XRBKFLERTA", "timestamp": 1470856446000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "A Good Astronomy Intro for the Basics", "text": "This book provides a good introduction to our solar system, the sun and stars, galaxies, nebulae and other core astronomical topics. If you're looking for concise coverage on basic astronomy, this well-written and nicely illustrated magazine will fill the bill. Unfortunately, as the topics expand to dark matter, black holes, and the Big Bang Theory, the compact coverage falls short. Some topics are just too complex to be adequately summarized in a couple of pages--especially when two thirds of that space is illustrations. This book can definitely fill a place on the novice's bookshelf, but for a better introduction to the more theoretical topics at an entry level I would suggest \"Astronomy For Dummies\" (don't be offended) which provides a high enough level of detail to address these subjects.", "images": [], "asin": "1547844604", "parent_asin": "1547844604", "user_id": "AGCGJQ43IWVM5WJKGTFF3GIRCXWQ", "timestamp": 1557793865674, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Ripped Off Reading", "text": "These ‘book shots’ are a despicable method of marketing. Please, give me the whole story, from beginning to the end. Fortunately, I am aware now, and won’t purchase anymore.", "images": [], "asin": "0316317152", "parent_asin": "0316317152", "user_id": "AHBPZK242CCCQRD6VDAPDHJFJB5A", "timestamp": 1550530656141, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Dark but interesting", "text": "3.5 stars<br /><br />Right away, if you love Edgar Allan Poe, you may find yourself doing a bit of a head-scratcher at this novel. The basis of this book is interesting. There is a bit of Jekyll and Hyde, a feeling of Frankenstein in the sections that deal with reanimation, and a love story of sorts in between. The unusual main character which has a very mixed cultural background brought a lot to this story, in my opinion, making in unique in yet another way.<br /><br />Impressive descriptions of the city and the especially the shops led the way to interesting connections with the family at the centre of this novel. I particularly liked the good vs. evil feeling of a character more or less struggling to gain control over their own demons.<br /><br />I did feel that this book had steep drop offs where the every day actions of the characters took over the story for pages at a time. The novel redeemed itself whenever something exciting would happen, but there are some rather long stretches where nothing much is going on.<br /><br />The author does a good job of painting a background for her characters that is both believable and enticing. She raises questions about them throughout this novel, never answering them all at the end. There is definitely room for another book, if one has not been written already.<br /><br />Some liberties were certainly taken with the rearranging of facts and dates to accommodate the needs of the writer, but I think for the most part it worked pretty well.<br /><br />Overall, I thought this was an intriguing story and a book that fans of Gothic literature will be happy to check out for themselves.<br /><br />This review is based on a complimentary copy from Netgalley and the publisher.", "images": [], "asin": "1606844636", "parent_asin": "1606844636", "user_id": "AFDNLNTANUGENK62RSTAQALJOWPQ", "timestamp": 1410302940000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Good Content, Terrible Production Value", "text": "Great tool but terrible production quality. You could do better by getting a PDF of the document, sending it to FedEx or Staples or etc. and having it printed, laminated, and spiral bound. This is like a bad color copy of an original document.", "images": [], "asin": "1564727297", "parent_asin": "1564727297", "user_id": "AGRX4BMR2X5JBAOHFU6R6NHHSGFA", "timestamp": 1410148937000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Dilemma", "text": "A teenager is brutally attacked and sexually assaulted, sending shock waves through her affluent community. Her parents agree to the administration of an experimental drug that is designed to wipe the traumatic memories from the girl's consciousness. Naturally this throws a monkey wrench in efforts to apprehend the perpetrator. And while it seems to work, it fails to address cellular and subconscious recall. Ultimately , it drives the girl to seek to undo the forgotten events. she winds up in the office of a psychiatrist with fingers in many pies.<br /><br />Despite a promising premise, this book was a disappointment. The narration is tiring and long winded. generally, the handling of PTSD and the friendship between Jenny the rape victim and Sean, a veteran and amputee, was convincing. However the story of Jenny's bickering parents was silly and distracting. And the omniscient psychiatrist strained belief. The story was aggravating from a legal perspective. It rendered Jenny useless as a witness and certainly suggested that she lacked the inner resources to deal with the trauma. That being said, it is an intriguing story with interesting psychological issues.  It is however bogged down by side stories and a less than riveting narration.", "images": [], "asin": "1250097916", "parent_asin": "1250097916", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1465869843000, "helpful_vote": 51, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Good product", "text": "Nice product for my grand daughter.  She loves stickers and this allows her to take it in the car.  Mom uses these for small rewards.", "images": [], "asin": "048627358X", "parent_asin": "048627358X", "user_id": "AF5F5QFFRWZAA5BWDZ5ERJ6RO7RQ", "timestamp": 1385833811000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "60 Self-Adhesive Stickers", "text": "The DK Shark Tale Essential Guide and the Ultimate Sticker book will interest Shark Tale fans. These stickers can be stuck down and then peeled off again so you can use the stickers to decorate books or toys.<br /><br />There are four pages of stickers and pages with captions where you can keep the stickers organized according to themes.<br /><br />Not suitable for children under 36 months.<br /><br />~The Rebecca Review", "images": [], "asin": "0756605539", "parent_asin": "0756605539", "user_id": "AGWDYYVVWM3DC3CASUZKXK67G6IA", "timestamp": 1106465308000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Didn't laugh once", "text": "Very sophomoric humor.  Most laugh-out-loud humor books seem to descend to this place.  Once I got the hang of the giggly humor involved in this book, I stopped reading.  I don't think I laughed once.", "images": [], "asin": "0758252420", "parent_asin": "0758252420", "user_id": "AEPX24FHSVA3LKW42LFGEHOFYBSA", "timestamp": 1532999989747, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good story", "text": "This book wasn't near as scary as I had hoped it would be.  The storyline was basically typical of any ghost stories that revolve around children.  Good for people who are more into mild scary stories.", "images": [], "asin": "0547028644", "parent_asin": "0547028644", "user_id": "AE3YZDNI3TL6H3VHXXUDHN3JAZFQ", "timestamp": 1381724508000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not wonderful, but OK", "text": "Andrew Gross is a good writer but gets bogged down in his story-telling.  Also, the bad guy characters are pretty unbelievable in my opinion.  Pretty much all are one-dimensional and not very interesting.  Other raters have hashed out the dual plots, so I will just say this book presents a good example of how one foolish action can have multiple unhappy consequences.", "images": [], "asin": "0061655988", "parent_asin": "0061655988", "user_id": "AFT6NKVPX6IKUPEMEIRLMICXAJEA", "timestamp": 1373459715000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "I love my state and collect these little books about the ...", "text": "I love my state and collect these little books about the different locations. In fact, I got two for Christmas, the latest on Oklahoma City and this one about Stillwater. It's petty good, interesting, especially since I spent a lot of time there back some years ago when I had family living there. But I sure was surprised to see an error, especially since it was a chapter heading. It looks like real research wasn't done but just copied for other places where original errors were made. It concerns the quote that the Sonic actually began in Stillwater rather than in Shawnee as it actually did. The authors are correct in that the first SIGN reading &#34;Sonic&#34; did appear in Stillwater but the first drive-in restaurant itself was definitely in Shawnee. And the Top Hat, as it says in the book, was not a chain. There was one little drive-in hamburger joint in Shawnee in front of a restaurant, the Log House, and owned by the same two guys, Troy Smith and Joe McKimmey. They started their venture about 1954. Troy wanted to concentrate on the drive-in and use a new concept he'd seen in California, the electronic speaker. Joe wanted to stick with the restaurant so the he bought out Troy. They couldn't use the Top Hat name because they discovered a couple of others places already named that, which had nothing to do with Troy's business, so he coined the name &#34;Sonic.&#34; He was building the one in Shawnee when he also bought a place in Stillwater and they got the first &#34;signage.&#34; In 1959 through early '60s both the Top Hat and the Sonic were in existence. I know this because my dad was a one time law partner with Joe McKimmey who was going to law school while he ran the Log House restaurant. Even the Sonic web page has much of this incorrect when they say the Top Hat morphed into the Sonic. It did not. What I'm wondering is if this is poorly researched and incorrectly printed, what else is?", "images": [], "asin": "1467113107", "parent_asin": "1467113107", "user_id": "AG5DNSBV35NKFS3HQ7KUFNI45BSA", "timestamp": 1423098446000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Outdated with too much repetition", "text": "Super disappointed with this book. Claims to be the most recent version (2015) but I actually think a cover has been placed on an older version. Text refers to US Airways (no longer in operation) and things &#34;being built in 2012&#34;. The photos are all fuzzy, and there is a LOT of repetition throughout the book. This is why I always buy Lonely Planet, and not Fodor's. Bummer LP don't have a Cayman guide. I won't buy Fodor's again.", "images": [], "asin": "0804143501", "parent_asin": "0804143501", "user_id": "AENSDEZUPLBQTRH4RIYHQ77EB34Q", "timestamp": 1497008495653, "helpful_vote": 8, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Boring, not what I was expecting.", "text": "What a disappointment ;( I was hoping to get more effective how to’s and what to do instead of... but this book is just a VERY very long Bible lecture and boring stories. Waste of money for me but apparently lots of others think this book is worth reading.", "images": [], "asin": "0768427398", "parent_asin": "0768427398", "user_id": "AF5AZI66PPWCW7452CQ5UIWUM4OQ", "timestamp": 1569433726366, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "A bit disappointing", "text": "I have mixed feelings about this book, but ultimately feel that it doesn't offer much advantage over the manuals that come with Final Cut, in fact a lot of it is lifted almost verbatim from the manuals, just doesn't include all the detail.  I was hoping for something that could get me up and running fast and then provide answers to questions and problems that come up.  But this book takes 275 pages before it gets to editing a single frame and I found that for most answers I needed to turn to the manual anyway.  Also the book doesn't address any of the other programs that come with Final Cut Studio and almost treats them like they don't exist (for instance for DVD authoring it tells you to use iDVD when the much more powerful DVD Studio Pro is included with your Final Cut software.  I guess if you don't have a hardcopy of the manual it could be useful to have this book, but for me I think it was a waist of money.", "images": [], "asin": "0321350251", "parent_asin": "0321350251", "user_id": "AFIGB44OAEOBQPBWTN72C3NAOURA", "timestamp": 1237226576000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Ok", "images": [], "asin": "B013WVLMDM", "parent_asin": "B013WVLMDM", "user_id": "AE3LWVRODXB6PBRK46NUKCIU5RNQ", "timestamp": 1468267878000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not subtle hilarity", "text": "Humor is a very individual thing.  I found this book very sophomoric and not very funny.  I'm a fan of British comedies and other subtle hilarity.  That should give you a clue about whether &#34;Baggage&#34; is for you.", "images": [], "asin": "1250025087", "parent_asin": "1250025087", "user_id": "AEPX24FHSVA3LKW42LFGEHOFYBSA", "timestamp": 1441046196000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "disappointing", "text": "While the rooms were individualistic many were not laid out for the best function or comfort. The kitchens in particular were poor. One had a large sink for &#34;show&#34; that didn't have any landing space on either side to put dirty or clean dishes or food. That was just bizarre and pretentious.", "images": [], "asin": "B0064BXC86", "parent_asin": "B0064BXC86", "user_id": "AGRBRFKSH346XAERWP7UXMFL7U6Q", "timestamp": 1408891595000, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Yahoos With Machine Guns", "text": "RECKLESS ABANDON<br />A Stone Barrington Novel<br />Stuart Woods<br />Everybody is in cahoots with everybody else. And they are also opposed to everyone else. This complicated plot is about a Florida police chief who wants her mass murderer brought back home to face trial. FBI, CIA, Homeland Security, local, city, and county law enforcement agencies complicate matters. And Witness Security is only part of the problem. <br />Barrington of course, is smart, wealthy and always gets the girl, but Holly's father is a piece of work and I wanted to see a lot more of him. (\"Why do these yahoos always think they need machine guns?\")<br />There is no one to trust. Even the Flight Control folks can't help, but at least the airport dialogue sounds authentic.<br />This author turns in interesting circles. He even understands the effects of high altitude in Santa Fe on low altitude folks from the coast! I'm impressed, even though the flimsy, witty dialogue leads me to expect less. ", "images": [], "asin": "B000OIZUYY", "parent_asin": "B000OIZUYY", "user_id": "AF62AEIOEKVHHD4XH2ID7PXWB7AQ", "timestamp": 1582826054871, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "OK But Not Great", "text": "I haven't read any of her other work, but judged as a mystery and a horse novel it was OK. I wasn't particularly impressed by the plotline as it tended to be slow in many places. The ending, however, was an excellent surprise. This isn't a bad book, but I wouldn't read it again.", "images": [], "asin": "0449149684", "parent_asin": "0449149684", "user_id": "AFG6OPVUQCZKY6GVP6A2PR6PJVUQ", "timestamp": 988433242000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Alternative eating - beginning", "text": "This is a nice book but uses too much sugar in their recipes.  One could opt for other sweetners of their choice, but if you are new to the better diet concept, I would not recommend this book.  There are many good sounding recipes for those who now how to replace all the sugar used in these recipes, but cannot suggest this book for a healthier eating experience.", "images": [], "asin": "0983559406", "parent_asin": "0983559406", "user_id": "AGRJTZA47FMY3WO7SA4ORRYWIKRA", "timestamp": 1404313342000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "More of a Sleeper than a Beauty", "text": "When readers complain about the predictability of a Mary Higgins Clark and Alafair Burke collaboration, I am left shaking my head. The &#34;Under Suspicion&#34; books are indeed a series, so just like watching &#34;NCIS&#34; or &#34;Law and Order&#34; on television, you pretty much know what you are going to get. Isn't that partly why we read or watch a series? Having said that, this third installment of the &#34;Under Suspicion&#34; series is not my favorite.<br /><br />I didn't mind having a good idea in the first chapter  who the guilty party was going to be. In fact, I get a kick out of forming a theory early on and then testing it against plot developments. But one of the supposedly big &#34;a ha!&#34; moments in the book concerning a piece of evidence from a trial was especially disappointing. As a &#34;smoking gun,&#34; it was very unconvincing.<br /><br />There was a &#34;red herring&#34; of a potential perpetrator that was good enough to make me doubt my original pick of the culprit, and  I was entertained by the introduction of a  new regular in the fictional television series investigative team, but the denouement  of the book was very unfulfilling. I realize that it was intended to create suspense for the next book, but when a beloved character resorts to callous and insensitive  manipulation, I can't enjoy reading it. And having said that, I will admit that I will be all in for the next installment.", "images": [], "asin": "1501108581", "parent_asin": "1501108581", "user_id": "AGVDZINSDI7FQ2X7TNGH57D3X5YQ", "timestamp": 1481519083000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Mucky love story touted as historical fiction", "text": "You’d think experiencing Dec. 7th bombing of Pearl Harbor and the resulting participation in the war effort would be enough for a plot—instead this is a cliche, purple prose romance cloaked within a time period.", "images": [], "asin": "B08FYN6XMB", "parent_asin": "B08FYN6XMB", "user_id": "AHKH4V3OLINUDTG2CNUO26UW4O3A", "timestamp": 1637684147201, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "presidents out of the limelight", "text": "book was not current...loutdated...", "images": [], "asin": "0671879200", "parent_asin": "0671879200", "user_id": "AG6OQAWUS2XU25N4W6RVLOZNJSUA", "timestamp": 1603324331011, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "NIce book.", "text": "I thought this would be a great book but was disapointed.  The tags don't have any texture on them so my son doesn't really care about it.", "images": [], "asin": "0439537711", "parent_asin": "0439537711", "user_id": "AHTD5QY25B6TEMHPY3KZK5KZPIGQ", "timestamp": 1192186774000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Nice pictures", "text": "It is a nice book but not what I had hoped for. Lovely pictures but no architecural designs that I had hoped for.", "images": [], "asin": "0847817156", "parent_asin": "0847817156", "user_id": "AGACSQYZH5AMVT7SHSRPKES7KG5A", "timestamp": 1388060596000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "love the movie better", "images": [], "asin": "0877478147", "parent_asin": "0877478147", "user_id": "AGEDO7V5DDRRKWOBJ5IIZOSFKX2Q", "timestamp": 1479913171000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "I did not purchase the 2013 edition of this book", "text": "I purchased the 2011 book and found it rather useful, but had errors. When studying for the CCS, it is helpful if the information and answers to review questions are correct. If the answers are incorrect, the book is useless. And could mislead you into having incorrect information and fail the CCS. Considering the cost of books and registration for this exam, I would be careful and choose wisely. Pick a different book to study from.", "images": [], "asin": "1133608337", "parent_asin": "1133608337", "user_id": "AEE5BXRBXRGG3H262OWZWSFJSCJQ", "timestamp": 1374185705000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "A boring waste of money", "text": "I didn't think I would ever finish this book.  It was very slow, boring reading because nothing ever really seemed to happen.  I thought something exciting was finally going to happen around page 300, but even that was a letdown.  I would not recommend this to any fan of the old Stephen King books.  I read that Stephen King is going to quit writing books and I can see why.  I haven't liked any of his later books; has he run out of decent ideas?  It seems his books sell because of his name alone; definitely not by their content.  I won't bother with his next one-if there is one.", "images": [], "asin": "0743211375", "parent_asin": "0743211375", "user_id": "AGZNG7P7KVFZQWKTF6LRGWZ5D5GQ", "timestamp": 1037226724000, "helpful_vote": 4, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Three Stars", "text": "good product nice shape.", "images": [], "asin": "1594250537", "parent_asin": "1594250537", "user_id": "AEUE523B4M6367SGQD4Q5NPKAZCQ", "timestamp": 1503142763898, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not good. Otherwise", "text": "Cute story, but why is it chocolate given to the dog?? Not good. Otherwise, a cute story.", "images": [], "asin": "8416733341", "parent_asin": "8416733341", "user_id": "AEI77FRGYVNL3P7GNBBK76XHCU5A", "timestamp": 1546542510650, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Three Stars", "text": "good", "images": [], "asin": "0679745580", "parent_asin": "0679745580", "user_id": "AGL4RG5EUZQWO6RNJNDUUA6SNSXA", "timestamp": 1453474546000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good start bogged down with too many lies and deceptions", "text": "I haven't read a Diane Chamberlain book in a long time, back to when her books got too dark for me.  However, this books sounded like it might be good, so I decided to try it.  The main character, Riley MacPherson, goes home to settle her recently deceased fathers affairs and through that process decides to try to uncover the truth behind her sister's suicide more than 20 years ago.  I had a hard time connecting with Riley because she seemed to emotionally flaky.  She kept telling people that she was a competent counselor, yet she seemed incapable of understanding people's motivations (especially those of her brother who suffers from PTSD) and of dealing with people who are unpleasant to her.<br /><br />Following her father's death, she returns to her childhood home to settle his affairs, which sets off a chain of events that ultimately exposes a tangled web of deceptions.  It seemed like everyone other that poor Riley was out to deceive everyone around them, especially her.  And, she couldn't seem to summon the gumption to deal with the situations honestly or above board either.<br /><br />Yet, I still enjoyed the book on some level.  The book initially drew me in and engaged me.  I just grew weary of all the lies, deceptions, and unlikable people.  Would I recommend the book?  If you are a Diane Chamberlain fan, yes.  Otherwise, not if you don't like dark dramas where people don't seem to act in a true or realistic manner.", "images": [], "asin": "1250010713", "parent_asin": "1250010713", "user_id": "AELMGVQANXHWWVB3KQKXHPETGZDQ", "timestamp": 1410988435000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Nice looking book, but meal prep concept isn’t for us.", "text": "The idea of meal prep sounded interesting.<br /><br /> But after going through this book, we recognize that the concept isn’t for us.<br /><br /> It’s just the two of us and we have fairly simple tastes.<br /><br /> The recipes here are often feature ingredients not to our liking and there is far too much repetition.<br /><br /> For example I am looking at one week right now that has Italian Breakfast Frittata for breakfast all seven days. Baked Tilapia three times. (Reheated fish? No thank you.) Mediterranean Chicken and Chicken Souvlaki four times each.<br /><br /> Strikes me as dull, even institutional.<br /><br /> Might work well for some, but not for us.<br /><br />Jerry", "images": [], "asin": "1465464867", "parent_asin": "1465464867", "user_id": "AHMNA5UK3V66O2V3DZSBJA4FYMOA", "timestamp": 1525407419801, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Disappointed!", "text": "Overall disappointed,  a number of the regular Texas birds were missing and several of the photos were less than expected. Not worth the money.", "images": [], "asin": "1935622536", "parent_asin": "1935622536", "user_id": "AE5TB5M7BMXERTFNH334UCCM6H5Q", "timestamp": 1493265262000, "helpful_vote": 4, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good enough to explain the topic but not good enough ...", "text": "Purchased as a textbook for a class.  Good enough to explain the topic but not good enough to keep as a reference book.", "images": [], "asin": "0470050829", "parent_asin": "0470050829", "user_id": "AEAV4IBJVRZO3NFOUAMASYXJMTDA", "timestamp": 1425223751000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Psuedo-history", "text": "In \"Jamestown True Heroes\" (1977) quasi-historian Arthur Waldo expands on his earlier pamphlet, \"First Poles in America\" (1957). \"Jamestown True Heroes\" is over 250 pages and contains a wealth of photos and illustrations. Much of the information is based upon the mysterious and controversial Memorialum Commercatoris manuscript, supposedly written by a Zbigniew Stefanski, alleged to have been one of the original Jamestown Poles. As the story goes, an individual offered to sell the privately published manuscript to the Polish Museum of Chicago, where Waldo was able to view it. We're told the deal ultimately fell through and the mysterious manuscript was withdrawn, never to be seen again. Polish American historians have their serious doubts about the veracity of Waldo's account of this missing manuscript and its contents.<br /><br />From this extremely dubious source Waldo presents the names and backgrounds of the Jamestown Poles, their experiences as glassmakers, homebuilders, and well-diggers along with an account of the Poles saving settlement leader, Captain John Smith, from an Indian attack. The reader is led to conclude that the Jamestown colony had absolutely no chance of survival were it not for those five talented and virtuous Poles. Waldo goes on to make the correlation that, since the Poles saved Jamestown, and without Jamestown, there would have been no Plymouth, the Poles are responsible for the existence of America!<br /><br />I haven't witnessed such a degree of unabashed and baseless ethnic pride since watching Michael Constantine play Papa Gus in \"My Big Fat Greek Wedding.\"<br /><br />\"Jamestown True Heroes\" is sheer psuedo-history, folks, and another glaring example of Polish chauvinism gone wild. As might be expected, the sectarian Polish American press continues to publish the information from Waldo's discredited account as fact.", "images": [], "asin": "B0006CURLY", "parent_asin": "B0006CURLY", "user_id": "AEBMSOQLX55ISSFOJT37IYIMIQGQ", "timestamp": 1270388014000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Inscrutable on some level. Not for those looking for easy guidance.", "text": "Makes references to numbers for lines (other than 1-6) without any explanation as to their meaning, at least not that I saw reading through the preface.", "images": [], "asin": "069109750X", "parent_asin": "069109750X", "user_id": "AFOQGB4NF655NFOB7Z7DKI2NPRBQ", "timestamp": 1610925241062, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Authentic recipes?", "text": "Souffle?  Really?  I can not imagine that in any appalachian kitchen.  The deviled eggs are listed as having olives.  Huh?  Where did these recipes come from?  It appears that the stories are from the Foxfire books, of which I am a great fan, but the actual recipes just don't make any sense.", "images": [], "asin": "0517218135", "parent_asin": "0517218135", "user_id": "AFOI6OXLDZJ3FYP5RWFQNWJTEPWA", "timestamp": 1341969660000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Look further", "text": "I sent this back—it’s terribly dumbed down", "images": [], "asin": "1798671204", "parent_asin": "1798671204", "user_id": "AHKH4V3OLINUDTG2CNUO26UW4O3A", "timestamp": 1569104161134, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Started off James Bond-esque ended Austin Powers-esque. Oh, behave.", "text": "Dr. Evil stole a nuclear weapon and is demanding a payment of 100 billion dollars. Can Austin Powers stop this madman? Muahahahaha!<br /><br />This book was laughable but not in a funny way. Poorly written. A bad story told in a bad way. Bland characters with weak dialogue and a weak plot. They traced a call from the president to a warehouse in Switzerland. They recon the warehouse and find one man is tied to a chair. A trap? Ya think?! Why didn't enter the warehouse with a remote controlled drone? Authors should have taken the time to think the plot out thoroughly and focused on crisper dialogue.<br />Not an improvement from book one 'Awakened', also two stars. A syfy movie with second rate actors and a third rate script.. Only 223 pages but not a book i would recommend. Go watch an episode of Impractical Jokers.", "images": [], "asin": "0062868969", "parent_asin": "0062868969", "user_id": "AEYUTWRDI6DZWLXIH45QPEXKKOAA", "timestamp": 1562185340435, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "PERVERSE BABBLE", "text": "In my opinion, the novel is nothing more than nonsensical, incoherent ramblings, void of all logic & common sense, that moved along with infuriating sluggishness.", "images": [], "asin": "0062364774", "parent_asin": "0062364774", "user_id": "AHHBAGQYRP4XWVCDF6LWHCGQHOQQ", "timestamp": 1434383168000, "helpful_vote": 12, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Don't buy, download directly from USPTO", "text": "No value in buying this large and expensive book. You can download, for free, a searchable PDF directly from the USPTO web site.<br /><br />www.uspto.gov/web/offices/pac/mpep/", "images": [], "asin": "1500927546", "parent_asin": "1500927546", "user_id": "AHFIVVYAXVXAHWC3ZCE6X63WLGFQ", "timestamp": 1434560332000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Lost Me in the Introduction", "text": "When the author tells me, the reader, that must people go to homesteading because of food, I want to know the source of that information.  That certainly sounds subjective to me.  Most folks I know who ended up \"off grid\" did it because they were tired of the rat race.  It has NOTHING to do with food.<br /><br />Getting behind that.  Calling this an introduction is akin to saying once you know the letters in the alphabet you can read.  No, you merely can identify the letters in the alphabet.  Take for instance the author's chapter on livestock.  He tells the reader to keep in mind how much land each animal requires but says nothing about how much they DO require.  Can you raise 2 cows on the same amount of land you can raise a flock of chickens or herd of goats?  Of course not.  Let the reader know!", "images": [], "asin": "B00M22CZ5C", "parent_asin": "B00M22CZ5C", "user_id": "AHJ3S3V3XBCJZFF7EE4RALKBJPPQ", "timestamp": 1529559225902, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "unfortunately really bad", "text": "If the first Monk book had been this bad, I'd never had read another.<br />Most problematic was the trial toward the end. McNab, the villain, while being questioned by the prosecutor, stated as a fact that the defendant was guilty. And Sir Oliver didn't object!. Later in the trial he again doesn't object when the prosecutor stated that the defendant was guilty. This wasn't during his opening or closing arguments so clearly was out of order.<br />And the section of the book after the trial was completely ridiculous.<br />Back near the beginning, the author had Monk and his chief assistant go after an escaped prisoner with no idea what he looked like, allowing him to escape. And the book was 2/3 over before Monk thought to ask his former boss why McNab hated him. It was obvious to me much earlier and I'm no hotshot detective.<br /><br />On the other hand Monk did less introspection about his life before the amnesia than I was expecting, based on other reviews.", "images": [], "asin": "1101886374", "parent_asin": "1101886374", "user_id": "AFEUXFPQ3FWDKDMSKO775AIRVN5A", "timestamp": 1616926756439, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Code of Life, NOT!", "text": "I found this one big advertisement for a product that probably isn't what it claims.  I hate being advertised to and made to pay for the advertisement.  the book was one big hype", "images": [], "asin": "1427622280", "parent_asin": "1427622280", "user_id": "AE6CDFKMV5ZVNRRSWHBJNOGFP5EQ", "timestamp": 1379968207000, "helpful_vote": 12, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "the book is amazing the quality is not", "text": "the book itself is amazing! not only will i be using it to teach my child but for family members who try to force affection as well. the reason i took stars off is because the thick pages are all so close to splitting. they werent glued together very well:/ but the book itself is still worth the purchase i just wish the quality had been better", "images": [], "asin": "0999890808", "parent_asin": "0999890808", "user_id": "AEJDJRX3OAEXUY6WFXRAJQCVFDMQ", "timestamp": 1631545232803, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Quick read", "text": "Thank you NetGalley and Griffith Moon Publishing for this early copy.<br /><br />This was equal parts funny and terrifying.<br />I adore the fact that he made this in order to donate all profits to charities that got screwed by Trump.<br />That is truly winning", "images": [], "asin": "0999845284", "parent_asin": "0999845284", "user_id": "AG3BG56YCAEW333N3PNXIEALYDQQ", "timestamp": 1536575035186, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Good story ruined by terrible performance; several mispronounced words", "text": "Patterson is a great writer. I like the plot but this is an audiobook - the performance matters. This book is ruined by the voice actor's poor performance. There are SEVERAL mispronounced words. How does that happen? How did no one catch all the words that were pronounced wrong? They should be embarrassed. The book is full of drama... and they mispronounced \"Drama\".<br />People who purchased, deserve a refund.", "images": [], "asin": "B07MHSNPSG", "parent_asin": "B07MHSNPSG", "user_id": "AEYCULS5LPJRLWP6YDSNZHLX4LOQ", "timestamp": 1562054640194, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Pages lifted right from the other books", "text": "What in the tarnation is this mess? This isn't a \"new\" Harry Potter book. The Cursed Child is just rehashing of old Potter stories, verbatim!! I am so disgusted by the writing. No imagination. The character Albus is a prat and and one of the most unlikeable characters I've encountered in the potter-verse.  I really hate to waste my time and this one wasted a few hours of my life. I hate I read it. I hope I can forget this one.", "images": [], "asin": "133821666X", "parent_asin": "133821666X", "user_id": "AGYUTSPNXU2J3DPMDDYTIG7MBSRQ", "timestamp": 1597866107368, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Alright", "text": "I enjoyed this, but the middle was a bit long. I think if you're looking for a movie star type romance there are better books, but it was still good.", "images": [], "asin": "0553498010", "parent_asin": "0553498010", "user_id": "AEXBLWGUQZTUJIIPE2IZ24M2VCQA", "timestamp": 1487326621000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "Most of the pages are too busy to enjoy coloring.", "images": [], "asin": "1780671067", "parent_asin": "1780671067", "user_id": "AEF6QE7EOSWODK6UJSRA77EOY2QA", "timestamp": 1443568004000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Well written", "text": "This is well written. It focuses on a 17 year old girl whose mother has been dead a few years and is going to stay with her aunt and cousins for her seventeenth year (last year of high school). Shes very focused on boys, sex, more boys, and so on.<br />When she gets to her aunts one of the first thing she thinks of is the boy next door. She hasn't seen him for years but she has the biggest crush on him and when she sees him she is almost instantly \"in love\" with him. After a whole lot of flirting she finds out he has a girlfriend. So she's bummed about that. She's lost her last best friend when her boyfriend kissed her and, well, lets just say this book has a lot of boy craziness! That aside there are a few, or at least one, friendship in the book and maybe a lesson is learned in it somewhere. I will admit, I wasn't a fan of the main character at the end of the book. Even for their ages, some things are just a bit unlikeable. However, there really is a lot to like about this book! I swear it!<br />It's not a bad book, it's an easy read and again, very well written. I would look at some of the other reviews maybe and go by them. They may give you a little more of the \"good\" about the book.", "images": [], "asin": "1328635198", "parent_asin": "1328635198", "user_id": "AHWCZ47A7FIYEJ7KEJG3BO3F5YXQ", "timestamp": 1605624879673, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Stop the whining!", "text": "Women complaining about everyone else is getting OLD!  The book was light and breezy.  Quick read.  As with the TV program YOUNGER, filled with only very attractive people.  However, throughout the book I wondered if she would EVER think about her husband's perspective.  I'm a single, working, mom with lots of challenges.  So I happily related to much of it, but ALWAYS wondered if she would ever give a thought to what he husband faced when he was forced to step into the family business and was a ROCK for his whining wife and daughters.  That was a BIG gap! for me.", "images": [], "asin": "1982100206", "parent_asin": "1982100206", "user_id": "AHQ4ZJ5WWT45G57DQLRNV6I5BBFQ", "timestamp": 1537204883674, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Just Another Teen Romance", "text": "Have you ever dreamed of being heir to a throne? Mia hadn't, but suddenly finds herself with a kingdom to rule. If you expect the book Princess Diaries by Meg Cabot to resemble the movie, to actually show her dealing with being a princess, think again. This is just another teen romance, and not a very good one at that, and should stay on the shelves.<br /><br />True, I admit that I saw the movie first and so came to the book with certain expectations. For example, I envisioned reading about how tough becoming a princess can be for us average people but how sweet Mia overcomes the challenge with awkwardness and humor. I also anticipated reading pages upon pages about how Mia is trained in all the proper royal etiquette such as how to sit, walk, dance, dress, and talk. Next, despite how cliche the plotline sounds, I expected Mia to eventually endear herself to her the royal staff, incite the jealousy of popular students, and develop closer bonds with true friends. I wanted the story I saw on screen.<br /><br />Yet sometimes a book is better than the movie. And so I think I could have lived with a different book, if not for all its flaws. From page one until the end, Mia complains about her life. In this way Mia is like the girl we see on the screen, except in the book she also swears, lies about most everything, and basically just seems more crude. She also struggles in school, frequently copies her homework off others, and disdains most of her teachers. She likes to shop, wants to be popular, and does not have any interest in doing anything with her life except to date. While these may be on the top of the list for many girls, the emphasis on them in the book makes it difficult for me to believe that she would have the ability to be a princess.<br /><br />Even at this point, I probably could have forgiven the book except for one major drawback. The whole premise of the book is that Mia learns she is heir to the royal throne. This could have made for a worthy twist, except we rarely see Mia being trained to be a princess. Remove a few lines here and there that refer to her royal family or obligations and you wouldn't even know that Mia was training to become a princess. Minus its gimmick, this book is just another teen romance. As such, it disappointed me.", "images": [], "asin": "0061479934", "parent_asin": "0061479934", "user_id": "AFMZCUS5G5GXYZJ437VVESTONVIQ", "timestamp": 1290377399000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "was great until I needed it", "text": "The book arrived on time as promised. The book was in great shape, however the cd that comes with the book seem to be sealed but was a different version then on the front of the book. Also when I tried to install the cd program SPSS it said there was a file missing. I took notice to the back of the cd and it looked a bit rough. I almost did not need the cd until the last week of class and so I lost points off my grade. I attempted to contact the seller,but received no feedback from them. I have not spoke to Amazon, so I thought to warn people to be careful if your order required the cd programs.", "images": [], "asin": "1412978750", "parent_asin": "1412978750", "user_id": "AGX4GYLWQ42LNYRR3JCXMZFEPSFQ", "timestamp": 1338494158000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Leave It on the Shelf!", "text": "First, I appreciate that books have the power to mean different things to different people, and I don't think less of anyone who enjoyed this story.  For me though, it was dead on arrival.  I could not connect with any of the characters as they seemed to live in this parallel universe where nobody behaved rationally (especially in the scene where the moms freaked out about &#34;the catch&#34;), most talked as if they were trying to come up with captions for a New Yorker comic, and any common sense was thrown to the wind.  I felt the premise was paper thin, and the two author gimmick (which does work in some cases) came off like a bad college writing class assignment.  Also, I'm no prude, but it seemed to romanticize a dangerous idea - meeting up with someone you don't know.  In this age of cyber predators, the premise just made me uncomfortable.  I also felt the story dragged as it was very repetitive, the big &#34;reveal&#34; was kind of a let down, and I hated the ending.  I didn't even feel the book captured the New York setting as well as it could have.  All in all, I would suggest reading Eleanor & Park instead of Dash & Lily.", "images": [], "asin": "0375859551", "parent_asin": "0375859551", "user_id": "AGEAVXTSPBQE7ZXBMIXQEJ3C3BMA", "timestamp": 1388648436000, "helpful_vote": 6, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "daunting", "text": "This is a textbook designed for a one semester undergraduate course in cryptography.  This makes it seem a little tamer than what it is.  Crypto buffs will enjoy it, and there is little here than is not in some other advanced texts.  What is of value is a section on RIJNDAEL, the new advanced encryption standard.<br />Useful as a starting point but not as easy to follow as some other texts.  You better like this stuff already or you shouldn't dive into this book.", "images": [], "asin": "1584881275", "parent_asin": "1584881275", "user_id": "AEWTDAUGV7ZAYGKQR4J5EPTXGB6Q", "timestamp": 1051161507000, "helpful_vote": 5, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "SLOW AND OFFENSIVE", "text": "The book starts off slowly and contains graphic descriptions of pornography that are unnecessary to the plot.", "images": [], "asin": "1786819597", "parent_asin": "1786819597", "user_id": "AFNKYWKYPNFS3HB64VPHU2OH5MGA", "timestamp": 1578255042160, "helpful_vote": 87, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Wasted Time", "text": "I don't think I will be using this with my daughter for our homeschooling. I bought this book thinking I would use it and to be honest half the books that are used are not good. One has a racial slur(tells you in the book?), now this curriculum is suppose to be for young children. I would have been using it for first grade. Some of the books are good, like the Velveteen Rabbit, that's a great book. However, it also uses other words that are not good for a younger student, a** & c***. As for the picture study part of the book, its awful! The pictures are hard to see in black and white. With younger children to keep their attention, I would think the pictures would be clear and in color. For the price I paid I think the pictures should be good quality, its not much to ask because there are not that many pictures. They do have some good poems, however, again not for the age or grade this is intended for. Overall, I would not recommend this curriculum for homeschool or for younger grades.", "images": [], "asin": "1500192481", "parent_asin": "1500192481", "user_id": "AGLHEGFNVILJ5SM25XOSIR7HLMOA", "timestamp": 1458760655000, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Welllllll……", "text": "I’m not really sure how to rate this book. It was almost like two different books in one. At first I really enjoyed the build up of all the characters but then it became overwhelming. There were too many characters and I couldn’t keep them straight. I had to backtrack several times to get things straight. Then most of those characters fizzled out and became unimportant to the storyline.<br /><br />And the story fizzled out just like the characters. It was a very unsatisfactory ending. I didn’t feel like the story resolved in any way at all.", "images": [], "asin": "B075X9K9WN", "parent_asin": "B075X9K9WN", "user_id": "AH7SVPCWSWQ553HGX4O2GSFDHT2Q", "timestamp": 1630024615722, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "The content was helpful as were the worksheets in the ...", "text": "The content was helpful as were the worksheets in the back; however, I think many were redundant and could have been combined into a generic set of charts to be used for various novels.", "images": [], "asin": "0807748927", "parent_asin": "0807748927", "user_id": "AHTIDURY56BDY5ECBK5PWV5EGYMQ", "timestamp": 1416708802000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Christian Mystery/Thriller", "text": "Chloe Ledet is summoned home because her father, a famous New Orleans chef, has been shot.<br />As soon as she gets to her father's famous restaurant, Ledet's, she runs into trouble.  She is subsequently arrested for the murder of her father's attorney and spends an evening in jail before she is released on bond.<br /><br />The story unfolds in present day New Orleans and there is a hidden treasure that is at the root of the mystery that is presented here. The story goes between present day New Orleans and 16th century France to explain the reasons behind the treasure.<br /><br />I thought there was too much going on in the story. Chloe Ledet, has cut all ties with her family and constantly complains about her childhood and family. There was too much complaining about her parents who did seem to be caught up in their own lives but were not exactly abusive towards her.  The mother is portrayed as somebody entirely stupid and Chloe makes sure that she puts her mother down at various times as well.<br /><br />Also Chloe is summoned home because her father has been shot but NEVER during the story does she get to the hospital, she is too busy being pursued by murderers, attending a party, and tracking down the treasure that is at the heart of the story.<br /><br />Also the story is published under a Christian publishing house and spends some time throwing a Christian message into the mix.  I have no problem with that and enjoy some Christian novels but this seemed forced to me.  It was as if the author threw in a Christian boyfriend along with the thriller/mystery so that the book could come out under a Christian title.<br /><br />The whole story was really unrealistic for me.", "images": [], "asin": "0736926240", "parent_asin": "0736926240", "user_id": "AH5O6WWC5UGG2VKMETUAERLDY47Q", "timestamp": 1256594845000, "helpful_vote": 5, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "From New York to Rhode Island", "text": "I had such strong feelings about the characters in this book.  I did not find, as others suggest here, that it was boring.  Sad yes but not boring.  I did want to keep turning the pages.<br /><br />I thought the writing was well done and very developed; it would have to be because I found myself disgusted at times and at other times I felt empathy for Nate one of the characters in the book.  The character that I did not like and was disgusted by the most was Nate's partner, Emily.  I found her to be immoral and very shallow.  All I could think about was the couple's baby, Trevor, and how he had a devious mother in Emily.  So for me the author did a good job.<br /><br />The storyline is about Nate and Emily who have left New York because Nate's job, although a good job, can't take care of all the family's needs in Manhattan.  The couple have an apartment rent of $5000.00 per month and his salary is streched with the demands of living in New York.  I did not feel sympathy for the couple because they feel they have been exiled to Newport, Rhode Island; I wanted to jump into that book and tell them to be glad for what they did have.<br /><br />Nate has found another job and has enough money to buy the family a house in Newport.  Emily and Nate, but especially Emily, are ashamed that they have to leave their life behind in New York.Most people would be happy that they have a new home and a new job to go to, particularly in the economic times that we have now in our economy.<br /><br />This novel really makes you sit up and take notice of how people are not always happy and thankful for what they do have.  I felt sad for Nate because he did not have a good family life; his father never showed him any love and affection and he may have passed on something to Nate that will affect the young family for generations.  Overall I found this a book that I could not put down but be warned, it can make you sad, mad, and totally baffled at times!", "images": [], "asin": "054410210X", "parent_asin": "054410210X", "user_id": "AH5O6WWC5UGG2VKMETUAERLDY47Q", "timestamp": 1383676301000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Okay Mommy Chick Lit", "text": "This was a decent stab at mommy chick lit.  I admit that I laughed out loud at numerous different points.  My biggest criticism is that the book felt like it was drifting at various points without a clear plot or end point.  There were numerous interjections of the protagonist having flashbacks or just having certain feelings that felt a little forced and like they could have been brought out in other ways.  I did enjoy that Jennifer was not the prototypical SAHM - she definitely had an edge to her and at the same time was not over the top ridiculous in her disorganization as often the mothers are in these types of stories.  Definitely a decent attempt, but at no point did I feel compelled to rush trough or a deep desire to know where the story was headed. The end definitely packed some weird twists that were not well-explained and seemed contrived in a way.", "images": [], "asin": "0312425627", "parent_asin": "0312425627", "user_id": "AHBSAEV65SZJFHDTPWDS47KKC2YA", "timestamp": 1204389831000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Very weak", "text": "The book needed Tara, Marcus and Andy Carpenter and his lady friend. I have read all of the &#34;Tara&#34; books which have been fast and amusing reads. This one was hard to stick with and not very well written.", "images": [], "asin": "B003BQZ80W", "parent_asin": "B003BQZ80W", "user_id": "AFDEDVEC5WACWCIGSEQEVDZXC2RQ", "timestamp": 1389030390000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "For younger kiddos", "text": "Does not keep my 18 mo attention now or even 6 months ago - maybe better for younger kiddos?", "images": [], "asin": "0763662755", "parent_asin": "0763662755", "user_id": "AF4GU3GLVJNKKD7QJOZZ2PRLJQ3A", "timestamp": 1468864077000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Mixed Feelings", "text": "I have mixed feelings for this book. While I found myself compelled to continue reading Slow and Steady, I had some issues with the story.<br /><br />What I liked:<br />I liked the overall plot. I like the idea of a female lead making doing what needs done in order to support her family. I also liked how as soon as Greyson found out who Finley was supporting her family, he did everything he could to get her out of her touch situation, but never made her feel bad about it.<br /><br />What I didn't like:<br />The pacing of the book didn't work for me. Sometimes a chapter would start and it would fast forward six weeks. Normally, I would be okay with this, but I felt like I was missing out on relationship building. Chapter after chapter, Finley is struggling with Greyson being a round. Then all of a sudden, its been six weeks and they are in love with each other. I just didn't feel the connection.<br /><br />Like I said, this is a mixed bag review. I finished this book quickly and was truly interested in the story. BUT, a lot of times I found myself rolling my eyes or thinking &#34;What? That doesn't make since!&#34; With that being said, I don't think I will continue with the series, but I do want to read more from Kendall Ryan. She has some other books I'd like to read.<br /><br />Obsessive Book Nerd was given a copy of this book in exchange for an honest review.", "images": [], "asin": "1682302210", "parent_asin": "1682302210", "user_id": "AFNS2U24FRUKGVKEWWSODVH4D4MQ", "timestamp": 1463416509000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "A different sort of time travel", "text": "The means are never discussed, which is rather odd given the characters' curiosity about everything else. Old south, underground railroad, it all rockets along with a lot of drama ... then it's over. Disappointing.", "images": [], "asin": "B00B54U0BO", "parent_asin": "B00B54U0BO", "user_id": "AEAWNTD7SZZRA75U7YC6N4CK6UAQ", "timestamp": 1378870061000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Quite graphic", "text": "While this book wasn't historically wrong, the writing was much too graphic for my taste. I've read other authors who write of this era that I preferred.", "images": [], "asin": "B00G3L17PC", "parent_asin": "B00G3L17PC", "user_id": "AE75HHIPMXVLD3OSRD5N5SUABLYA", "timestamp": 1594065582882, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Simple Way to Make Average Dice", "text": "I'm seeing confusion as well as overcomplicated suggestions on how to make average dice.  Here's how I learned to make them:  Using white dice for my example, take white paint and fill in the  2 center pips on the six, this now becomes a 4.  Now take black paint or a marker and add two pips to the one side to make it into a 3.  Now you have an average die with 2, 3, 3, 4, 4, 5.  That's all it takes.", "images": [], "asin": "1849086826", "parent_asin": "1849086826", "user_id": "AHQNP2B72WPSCAHT5MLGRTDRGL3A", "timestamp": 1425237197000, "helpful_vote": 5, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Great jacket art!", "text": "Another WB TV show episode waiting to happen from Subterranean Press, this time written by Tim Powers. This novella has a decent pace and is written well enough to get the characters from the beginning to the end, but is otherwise shallow and predictable. At just over 100 pages of large text, the tale isn't worth the price, so thankfully Dave McKean did the jacket artwork, which like most of his work I've seen is stellar. I rarely rate a book higher due to the presentation, but with the jacket art and the open acknowledgment that Subterranean Press puts great care into their physical products (if not careful consideration into the content) I'm adding about three quarters a star to bring this to a solid 2. However, unlike some of my other two star reviews, there isn't much to dislike here, just not much I did like. Fans of Powers, of which I am not (having read and also disliked The Stress of Her Regard), may enjoy this brief outing and should proceed with caution.", "images": [], "asin": "1596067810", "parent_asin": "1596067810", "user_id": "AFA25ISRNCAKMURYNDLKCO2I5WQQ", "timestamp": 1510664084130, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Skip it.  There a many better books out there.", "text": "Not for everyone.  This book brought back many childhood memories but also could be boring in spots.  It is not to the caliber of her “Leadership” book on Lincoln, Teddy Roosevelt, FDR and LBJ.  That is a must read for people interested in presidential history.", "images": [], "asin": "0684847957", "parent_asin": "0684847957", "user_id": "AED7LXAPCVVWKT5WFRS2OYJVZHGQ", "timestamp": 1625863729253, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Terrible sectional maps", "text": "Great information. Need a magnifying glass to see details that you need to determine the correct answer.", "images": [], "asin": "B097SSBNJ6", "parent_asin": "B097SSBNJ6", "user_id": "AFCTJMVMTW7XBHUFNQIDKVE2T77Q", "timestamp": 1630328065311, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Very poorly put together", "text": "The book fell apart before I got it and most of the pages are missing. I would like a refund. If I need to I will add pictures, later.", "images": [], "asin": "075758327X", "parent_asin": "075758327X", "user_id": "AEW7A4IWIVSOFGTLJKDUKIETUOCQ", "timestamp": 1492379104000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Meh. Don't waste your money.", "text": "Old and outdated information.", "images": [], "asin": "1580400183", "parent_asin": "1580400183", "user_id": "AG5XQ75I6XRWDDWYHX4UMZYCAAJQ", "timestamp": 1446087058000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "I like this edition but the pictures are really dark", "text": "I like this edition but the pictures are really dark. I am glad I purchased it, just wish the pictures were lighter.", "images": [], "asin": "0062326090", "parent_asin": "0062326090", "user_id": "AGLHEGFNVILJ5SM25XOSIR7HLMOA", "timestamp": 1498282065786, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Quirky & Fun, Light Mystery", "text": "Dust Angel is a mix between a \"chick lit\" and a mystery novel.  Corinna Leyendecker, the protagonist, loses her job and her boyfriend on the same day.  After some reflection, she realizes she didn't like her job all that much, and that she is unhappy with her excess weight and lack of friends.  After a short stint of job interviews, Corinna has a revelation that she would be happier as a small business owner, and gets to work getting a government grant to start a company that provides household services for busy, executive men.<br /><br />As one might expect, Corinna is lucky enough to get a grant, a loan, and unemployment to start her small company. Somewhat unexpectedly, her primary helper is a punk lesbian from Corinna's former job and the first employee of the company is a friend of Corinna's grandmother.  A nasty, flu-like cold is almost a character in itself, as once Corinna catches the cold, her decision making abilities take a strong turn for the worse.  This leads Corinna into an awkward encounter with a dead man, which is the \"mystery\" part of the story.  However, Corinna is never actually frightened of the corpse, just frustrated and stressed, so the mystery is really more of a case of hijinks than a crime.<br /><br />As in most stories of this type, Corinna overcomes challenges and obstacles to win success, lose and win back her friends, and decides that she doesn't really like her former boyfriend all that much, but is unexpectedly drawn to someone new.  Dust Angel is a light and charming story--a nice book for an afternoon of escapism.  There is a deft, light touch through most of the book which nicely smooths that this is a translation from German.  I hope that Dust Angel gets some exposure in the US, I believe it deserves a place on the 2013 list of \"beach reads.\"", "images": [], "asin": "161109044X", "parent_asin": "161109044X", "user_id": "AFDZ4WWFENGLKRK6DMIU7YE3CQTQ", "timestamp": 1360530137000, "helpful_vote": 32, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Awful", "text": "This book makes absolutely no sense. It is 10 or so pages of run on sentences and I am shocked that it is from a New York Times best selling ? author", "images": [], "asin": "0803736800", "parent_asin": "0803736800", "user_id": "AHNQTZJRMYCINDZJZ67OQEZVMDPA", "timestamp": 1451181585000, "helpful_vote": 14, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "The hardcover binding is so cheap, don't expect this version \"(2 Volume Set)\" to last or wear well", "text": "The contents are great. The binding is ... well, this is supposed to be a hardcover book and something you'd want to keep a long time. I can't really describe this cheap binding as hardcover. It's a blend of soft and hardcover. The spine is nothing but layers of thick paper, and not heavy-duty paper at that. The cardboard is the thinnest that might qualify as hardcover. The first volume is bound improperly so that there are wrinkles and gaps between the cover paper and the front cover cardboard. I'm sending it back, but even if the binding wasn't done wrong the book will have to be handled delicately, and that definitely does not meet expectations for a hardcover cook book. The version I received is a 2-volume set in a cardboard set box. There are more than one two volume sets on Amazon so it may be hard to find the best product. The title of this inferior item is &#34;Mastering the Art of French Cooking (2 Volume Set)&#34; The outer box is white with red fleur-de-lis, and matches volume 1. Volume 2 in this set is white with teal fleur-de-lis. There is another set named (2 Book series) which I'm going to try instead.", "images": [], "asin": "0307593525", "parent_asin": "0307593525", "user_id": "AHLFPP4DASPI7LD524SWAZ6HXT5A", "timestamp": 1518876632268, "helpful_vote": 148, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "The book cover", "text": "I haven’t read the book yet but I know it’s going to be good based on reviews. My negative review is based on the product itself. I do not like the feel of the book cover. It’s so bad that it makes me not want to read the book. If you were to buy this book I would look for a different cover. The same would apply to the follow up book called the testament", "images": [], "asin": "0525562621", "parent_asin": "0525562621", "user_id": "AG2GIQSWIDV5EJPJVBGNAFDFTO7A", "timestamp": 1625877751525, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Can't go wrong with the Lord's Prayer. I did ...", "text": "Can't go wrong with the Lord's Prayer.  I did read this book and found that I wasn't  interested in this.  The book was passed to a sister.", "images": [], "asin": "0979599571", "parent_asin": "0979599571", "user_id": "AHETQ33M4HTYFNERQZRD72OBOTDA", "timestamp": 1419998405000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not much as usual", "text": "It would be great if someone ever had both the photoshop expertice and the ability to write a \"how to\" book. Evidently it hasnt happened yet. Kilby people know the software, but they are keeping it to thselves. Disappointed again!", "images": [], "asin": "0321749588", "parent_asin": "0321749588", "user_id": "AFYFIWBFMI5V4GPFBI434Y4G4BOQ", "timestamp": 1372457487000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Rough shape", "text": "Be advised: the only reason I am giving this item a 3 star rating is that the book is in fairly rough shape, worse than I was expecting when reading the condition description upon purchase. The cover is scraped up and faded, a random sticker right on the front, and a child’s name written inside. All in all, it’s pretty beaten up. I bought this book for my baby, so I hate that it looks like this. However, for such an old book, it is what it is. Growing up, my Granny read me this book all the time, and I have such wonderful memories attached to it. I want that for my child as well, so I’ll white-out the name and peel the sticker off. Well worth the less than 6 dollar price tag despite how it looks.", "images": [], "asin": "0307602699", "parent_asin": "0307602699", "user_id": "AEP6EQLJDWZYAXI2US32HKQ6HLQQ", "timestamp": 1646518403133, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I am not really a history buff or much of a reader of non-fiction", "text": "In light of my headline for this review please know going in that I am not really a fan of this sort of book to begin with.  This one was a little too \"heavy\" for me so I did scan a lot of it.<br />Knowing this about me I would take this review lightly.  I found the parts that I read to be interesting.  I chose the book because the whole concept of this bomb has changed everything in the world from that point forward so I felt that I needed to give it a go at least.  Well I really took on too much.<br />Final comment---if we hadn't developed the bomb it is certain that someone would have.  It was inevitable.  I'm sure that this is a good book for those whose interests lie in that direction.  It was not my cup of tea.", "images": [], "asin": "1610399617", "parent_asin": "1610399617", "user_id": "AEP4KJDGBH6XPJKFEHPYSAPUNDBQ", "timestamp": 1537969188734, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Enlightening and well written essays", "text": "Especially well written was the thoroughly researched essay by the artist and Lambda Award winning author Tee A. Corinne `How Lesbian Artists Support Their Art\".<br /><br />As a bonus each of the essays are accompanied by photos of those profiled and the essayists.<br /><br />Other outstanding essays -<br /><br />Alison Bechdel interviewed by Marny Hall<br /><br />Joan E. Biren 'JEB' Lesbian Photographer, Video producer, Activist<br /><br />Elana Dykewomon `Changing the World'<br /><br />The Jewelle Gomez Stories as Told to Amanda Kovattana<br /><br />Barbara Grier: A Burning Love for Lesbian Literature<br /><br />Daughters of Bilitis and The Ladder that Teetered Del Martin & Phyllis Lyon<br /><br />From the publisher's website - Everyday Mutinies is an essential resource on the history and practice of lesbian activism. It also contains valuable ideas for any political lesbian who has wondered how she can possibly pay her bills and make the rent while remaining a full-time activist.<br /><br />Who are the women who struggled to form lesbian communities--and how did they fund their activism?  In Everyday Mutinies: Funding Lesbian Activism, two dozen lesbians--including well-known activists such as Martina Navratilova, Alison Bechdel, Dee Mosbacher, and Jewelle Gomez--tell the stories of their activism, with an emphasis on how they support themselves and fund their political activities. Their examples can help you deal with raising and allocating money. Less than 0.3 of all philanthropic dollars are awarded to lesbian and gay projects each year. Yet Everyday Mutinies shares amazing success stories of women surviving, thriving, and making an impact by using the resources they have with intelligence and skill. You will be moved and inspired by the stories behind Naiad Press, The Ladder, Straight from the Heart, and the National Center for Lesbian Rights.<br /><br />Everyday Mutinies presents the voices of scientists, political strategists, artists, writers, fundraisers, and community organizers. These courageous women discuss their strategies for getting and using money to pursue their visions, including:<br /><br />* funding scientific studies in creative ways<br /><br />* liberating corporate resources<br /><br />* encouraging responsible stewardship of inherited wealth<br /><br />* getting paid for working on lesbian causes<br /><br />* choosing a job to support activism<br /><br />* financing lesbian media from magazines to documentaries<br /><br />* giving time versus giving money", "images": [], "asin": "1560232587", "parent_asin": "1560232587", "user_id": "AFWVN52MRBWOTIK7UGXBWGOY4HBA", "timestamp": 1160426260000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not one of the best Reacher novels", "text": "I was hoping for a blockbuster story and was a little disappointed in this one.  It wasn't until well past the halfway mark that it became interesting, but still I could only give it 3 stars.", "images": [], "asin": "0307749584", "parent_asin": "0307749584", "user_id": "AF6PPOG7VZ5HDUCLMOCKESZDV37A", "timestamp": 1348270389000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Dissapointed", "text": "Looking back to my middle school home ec class, I can honestly say that this book misses the mark. Seriously, I expected to see much simpler directions for absolute basics. In the day and age of youtube videos, the written instructions for cracking an egg are both confusing and obsolete when College students can pull up a video and see the demonstration. This book included the use of cooking items that couldn't really fit or be used in a dorm room. Why not have everything easy to cook on a single hot plate and microwave - working with their small space and minimal tools and ingredients? Sorry, I think I'm the only one that found this to be impractical, but I'm being honest.", "images": [], "asin": "1611806100", "parent_asin": "1611806100", "user_id": "AEIIRIHLIYKQGI7ZOCIJTRDF5NPQ", "timestamp": 1558036132807, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "It had potential to be better", "text": "I thought the book was ok. It was kind of an addictive read but by halfway through the book I hated Margo. She’s the epitome of completely immature, self absorbed teen. The book leaves you feeling like Q was robbed of his last month of high school and graduation for some girl that only cared about herself. I think it would have been better if the ending was more satisfying, like if she wanted to be found. I may read another one of this author’s books but this novel makes me in no hurry to.", "images": [], "asin": "014241493X", "parent_asin": "014241493X", "user_id": "AFJI7F7FI5PF5TQFETMVCI4SJIGQ", "timestamp": 1535995342464, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Not exactly \"gripping\"", "text": "Sounds like the plot was copied from the Andrea Grande concert.  Characters not believable, plot predictable.  BORING", "images": [], "asin": "B00GEEB52S", "parent_asin": "B00GEEB52S", "user_id": "AHX6525TGWP527LGNF3FDVNIXZOA", "timestamp": 1501532206918, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Book was ok. Wife/author a real pain.", "text": "As a full time RVer  (going on 13 years living only in an RV) I found the travel descriptions interesting in this book, but did not find the book humorous. I felt very sorry for the husband who was stuck with his self-described Long Island Princess wife. I would have left her standing at the first rest stop. She complained, whined, belittled, and drank her way through the book. Although she seemed to have learned some lessons about being a worthwhile human being by the end of the book, by that time I really did not like her.", "images": [], "asin": "0767928539", "parent_asin": "0767928539", "user_id": "AGBJNIHSMDK77DEWM2OMCRZ4TJNA", "timestamp": 1491354944000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Ordered long ago", "text": "I ordered this book many years ago and reviewed it at that time.  However, Vine tells me that I did not review it.  I cannot recall it, but I am sure it was an acceptable YA book.", "images": [], "asin": "0545381827", "parent_asin": "0545381827", "user_id": "AGWGMDSRIXUSGG3AVYX65RVPWCLQ", "timestamp": 1665344504139, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "It does cover all the areas of the state providing ...", "text": "It does cover all the areas of the state providing some data on each , however  did not think it provided any extra insight.", "images": [], "asin": "1426216351", "parent_asin": "1426216351", "user_id": "AEYXO7XSLVWAZ2ZSGD2FQE6K2XXQ", "timestamp": 1520263688340, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "the characters were just not believable", "text": "This story had potential but fell short, in my opinion.<br />A bit of a spoiler alert here-the complete change of personalities in several of the disagreeable, unlikeable characters into these lovely, funny, kindhearted people who learned their lesson, in the span of a few days, was so unbelievable I was ready to stop reading. The ending was predictable and therefore I didn't enjoy too much.", "images": [], "asin": "B00BC3TSSE", "parent_asin": "B00BC3TSSE", "user_id": "AH7GZDAJ7JJSL4LEFUCOODYPRQXQ", "timestamp": 1421115088000, "helpful_vote": 7, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "An ok dog book, but better books on labs are out there", "text": "I have at this point read countless lab specific books, and this one falls a bit short.  Much of the information is not particularly specific to labs, unlike other books like Your Labrador Retriever Puppy Month By Month which I think would be a better book, particularly for someone getting a younger dog.  In many ways this is much like Labs for Dummies, which I think is a bit more particular to the breed and also a better buy.", "images": [], "asin": "1593370482", "parent_asin": "1593370482", "user_id": "AHUXNBCBPZFNW2NZYTXDMUSE2CVQ", "timestamp": 1456257158000, "helpful_vote": 10, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "It was supposed to to be very good or like new and I had to tape the ...", "text": "Book  was not as described. It was supposed to to be very good or like new and I had to tape the back cover because it was almost torn all the way off.", "images": [], "asin": "0316015849", "parent_asin": "0316015849", "user_id": "AEDGOAJ2PMXP7TXSYFFJ2MECL44Q", "timestamp": 1465256452000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Buy a  new set..", "text": "I was disappointed as these had been redone and the quality was not as good.", "images": [], "asin": "B000I44KDQ", "parent_asin": "B000I44KDQ", "user_id": "AFYBZ2LOKDIGPOMR5F5VLMYGAM4A", "timestamp": 1471206458000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Just silly", "text": "This tale a total crock - I only persevered until the bitter end to write a 'fair' review.<br />There's a heap of irrelevant padding that adds naught to the story - even entire chapters of absolutely nothing.<br />Plus - it reads like it was written by an adolescent.<br />The unlikely story just gets progressively sillier and sillier.<br />I'm just guessing here, but I imagine that the author felt that the protracted ending was supposed to be horrific and scary (????).<br />BUT: it was all so totally ridiculous - I was laughing so much that I could barely keep reading. Still, the (unintended?) humor was appreciated!", "images": [], "asin": "B00AXXD4SE", "parent_asin": "B00AXXD4SE", "user_id": "AFZEFP54WMV5NTSSJZVHDOZV2LGQ", "timestamp": 1512935472303, "helpful_vote": 8, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not his best", "text": "I've had a love-dislike relationship with Moore's books, and while I love Noir-- the genre I mean, I was underwhelmed by Noir, the book.<br />It's partly my fault. I dislike pastiche works, and Noir has all the tropes (and then some) of the genre.<br />The book is set in San Francisco in 1947 and includes a blonde named Stilton (which grated, pun intended), a gin-joint and a bartender who's a bit of a sap. Perhaps the book would have been better without the whole sci-fi angle. I've laughed out loud at Moore books, but this one just didn't seem funny.<br />Best Moore: Island of the Sequined Love Nun.", "images": [], "asin": "0062433970", "parent_asin": "0062433970", "user_id": "AFKX24ALWAPX366KX6DWTOBWLQAA", "timestamp": 1550901014311, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Hopefully, This WON\"T be the Only Book You Read about Marriage!", "text": "Kudos to Doctor O'Connell for trying to defend monogamy and fidelilty.<br /><br />Among the rewards of staying together, Doctor O'Connell speaks of<br />* \"Knowing ourselves\"<br />* \"Keeping our memories alive\"<br />* \"Aging creatively\"<br />* \"Being more generous\"<br />* \"Accepting ourselves\"<br />* \"Continued growth\"<br />* \"Finding freedom through our limitations\"<br />* \"Deeper love\"<br />* \"Reaping the rewards of our emotional investment\"<br />As the same rewards might come from of other long term relationships, Doctor O'Connell falls short.  While it had SOME nice insights, \"the Marriage Benefit\" is a rather superficial work.  I would heartily recommend the following works on marriage:<br />* [[ASIN:0819814881 Casti Connubii]],<br />* [[ASIN:1860823246 Dignitas Connubii]],<br />* [[ASIN:0898707285 Humanae Vitae]],<br />* [[ASIN:0819874213 Man and Woman He Created Them: A Theology Of The Body]],<br />* [[ASIN:091847714X Man and Woman: Love & the Meaning of Intimacy]],<br />* [[ASIN:091847700X Marriage: The Mystery of Faithful Love]],<br />* [[ASIN:0825306264 The NaPro Technology Revolution]],<br />* [[ASIN:B0013L8BG0 The Thrill of the Chaste]],<br />* [[ASIN:0786886161 The Unexpected Legacy of Divorce: A 25 Year Landmark Study]],<br />* [[ASIN:0195107640 What God Has Joined Together]]", "images": [], "asin": "B0036DE5B8", "parent_asin": "B0036DE5B8", "user_id": "AGUZFE4RGYJBWXLBCYQVYNK5ETKQ", "timestamp": 1297809925000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Very small print, no photos.", "text": "The reasons for my poor rating may be different for you so keep that in mind.  The recipe print is so small it was almost impossible for me to read.  This was not mentioned in the listing, or perhaps I missed it.  There are no photos of what one may decide to cook.  I like to search thru photos to find a recipe that will interest me.  Most of the recipes were simply any recipe found in any other cook book with a small obvious change for the Air Fryer.  If this is not important to you, then this book will work for you.", "images": [], "asin": "B09RG5HZM8", "parent_asin": "B09RG5HZM8", "user_id": "AHICB5EBE26UINCLJUTNHTUNJOCQ", "timestamp": 1646748418407, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Disappointing book #2 in the Cavendish series from a usually consistently good author", "text": "Well, this was the most disappointing Maya Rodale novel that I've ever read. This second book in the Cavendish family series was tedious and lacked the characteristic wit and charm that I've come to associate with Rodale's usually well-written historical romances.<br /><br />Lady Amelia Cavendish, the heroine of &#34;Chasing Lady Amelia,&#34; was first introduced in &#34;Lady Bridget's Diary,&#34; #1 in this series. In that book, Amelia had disappeared for a day before returning to her family, not sharing a single detail of where she'd been or what she'd done during her time of disappearance. Knowing that &#34;Chasing Lady Amelia&#34; was going to fill in this gap, I was eager to hear Amelia's story. How disappointing, then, to read about Amelia's day and realize that it was just going to go on and on. I don't want to include any spoilers, so I will just say that I was bored with the entire storyline, and the chemistry between Amelia and the hero was lacking.<br /><br />I hope that #3 in this series, &#34;Lady Claire Is All That,&#34; will be much better. I'm still willing to give Rodale's books a chance because I've ready many of her books and always been entertained and charmed. I'm going to call &#34;Chasing Lady Amelia&#34; an anomaly, and hope for the best for Rodale's future books.", "images": [], "asin": "006238676X", "parent_asin": "006238676X", "user_id": "AEKLQBIHJXN3TC6SZSNTCWME7EJA", "timestamp": 1482127835000, "helpful_vote": 4, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "BE WARNED: MISSING MULTIMEDIA!", "text": "Great book. Supposed to come with a DVD Rom which was not included. Makes the product false advertising. Very sad they would sell it like this and rip you off. Be warned!", "images": [], "asin": "097553078X", "parent_asin": "097553078X", "user_id": "AFSS57DESVFJOFU5D4A33YO5FEVA", "timestamp": 1469318194000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Slow read", "text": "Not really a fan of this book. It was a bit slow and boring. I read it for a book club. I completed 91% of the book and then I had to tap out.", "images": [], "asin": "B0796WZCC5", "parent_asin": "B0796WZCC5", "user_id": "AE2CAW3IYMZN7UP6SM4M26EGU7ZA", "timestamp": 1552521787623, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "... fading optimism I must say that this is a horrible text. This is not a text written by ...", "text": "As an instructor that has used this text for several semester with fading optimism I must say that this is a horrible text.  This is not a text written by computer professionals and the lack of  key concepts are very obvious throughout this book.  This will be the last time that I will be using this text for my class; it is a horrible text for introducing student to technology.  As a previous reviewer opined: &#34;shame on them&#34;!", "images": [], "asin": "0133802965", "parent_asin": "0133802965", "user_id": "AE7H2SF5YQCLSRKX3THFKFUYXNAQ", "timestamp": 1442373626000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "ripped from the headlines", "text": "Men with guns who hate government. Okay plotting. Cardboard cutout characters. Not a lot of profiling, if any. Skimmed the last 85 pages. Very repetitive, very repetitive. I might have read it through except for the repetition of information became annoying and over the top drama.", "images": [], "asin": "0778318621", "parent_asin": "0778318621", "user_id": "AFWVN52MRBWOTIK7UGXBWGOY4HBA", "timestamp": 1452438028000, "helpful_vote": 3, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "waste of time", "text": "first off the detective logan mcrae is weak and whiney and doesn't seem all that bright. which is how he describes his underlings quite often. he had been injured on the job so any jab to the stomach sends him into writhing pain. if he hurts that much, he doesn't belong back on the job.<br /><br />the book is way too long. full of unnecessary details that could be left out that wouldn't hurt the story any. i don't know how many times i need to be told how wet, cold, damp with gleaming streets and pouring rain aberdeen is. or how ugly the buildings. or how much candy his superior eats, how his fat behind sits on the corner of the desk. we get that part, move on. i can't figure out what purpose insch fills in the book. he is a caricature.<br /><br />there are WAY too many characters and plot lines to keep track of. along with interminable descriptions of where they live. thank heavens on a kindle you can do a search to see when a character first shows up and under what circumstances - otherwise it would be \"huh, who is that?\"<br /><br />there is also too much gore and the use of scottish slang or regional dialect is very hard to understand.<br /><br />this review also works for the first second mcrae novel so a little copy and paste of this review for that one as it has the same flaws. i am not going to continue with the series.<br /><br />i had enjoyed judith van glieson's novels  so much i had hoped logan mcrae would take up the slack after i finished van glieson's detectives' series.", "images": [], "asin": "B002RI9ZZO", "parent_asin": "B002RI9ZZO", "user_id": "AFFB4ARUBE5WTFX7BZGHZOMS3ACQ", "timestamp": 1374952947000, "helpful_vote": 11, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Meh", "text": "It was pretty mediocre. I was expecting something amazing from all the raving reviews but I was sorely  disappointed.", "images": [], "asin": "0995411980", "parent_asin": "0995411980", "user_id": "AEY4Q4FJ2ZGJNJEN6JEJOMRHI77Q", "timestamp": 1618246044192, "helpful_vote": 2, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Demonic - threw it away - did not finish - lies & fake scripture", "text": "Didn’t take long to find this book was telling lies and trying to mislead minds - demonic book - do not recommend - total bull crap -", "images": [], "asin": "0061626007", "parent_asin": "0061626007", "user_id": "AEA2NQTTMSMJMK5TNEFF3CJADAQA", "timestamp": 1630172721557, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A Lilac Wolf and Stuff Review", "text": "I liked the layout and how it wasn't all grouped by content, but instead by date.  So the kids just have to go through it.  It did not, however, capture their interest and ignite a love of learning.  They never did finish it.  I could have continued forcing it, but they love their actual school more than this workbook so that seemed counter intuitive.", "images": [], "asin": "097628006X", "parent_asin": "097628006X", "user_id": "AHQXMKX4AE2SDCN4CBB2Z75ZZU2Q", "timestamp": 1446908995000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Beatable, Definitely Beatable", "text": "I was sorely disappointed in this book which purports to reveal practical training secrets from the Navy SEALS for everyday application. The author reveals himself to be a foul-mouthed boor masquerading as an enlightened warrior.  The writing style is annoying and clumsy and chockful of UPPER CASE words.  The exercises are ridiculous, particuarly the ones about revealing your deep dark secrets to your romantic partner and using your romantic partner as a mentor.  The author shares that among the many women he had, he married four and, not surprisingly,  divorced three. The other practical techniques are obvious and uninspiring.<br /><br />Skip this self-important tome and check out Release the Warrior Within by Machowicz instead.  The same basic material is covered in a far more cohesive, less condescending manner.", "images": [], "asin": "1413423930", "parent_asin": "1413423930", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1166206403000, "helpful_vote": 10, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Too long and rambling", "text": "Too long and all over the place.  Got about 2/3 through and lost interest.  Love Tim Ferriss, but this was a little hard to read.", "images": [], "asin": "1328683788", "parent_asin": "1328683788", "user_id": "AFR46YQ6TXU4CHJYPARLRF3MUPCA", "timestamp": 1509333671096, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting But Very Intricate", "text": "The author's theory is that you keep acting out your ancestor's problems, even if you have no idea what they are...you know subconsciously, but don't know how to deal with them.  Therefore if your grandfather was an abusive alcoholic, you may be also, and that's why.  But you will need to research your family, on both sides, and interview great-aunts etc, who according to the author, will be glad to tell you personal things...like whether their father sexually abused them.  Why would they tell after 70 years?  Who knows, maybe they would.  But it just doesn't seem likely to me. You have to draw family charts way into the past, with as much info as you can find out about your direct descendants.  I agree this might be helpful but just how probable is it for most people to accomplish? It sounds like a lot of work, and even people who are very into Geneology are lucky if they find out dates of birth and who married who a couple of generations back.<br /><br />So I just don't know how well this would work.  If it works for you, great.", "images": [], "asin": "0553374982", "parent_asin": "0553374982", "user_id": "AH74YZQJEUF55CYLLS5FIGGEXKLQ", "timestamp": 1229543703000, "helpful_vote": 10, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "A miserable treatise written by someone in love with his own writing", "text": "For someone who purports to teach others how to read, Adler cannot write. The book is horrendously long for the meager amount of advice it provides, as he spends entire chapters repeating simple, basic points ad nauseam. \"Do a brief, inspectional reading of the text, figure out how long it is, and discover the primary arguments\" is, for example, a some advice he gives. Adler then proceeds to spend entire chapters discussing these basic concepts, over and over. By the end, for all his words, he hasn't added any appreciable depth, he's only wasted your time.<br /><br />Every major lesson can be summed up in a handful of sentences.  There is no reason this book should be as long as it is, and thus, it makes me question the validity of his advice. Google a basic summary of the points--they'd all fit on a single piece of paper--and skip the book.", "images": [], "asin": "0671212095", "parent_asin": "0671212095", "user_id": "AHGHJMRCKRO37OSJ6TLZOBD4CYJA", "timestamp": 1543108627989, "helpful_vote": 9, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Average", "text": "An average book...More of a &#34;poor man's&#34; deduction of personality types than a full myers-briggs assessment.  Would be good for those people who are clearly within the different personality types/functions.  For those along the boundaries of particular types, not so much.", "images": [], "asin": "0316167266", "parent_asin": "0316167266", "user_id": "AGOQ54Y7WBOPNQXQI7OLNREK7Q3A", "timestamp": 1389100993000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Superficial and Shallow", "text": "I picked up this biography because I was doing research on Blake Edwards. It's hard to see what Julie Andrews saw in him, as he's depicted as an extremely narcissistic, petty and pathetic person whom she nevertheless stayed married to until his death. Andrews comes across as a co-dependent wife who's too self-absorbed and wrapped up in her film career to reflect or gain insight into why she behaved the way she did. Like Mia Farrow, she adopted Asian kids but apparently without much support from her spouse. Her superficial, shallow renderings has made me re-evaluate her as an actress - I don't like her very much now. No depth.", "images": [], "asin": "0316349259", "parent_asin": "0316349259", "user_id": "AH3BXW7KLIS2VAE56UXJS2NS7I5A", "timestamp": 1653714123843, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Know Your Boat : The Guide to Everything That Makes Your Boat Work by David Kroenke (2002-05-23) Paperback", "text": "Know Your Boat : The Guide to Everything That Makes Your Boat Work by David Kroenke (2002-05-23) Paperback  – 1815<br />This book has some good general information concerning sail boats.  It is not an owners manual or a repair guide, but more a way to learn something about your new hobby before using it.", "images": [], "asin": "B01FKSIVPC", "parent_asin": "0071361340", "user_id": "AE5VPKX64CVOPH6X75C7EQXAIGLA", "timestamp": 1508073780353, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not my favorite Sandra Brown", "text": "I really like Sandra Brown and have read a lot of them. This one annoyed me. The female lead was immature, the male lead was abusive to her (when he wasn't pawing her) and the plot line was pretty unrealistic. Overall I love Sandra Brown books, just not this one.", "images": [], "asin": "1455550744", "parent_asin": "1455550744", "user_id": "AHKL6LTXEANGUNJYW7NVU4TZAGNQ", "timestamp": 1618329264022, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Don't waste your money", "text": "Very disappointed but didn't cost enough to take the trouble to send it back.  I could have hand drawn these patterns myself.  Very disappointed.  Amazon should reconsider carrying this.", "images": [], "asin": "1574215094", "parent_asin": "1574215094", "user_id": "AHVMID6UZLIPLR5B5R5NJLYLPOVA", "timestamp": 1479628762000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "The book is cool, but the one I received had been used ...", "text": "The book is cool, but the one I received had been used and was marked in. There are several pages of questions that someone had already answered.", "images": [], "asin": "1426310188", "parent_asin": "1426310188", "user_id": "AFX5OOESZ4VHULOV7DI5BXBG5G2A", "timestamp": 1423072978000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Not what I expected", "text": "I was expecting much more factual information including types of clouds.  My daughter likes the pictures, but I was disappointed.", "images": [], "asin": "1426318790", "parent_asin": "1426318790", "user_id": "AFSQAGCU3G7OJCPMRNDNCSXUCVNQ", "timestamp": 1526493399503, "helpful_vote": 7, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Monotonous action - book becomes a blur", "text": "This series has always been mediocre, as far as paranormal romances go, but this latest book is all flash and no substance. Zipping around, filthy, and constantly whining that she doesn't know how to use her power, Cassandra makes for a humdrum heroine. Two measly love scenes are squeezed in and what should be a monumental ending goes out in a whimper. I started skimming through parts of the book because it had become rather boring. As another reviewer mentioned, there is no character development.", "images": [], "asin": "0451412702", "parent_asin": "0451412702", "user_id": "AG5XHK2S4LGD7ASTBQM2LLHNTNAA", "timestamp": 1242752797000, "helpful_vote": 10, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Bought Outdated Calendar", "text": "I really liked the graphics in this calendar. But when I went to put it up a few weeks ago I noticed it was last year’s calendar!!!!! I should have checked the date when I bought it . But I also think that it should not have been listed along with the 2022 calendars. !!!!!!!!!!!🙄🙄", "images": [], "asin": "1523509368", "parent_asin": "1523509368", "user_id": "AGJLYVRHMNDAAZXETGEQGYCHNGRA", "timestamp": 1646513474829, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "adorable", "text": "This is such a cute take on the three little pigs! Who doesn't love Pugs.", "images": [], "asin": "1680100432", "parent_asin": "1680100432", "user_id": "AEB6JZAH74DYIQFAZ6ERO6QOUIAA", "timestamp": 1534770642780, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "The Inverntion of wings", "text": "didn't like oprah's  interruption of written comments, difficult to get back to story so I gave up trying to finish book. It may be a good book but really hated the interruption. Havre read the authors other books and enjoyed them.", "images": [], "asin": "B00H58VGIA", "parent_asin": "B00H58VGIA", "user_id": "AGUVHDVE6QQRNXO2IVTVRCMDP7KQ", "timestamp": 1396861745000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "A Feel Good Story", "text": "James Patterson breaks the paradigm again. He is probably one of the most gruesome thrill writers and yet he surprises again with this book.  I listened to it on cd and I give 4 stars to the reader.  The story has elements that disturbed my senses but in all it was a pleasant story and easy listening. If you are looking for a feel good summer read or a gift for someone then this book will serve either purpose.", "images": [], "asin": "1600241654", "parent_asin": "1600241654", "user_id": "AEIRBJXUTEW6I4WNBYHQYRTO6VTQ", "timestamp": 1212365300000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Uses a lot of canned soup.", "text": "The first three recipes I looked at called for canned cream of chicken soup.  I can't eat MSG in any form and almost all canned soup has it which is why I cook everything from scratch.  This cookbook is not for me.", "images": [], "asin": "006282015X", "parent_asin": "006282015X", "user_id": "AHJA32AR4TVZS6PUC6L6PHBMFP5Q", "timestamp": 1609925494266, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It is stated to be true, but hard to believe.  If it is true; WOW!", "images": [], "asin": "B00PSS3RE0", "parent_asin": "B00PSS3RE0", "user_id": "AHWB2V572DXTKCGDK6KVMYDBOTVQ", "timestamp": 1491587616000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "I really wanted to like this book and I was looking forward to it ...", "text": "I have not finished this book. This review may get an edit if I can ever get myself to finish this book.<br /><br />I really wanted to like this book and I was looking forward to it for quite some time, even starting to read it at midnight..  But man..  It is so dry and so dull all the way to about halfway through Part 2  (which is as far as I've gotten).  So many things that I was looking forward to reading about were simply glossed over, such as the reaction to Jasnah somehow still being alive. So far that still hasn't even been explained as to how she survived other than her making some random comment about being able to use Stormlight to heal  (Stormlight can heal death??)<br /><br />Then there was the reunification of Kaladin with his family....  which was COMPLETELY glossed over in less than a chapter and absolutely unsatisfying.  Speaking of Kaladin... why is he basically a background character with no plot in this book where as the one character that has annoyed the most readers, Shallan, seems to be about half the book so far?  And her chapters are SOOOOOOOOOOO damn boring I'm about to start skipping them. I was hoping she would become a bit less annoying in this book, but she is worse in this one than she was in Way of Kings!<br /><br />If the book was focusing more on Dalinar I could live with it, but other than the few chapters about his past  (very few so far)  they have just been boring nonsense about him still trying to convince the other rulers that the Voidbringers need to be fought.<br /><br />SLOW, LONG, TEDIOUSLY DRY AND BORING SO FAR!  Hope it REALLY picks up soon or I wont even be able to finish reading it and this review will stand as it is now.", "images": [], "asin": "076532637X", "parent_asin": "076532637X", "user_id": "AFBC5ZPP3JJWNQCKWETQY32HMWUQ", "timestamp": 1510747482208, "helpful_vote": 35, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "TOO MANY CHARACTERS IN THIS STORY", "text": "If the author is going to have this many characters in his story he should put the names of the characters at the beginning of the novel. Mr. Silva is losing his gift; Gabriel Allon is now an old dude that barely makes the story. The author needs to take some hints from Brad Thor e.g. Scott Harvath has not aged a bit and is still kicking butt. If this is the best Daniel Silva can do...I'm out and I have read every Gabriel Allon book. I will NOT be buying any more of Mr. Silva's books. Pity!!!", "images": [], "asin": "0062834827", "parent_asin": "0062834827", "user_id": "AEDWO473MOGE75A63DGAMNU5LRMA", "timestamp": 1558555803835, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Didn't read like first 2", "text": "Too much telling and not showing in book 3. Book feels very bare-boned as if someone is simply telling me what happened rather than putting me in the action.", "images": [], "asin": "B01M73CCAL", "parent_asin": "B01M73CCAL", "user_id": "AF3E2IQA7P3M5NWQWEOUQTJYXHDQ", "timestamp": 1480118215000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Two Stars", "text": "did not like it...", "images": [], "asin": "1572814829", "parent_asin": "1572814829", "user_id": "AGCGEQ73PNHY26ARLDMEMOZ6756A", "timestamp": 1426178116000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Sucked bad. First 3 weeks fine although meals lite", "text": "Sucked bad. First 3 weeks fine although meals lite. Then week four no box no credit and they would not answer phone", "images": [], "asin": "0007419333", "parent_asin": "0007419333", "user_id": "AHRJKEVJIIEB422S6W2QQKNHR3HQ", "timestamp": 1528426034422, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "This is the most boring, non-creative, ridiculous book available", "text": "I have bought this book only because it was highly rated and we had it since my kid was 6 months old. Now she is about 2. I have tried reading this to her a few times, but not only I felt stupid reading this nonsense, non-existent words, and abstract graphics, but my kid never paid any attention to it.<br /><br />I cannot say who this book should be perfect for, but definitely not for most kids and adults. :) The graphics are ugly, there is only 1 tree and letters. Nothing else!!! Nothing that will keep the attention of your kid.<br /><br />The story or songs - not sure what this is, is ridiculous. \"A told B and B told C I'll meet you at he top of the coconut tree.\" How to explain my 2 year old what is going on here? :) My kid is only 2 and even though she knows every single letter, and numbers up to 10, she is not interested at all in this book.<br /><br />I wish I returned it when I could.", "images": [], "asin": "1442450703", "parent_asin": "1442450703", "user_id": "AED7LWSBM3OCNOVVXHEC5X6ROKGQ", "timestamp": 1539186712985, "helpful_vote": 196, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Too easy", "text": "My daughter loved the book.  Unfortunately she went through every page in less than 10 minutes.  It's very cute and colorful but it was too easy for my 2.5 year old.  So we returned it for a more advanced version.", "images": [], "asin": "1450854265", "parent_asin": "1450854265", "user_id": "AGJY6JJUSMFQDQYCMMFZIGZKN7GQ", "timestamp": 1424290831000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Repetitive Plot", "text": "While the book was interesting, in my opinion it suffers as a result of having four authors. Individually, their works are much better. In this case, it seems as though sections of the plot are repeated with different characters. This may have been deliberate but I suspect it shows where the works of multiple authors are \"stitched together\"r.<br /><br />This book is recommended for readers who like gore and lots of it. For other readers, I suggest that you consider other works by these authors.", "images": [], "asin": "B0042AMD2M", "parent_asin": "B0042AMD2M", "user_id": "AHXZRKNBHZZVD5RRYI33WHIGUA6A", "timestamp": 1368476362000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A True Daughter of the Ton", "text": "The beginning, up to her extended stay at Glencrae's London home and the middle to end, from hailing the gatehouse on, were vintage Laurens/Cynster. For me, the middle showed us what I would assume was what a true daughter of the ton was like. Aggravating. Annoying. Selfish. Self-centered. All to be excused with a flick of the wrist because she is a beauty and a Cynster. Even when she was being nice to others she had an agenda. As an expose' Angelica's story was an interesting study and deserves five stars. As a romantic read, not so much. I thought the Earl was an awesome character. I did give myself a pat on the back for wading through the series. Regardless of the beautiful covers, they are not on my list for re-reading. Can't wait for the next series.", "images": [], "asin": "0062068628", "parent_asin": "0062068628", "user_id": "AF34U5I4NP6TWYO3SC4NLJHXUDPA", "timestamp": 1331082657000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Definitely Not Downtown Abbey", "text": "Although this book for some reviewers is reminiscent of Downtown Abbey, my opinion of it is that it is not really quite as well done as the Downtown Abbey that many of us can't live without.  How is it different?  For one thing Downtown Abbey gives more dimension to the below stairs characters.  [[ASIN:0425262588 Rutherford Park: A Novel]] does not.  The below stairs characters are not fleshed out enough and the characters for me felt very one-dimensional.  I think that is what makes Downtown Abbey so addictive.  The characters both below stairs and above have depth and passion which keeps one coming back again and again.<br /><br />This book started very slowly too.  I almost gave up about a third of the way through but about three quarters of the way through,the story did become more interesting.  The story takes place in Yorkshire where William and Octavia Cavendish live at Rutherford Hall.  The opening chapters deal with a maid in the household who has become pregnant. She is found near a river that runs by the estate trying to kill herself and the servants run to save her. What transpires is an ongoing thread throughout the story.<br /><br />Octavia Cavendish is still a young woman since her husband is considerably older than she is.  William Cavendish married her for her money even though her family is in trade.  He needed her fortune to renovate the estate.  He maintains the strictures that the aristocracy live by.  Those strictures are suffocating Octavia.  She has become a shell of the woman she was when she first married William.<br /><br />William and Octavia have a crisis in their marriage and Octavia decides to step out of her cage.  She begins to turn things on their head by the end of the novel.  I felt that the ending was very unsatisfying.  One is left wondering what will happen to the Cavendish family.<br /><br />I do see that there is sequel to this one and I may read that even though this one fell somewhat flat for me.  This is a three star book that might redeem itself in the sequel.", "images": [], "asin": "0425262588", "parent_asin": "0425262588", "user_id": "AH5O6WWC5UGG2VKMETUAERLDY47Q", "timestamp": 1426964289000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Bookshot no way", "text": "Glad I did not have to pay for this bookshot.. Predictable and not sure what to call it. Why a new word to describe a short very short story.", "images": [], "asin": "B01HMRF5FS", "parent_asin": "B01HMRF5FS", "user_id": "AG6SD4XQUOOTEEOEKLK26Q5KZ66A", "timestamp": 1471103006000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three stars for this book", "text": "I decided to check out the book after reading some reviews and found that I was somewhat disappointed with the book. The plot of the book seemed too absurd (yes, I know it was thriller fiction, but still the plot seemed silly). The SIGMA team members are almost too \"good\" and nearly immortal in their abilities to escape danger. The book moves quickly and Rollins keeps the action going, but I just did not enjoy the book and thought the underlying plot involving Nazis, runes, intelligent design, quantum physics, etc...was too involved, too \"over the top\" and too far fetched.<br /><br />Not a bad read...but I wasn't that impressed.", "images": [], "asin": "0060763884", "parent_asin": "0060763884", "user_id": "AFVB6RVIVR4I42CSRC7SHHNBPJ3A", "timestamp": 1155762611000, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Okay", "text": "It was interesting for the most part. There were too many swear words. I started getting bored towards the end. There wasn't enough intensity or build up.", "images": [], "asin": "0765328674", "parent_asin": "0765328674", "user_id": "AG5UI5TTO7NX6ZJKYALVOBIOYNYA", "timestamp": 1445973093000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Big ol white boarders ALLL the way AROUND the image!!!", "text": "I bought these to use in my business but didn't realize they have a white boarder ALLL the way AROUND!  Fussy cutting these are going to suck biscuits but its not the fault of the manufacturer, that I made an assumption!!!  So if you're buying these because you like stickers, go for IT!!!", "images": [], "asin": "0486271463", "parent_asin": "0486271463", "user_id": "AEHS5DZZ36JRVXA5BC4JJBLSHPDA", "timestamp": 1575625219185, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Builds to nothing but it still haunts us after we are done", "text": "There is not much to this novel but it's effective when you finish it. When I was done the book i thought what really happend what was the point of the book and I came to a cunclusion it's about life and to see how a memory will haunt you the rest of your life and it show us if we can forgive god and to see if we belive in god. Not much ahppend through out the book I enjoyed the holicost flashback. Overall it's not as good as night and I havent read dawn yet so ic an not say but it's enjoyable.", "images": [], "asin": "0809023091", "parent_asin": "0809023091", "user_id": "AEDCSJIZR7GKBDNTRN65WXEOWL7Q", "timestamp": 1151421600000, "helpful_vote": 4, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Not for me", "text": "So drawn out and slow moving.  Can't imagine why the fuss.", "images": [], "asin": "1451649320", "parent_asin": "1451649320", "user_id": "AHYYNTUYOY643QKQNBOOZGNZSD6A", "timestamp": 1453493835000, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Children's book: language and art", "text": "After reading the adult version of the book \"Modoc,\" which was fantastic, I ordered the children's version out of curiosity, as I do not have a child. However, my mother, 80, who can no longer read long books, greatly enjoyed the emotive aspects of the story.<br /><br />As a retired education administrator whose job it was to order curriculum for our county-wide district, I have read hundreds of children's books. \"The World's Greatest Elephant\" is a children's book with a good vocabulary, and has a theme of overcoming difficulties in life. It is the type of story that could spawn meaningful discussions.<br /><br />However, the artwork is very dreary (mostly muted reds and grays - probably a cost factor in production of the book). For instance, the picture of Modoc being rescued from the ocean simply shows an elephant in straps against a stark white background. There are never any blue skies. People's faces tend toward the \"impressionistic\" end of a continuum rather than a realistic, more photographic quality. Bram, shown atop Modoc's back in a circus picture, has the face of an old man and no neck. The artist's strong point was certainly not in drawing people.<br /><br />It is unfortunate the Ralph Helfer couldn't have found a better artist, because the story, with good art and color, could easily have been rated a \"5.\"", "images": [], "asin": "0399241906", "parent_asin": "0399241906", "user_id": "AEVKZARGEXF4HHOZPI62PTAPCS3A", "timestamp": 1257703360000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Slow-Moving, Reasonably Complicated Mystery", "text": "In the newest Inspector Rutledge mystery, the police detective is summoned to the home of the Tellers. The family's youngest brother, a missionary recovering from illness and not eager to go back into the field, who was in a hospital suffering from a mysterious paralysis, has vanished. Not only are there no leads, but the family itself, comprised of brothers (included one wounded in the Great War), sisters, sisters-in-law, and an often-addled grandmother, all seem to be hiding the clues that might tell Rutledge where Walter Teller is. Then, out of nowhere, he reappears, just as Rutledge is handed another mystery: a woman, the wife of a Peter Teller, has been murdered in her home in a country village. Is this Peter Teller related to the formerly missing man, Walter Teller? And why was she murdered?<br /><br />In a subplot, Rutledge is assaulted by a knife-wielding young man on a bridge, but the assailant escapes, attacking other men who resemble Rutledge. It is obvious the tough wants to finish the job on Rutledge. Can Ian capture his assailant before he strikes again?<br /><br />As in A Test of Wills, the specter of the Great War is keenly felt. Rutledge's search for the truth was absorbing, but I had a hard time caring about the Teller family at all (even the one person they were protecting), not to mention the neighbors of the murdered woman. Even she turned out to not be very sympathetic. The mystery was fairly complex, even though certain well-placed clues revealed who the husband of the murdered woman was long before the ending. I'm afraid that at the end, it turned out I didn't really care much who killed who and why. YMMV.", "images": [], "asin": "0061726168", "parent_asin": "0061726168", "user_id": "AGNSUP65FG6GKSCQJKEH7A4YZLEQ", "timestamp": 1260897312000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "OK", "text": "OK", "images": [], "asin": "0385514298", "parent_asin": "0385514298", "user_id": "AHGYBV3IF6R3MGE4P5MFBA5HHJKQ", "timestamp": 1463600331000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Kind of biased // Needs to consider the entire Earth", "text": "This book isn't all that bad if you want to understand more about Earth but it states that the 25 year time period after the cold war is the most peaceful when this claim is extremely debatable", "images": [], "asin": "0190935936", "parent_asin": "0190935936", "user_id": "AHM7MDI5OML7SAQMQXH4MLROIESA", "timestamp": 1564191956046, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Disappointed!", "text": "I see some reviews say \"rare photos.\" There were hardly any and those that did exist were nothing special. Too much of the book was of inconsequential data obtained from old reviews. Even Chester's death was poorly written without any info. Wikipedia had more news. For $45 ... horrible, and I was really looking forward to reading personal info. Don't believe those reviews and don't waste ur money.", "images": [], "asin": "1476677298", "parent_asin": "1476677298", "user_id": "AEXLBV4BSSSA3CCW2YGM7RYYASJQ", "timestamp": 1606290250715, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Meh book quality, like a pamphlet", "text": "Not a bad story perse and Amazon did nothing wrong but this book irked me. I get these level 1 type readers, their size, paperback, but this literally was even CHEAPER quality. It was more like a PAMPHLET than a soft cover book. I bought it because my son's friend LOVES pizza and it was his birthday and after seeing it I was almost embarrassed to give it to someone.", "images": [], "asin": "0545686334", "parent_asin": "0545686334", "user_id": "AE7VS2Y3K2B2OBAI7M7B47O4ITNQ", "timestamp": 1487298761000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "2004 book!", "text": "In computer terms, this is like the King James Version!<br />How about a new book on this 2010 CS5 software?  This is almost useless!", "images": [], "asin": "0596006004", "parent_asin": "0596006004", "user_id": "AFXTBKNIUL2BP5WUW4XENECKOHCQ", "timestamp": 1305483943000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "The Academy will love it! ... As for the rest of us? ...", "text": "... The Academy will love this book! It reads like a doctoral dissertation Ph.D. thesis - well organized, lucidly presented, academically sound ... and BORING AS [HECK}!!! ... I excitedly bought this book with the hope that it would explain to me the mysteries of the human mind in relation to religion. Instead, I got a 333 page book on one man's ideas about WHY he thinks humans BELIEVE in what they do, and HOW this occurs in society. ... Sounds good so far. The problem is that it just does not go FAR enough, DEEP enough, or WIDE enough into the topic of beliefs. Also, it is presented in a way that is very hard to understand for two reasons: 1. As organized as it is, the reader does NOT know ahead of time WHERE it is all leading. 2. The way this author writes is VERY confusing. ... Listen, I've read over 1000  books in my life - most of them before I turned 30 - and, outside of a few Math Textbooks in math class in college, this has got to be one of the HARDEST books to read I have ever read in my life! No doubt about that in my mind. ... I give this book 3 Stars because the author, indeed, DOES make MANY excellent points along the way. It's just too bad you have to sift through so much sand before you find those diamonds!<br />... I am glad I read this book. I learned a lot. Still, I think it misses its mark. I think the author needs to read some Terence McKenna and have his mind blown. The insides of this book are just like the cover: dark, spooky, black & white, and always talking about science or witchcraft. ... This book needs to be revised, and it needs to add some COLOR and JOY and LIFE to its pages. - The Aeolian Kid", "images": [], "asin": "0465006957", "parent_asin": "0465006957", "user_id": "AGSHI6RR3W4KADZ2ZGG4WR5CGLZQ", "timestamp": 1019532005000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Boring is the only word I can use to describe this book", "text": "I really tried, I wanted to like this book,I loved the title, I love water and swimming and don’t mind slow books  but it’s so boring. It seems like things are happening but they really aren’t. The author isn’t very good at moving between different time periods. Also pictures in a novel very much annoy me. I read a 100 pages before giving up. I don’t need a fast paced book, I mean right now I’m also reading Moby Dick. I can’t explain exactly why I didn’t like other than I was just so bored with it.", "images": [], "asin": "1641290005", "parent_asin": "1641290005", "user_id": "AECQQBG6YRYCOJL2NCB2H3V6LD6Q", "timestamp": 1547410357021, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Disappointing!", "text": "I'll say up front I am a huge JLB fan. I've read every book and anxiously awaited the next. However, as I started Creole Belle, I found myself wondering if he had turned his writing over to somebody else or was just really jaded! Sure, it still had the Burke decriptive touch that paints a picture like nobody else. But other than that it was choppy, something I could never say about his other books. I did not read the other reviews until after I finished but a few hit the nail on the head. He definitely has an axe to grind over the BP oil spill and its effect on Louisiana. But he dwells on it ad nauseum! And to the detriment of the story. A few of the times I felt it broke the momentum of the story even. As I read I started putting more thought into his rants than on the storyline. There is alot to enjoy in the story but it does not compare, in my opinion, to his other Robicheaux novels.", "images": [], "asin": "1451648138", "parent_asin": "1451648138", "user_id": "AEIUWSUPDULHXB7J66JFYJPLJ2AA", "timestamp": 1345139489000, "helpful_vote": 4, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Not what I expected!", "text": "I did not realize these three books were paperback, small size, I expected them to be like the Author's other books in size, also soft cover paperback but larger to add to the collection my sister and I have going.  So I am disappointed!", "images": [], "asin": "0515132020", "parent_asin": "0515132020", "user_id": "AEZFEDHQNNN3KPZTK6EJQYU2B35A", "timestamp": 1374760065000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Not fond of these books!", "text": "I normally love this type of book, but I have now read all three of these Dreamlight books and am just not a fan.  They are just a little too weird for me.", "images": [], "asin": "051514925X", "parent_asin": "051514925X", "user_id": "AFNMZRXGIDA56OUZUZT5LGRPPEWQ", "timestamp": 1355235694000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Too Easy, Even For Toddlers", "text": "Bought this for my 21-month-old, and it was way too easy for him. There is basically zero challenge in locating the objects on the page; they're gigantic and not really hidden. This book would be fine for a baby maybe 12-18 months, and it's fine as a picture book, but it's too easy to be a good look-and-find book for toddlers.", "images": [], "asin": "1412774551", "parent_asin": "1412774551", "user_id": "AGCTTEKVHIGWV6LOZRKXXAJTWD5Q", "timestamp": 1384960701000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Flimsy.", "text": "Not well made and very thin.  Some of the artwork is confusing.  The concept is good, but I question some of the words chosen as these are meant to teach children how to read.", "images": [], "asin": "0439845009", "parent_asin": "0439845009", "user_id": "AF6SAKQUBLJFB5NUN676UXJ5UJOQ", "timestamp": 1573357302328, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Totally biased and unbalanced", "text": "The author is worshipful of the ground on which President Trump walks. No balance only one sided & biased in every way.", "images": [], "asin": "1546083421", "parent_asin": "1546083421", "user_id": "AEDIVZ5DFNZGGO6WXHPTSQ3SFIJA", "timestamp": 1534701715418, "helpful_vote": 11, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Great story", "text": "(3.5)<br />Wow! There are a whole lot of reviews for this book. I feel like I'm extremely late to the game here. There was a lot of hype around this book and as you can probably see by the amount of reviews and the mostly high reviews it's worth it.<br />I won't go into an extremely detailed synopsis of this book because you've probably already read quite a few of those by the time it took to get to this review. I'll just do a little thing here and there.<br />This book follows a Korean family starting from the early 1900's on. When Sunja finds herself pregnant by a man who is less than available a nice man, a tubercular minister, says that he will marry her and take her to Japan with him. From there the story really just takes off and you get to see so many struggles from inside the family to things as big as prejudices and exile.<br />So much happens in the novel I can't even begin to touch on everything without making this review a mini novel. It's such an expansive and immersive story that you can't help but get hooked and invested in the lives of these characters. This story will make tear you up at times and make you laugh at other. One thing it definitely will do is make you thankful for the things you do have.<br />I would recommend this to anyone that is interested in it from what they have heard about it in general and those that are into generational family sagas. It's a very good story and one that won't soon be forgotten.", "images": [], "asin": "1455563935", "parent_asin": "1455563935", "user_id": "AHWCZ47A7FIYEJ7KEJG3BO3F5YXQ", "timestamp": 1617807073570, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Cute, small book with some interesting photos. Several are repeated through the book though", "text": "I like the idea of snow, but as a native West Texan, I have zero interest in actually being in snow. So this little book caught my eye as a way to see the beauty of a snowy landscape without having to actually be cold and miserable.<br /><br />There are some really lovely photos on these pages and some mediocre pictures. I do love the laundry list of New York City architecture and many of the photos highlight some very interesting architectural styles. It's a shame this is a physically small book rather than a true coffee table book because there are several pictures that would have been better served by being larger so we could really see the details. My primary reason for the one star deduction is for the repetition of many of the same photos - they are repeated several pages later in a different size. I can't believe that the photographer and editor couldn't come up with enough unique photos of the busiest city in America to fill one small book.", "images": [], "asin": "1781574154", "parent_asin": "1781574154", "user_id": "AHPOHKN4PU4W3V5PGFL7AGTAD2AA", "timestamp": 1501792019924, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Hard to get into", "text": "I purchased this book on the recommendation of a friend who knows that I really like historical novels.  I have found this book very hard to get into.  I have read and enjoyed many of Colleen McCullough's books, but I have had trouble following the plot of this one and remaining engaged in the story.", "images": [], "asin": "B000SEP3WI", "parent_asin": "B000SEP3WI", "user_id": "AGQRLLJM5REI676SNN7KAUIYT4NQ", "timestamp": 1326832089000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 3.0, "title": "Not My Favorite Hunter S. by Far", "text": "If you're very interested in political rants about Nixon, this is the book for you. Otherwise, go for Songs of the Doomed if you want a better, funnier Gonzo classic.<br /><br />I was incredibly excited when this weighty tome arrived, however, I ended up skipping through much of the book -- not even finishing it, even. Much of the book is simply a long-winded gripe session -- probably not the Hunter S. that you have in mind.", "images": [], "asin": "0743250451", "parent_asin": "0743250451", "user_id": "AH5TEFY7DHIJ53WSQ5BCYFIG4IRQ", "timestamp": 1397237342000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Don't let the Nancy Drew name fool you. This is NOT a children's book.", "text": "This book is targeted towards YA audiences, and it contains cursing, multiple scenes of same-sex or opposite-sex couples making out, and a drug-related mystery. The library where I work cataloged this book as a juvenile graphic novel, so I raised the alert, and we're going to get it in the proper section. For that reason alone, I'm glad that I read this, but I didn't like anything about the book.<br /><br />Nothing about this story gripped me, and its \"modernization\" is lazy beyond description. The author changed side characters' races and sexual orientations, and she dropped a few superfluous references to Taylor Swift, but that was pretty much it. Even though Nancy had a cell phone, she didn't bother to use it, and she acted selfishly throughout the entire book, letting her friends run all over town and fear for her life because she couldn't bother to keep her phone with her or answer it when it rang. Nothing about this updated version of the character is likable or appealing, and I will not waste my time on any future installments in this series.", "images": [], "asin": "1524108499", "parent_asin": "1524108499", "user_id": "AG22K7WJCWQPGNTE4WZ3ATHWE7LQ", "timestamp": 1569979312604, "helpful_vote": 8, "verified_purchase": false}
{"label": -1, "rating": 3.0, "title": "Everything Raw", "text": "Though this book attracted my attention on Barnes and Noble shelf, once I got it .. well it didn't quite captivate me as much as I thought,if you are a beginner it's a good read.", "images": [], "asin": "1440500118", "parent_asin": "1440500118", "user_id": "AEKG47U2ZSDWCBQWO2CYJJOHGEBQ", "timestamp": 1298897209000, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "the article doesnt hold together very well", "text": "cumbersome", "images": [], "asin": "1604682108", "parent_asin": "1604682108", "user_id": "AEPUVBLMYKNIYOW7EB34XJY2UVVA", "timestamp": 1409332053000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Shallow characters", "text": "The only thing I liked about this book was the policy discussion--how industry hoodwinks citizens into environmental destruction in the name of jobs.  The book gave me a keen sense of place given the recent news reports of water contamination due to mining in West Virginia.  It is a graphic discussion of unregulated mining practices such as mountaintop removal that destroy not only scenery, but also quality of life.  Wake up W. VA.  It's already too late. &#34;I wouldn't drink that water if you paid me.&#34; US Senator Jay Rockefeller, W. VA.  Wake up America.  The proposed keystone oil pipeline, rail car shipments of heavy crude from Bakken--we're all in this together.", "images": [], "asin": "B00969GFFU", "parent_asin": "B00969GFFU", "user_id": "AFKXF2HKF6E3SMUMW3LZWOAWHBYQ", "timestamp": 1392135353000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Choppy", "text": "Cute book..love the size and how sturdy it is. The story is choppy and ends abruptly.....not a great flow to this book.", "images": [], "asin": "0375824936", "parent_asin": "0375824936", "user_id": "AHDERFGHYKGK2YCQPANJJSND2IKQ", "timestamp": 1486403234000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Doesn't deserve the praise or the hype", "text": "All I can say about this book is: really?<br /><br />By page 16, the book is already absurd, and not in a dystopia sci-fi way, but in a sloppy, bad-writing way. Examples:<br /><br />1.) Really good dystopian fiction almost doubles as survival manuals. See &#34;Life as We Knew It&#34; for an example. In this post apocalypse world, once A WEEK a 16 year-old girl walks two miles with an M-16 to bring back all the water she can carry. A loaded M-16 weighs about 9 pounds. A gallon of water weighs about 8 pounds. The average person uses a gallon of water a day. It seems unlikely that she could have carried enough water to last a week (56 pounds + 9 for the gun) for two miles with a loaded M-16.<br /><br />2.) The survival items she packs for a long trek somewhere else, in a world where there's no other people anywhere, include Tide and deodorant. Seriously. So there's apparently working washing machines, even without people, and Tide is the brand of choice? You don't even take crap like that with you when you go camping, let alone in an &#34;end of the world&#34; environment.<br /><br />3.) The author describes Cassie's greatest worry prior to this event being whether or not anyone thought she was pretty. That's how you know this is written by a male author. Why is the protagonist female then? I have no idea, but it's not clear whether or not Rick Yancey has ever actually spoken to a 16 year old girl.<br /><br />This is complete garbage, and the praise just makes me distrust reviewers. Try &#34;The Knife of Never Letting Go&#34; instead.", "images": [], "asin": "0142425834", "parent_asin": "0142425834", "user_id": "AEKNNQCOA4JSMP7IC7NNFEFDJCZQ", "timestamp": 1438569619000, "helpful_vote": 18, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "The Silkworm (Cormoran Strike #2)", "text": "Another suspenseful thrill ride in the series. I think I'm addicted to these Cormoran Strike stories! Just love the writing... I enjoy being immersed in his world. Can't wait to see what happens with Robin. And I'm hoping to see another Al Rokeby appearance!", "images": [], "asin": "B00IJJUIOM", "parent_asin": "B00IJJUIOM", "user_id": "AFYSEJGFFIUVGQ7BCBDR4MRQR7HA", "timestamp": 1441065125000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "... right and but it even further right to Hilter like.", "text": "Take far right and but it even further right to Hilter like.", "images": [], "asin": "0984885617", "parent_asin": "0984885617", "user_id": "AFXA6ODWCXRGINVHD46MTWEVUKOQ", "timestamp": 1488735388000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Lots of recipes. Many I will never use.", "images": [], "asin": "1593371195", "parent_asin": "1593371195", "user_id": "AF6YJ7VO44M5IUZH5JOQG2HKDRSA", "timestamp": 1523567182464, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Cute book but not as good as the other \"Old Lady Who Swallowed A...\" books.", "text": "We really love all the &#34;Old Lady Who Swallowed A...&#34; books.  I bought this one for my 3 year old daughter for Valentines Day to add to our collection of these books.  While the book is cute, it was a little boring.  She swallows glitter and some lace and ribbon. The book was just ok this time.  It wasn't as cute as the halloween or easter themed ones of these books.", "images": [], "asin": "0545352231", "parent_asin": "0545352231", "user_id": "AHK363LYP7FNQDYPDWUA2W4GQKXQ", "timestamp": 1520256214216, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Waste of Money", "text": "I bought this slim book hoping to get some kind of feel for this brand new operating system. The author does a good job of making his instructions clear, but he doesn't cover but a small percentage of what you need to know. In fact, most of the book is about useless things like changing colors and arranging aps but doesn't have anything about things like creating a second user account. I have nothing against the author, I just think there should have been more information given.", "images": [], "asin": "1449326641", "parent_asin": "1449326641", "user_id": "AHDRPVJ2ZPQQNK4SP2LTTD2ENSCA", "timestamp": 1357515900000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Just ok, could have been a lot better. 2.5-3 stars", "text": "Actress extraordinaire Gabrielle Union wrote a story about her life, her loves, her struggles and her triumphs. She tackled every issue from teenage sex, rape, drugs, racism, the music industry to her struggle with infertility. The format is appealing, as a conversational prose, like she was having a conversation with a friend. While I thought her thoughts on race were interesting, some of the things that I thought she really could have talked more about were glossed over. Granted, I know that her rape at a Payless Shoe store when she was a teen was difficult, I expected her to mention more than she did. She briefly mentioning the settlement (i.e., money), and towards the end mentioned meeting with women who were also victims. I think I would have liked it more had she really discussed that versus some of the other stuff she rambled about. So if you are asking yourself, why only 2.5 to 3 stars, it was because I did like \"some\" parts of her discussion regarding being a step parent and her attempts at balancing a family and work.", "images": [], "asin": "B0742MGR31", "parent_asin": "B0742MGR31", "user_id": "AEGYU6OM2X66SMZN6AF3TSQ3N5PQ", "timestamp": 1580355382479, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Not it!", "text": "I was looking for more of an in-depth look at how to set up a trucking company. This book only gives a very generalized look at things. It also switches back and forth between starting a trucking company and picking a trucking company. I wouldn’t waste your money on this one.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71OtdsSrTOL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71OtdsSrTOL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71OtdsSrTOL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71iLsf13FGL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71iLsf13FGL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71iLsf13FGL._SL256_.jpg"}], "asin": "B09PW7LJJ3", "parent_asin": "B09PW7LJJ3", "user_id": "AEDXTSRKZTANQDLNS6KAUYY3UILA", "timestamp": 1647523618931, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great Story but seller lied when they said the used CD's were in GOOD condition.", "text": "Every CD had scratches on the first few chapters and it was like listening to Max Headroom again.  The very last CD would not even play so I don't even know how the story ended.  I've never had a seller tell me that CD's like this were GOOD condition so I'm really bummed that I can't give the reseller a bad review.  Kyle Mills is a great writer and that is the ONLY reason i gave the review 3 stars.", "images": [], "asin": "1402567847", "parent_asin": "1402567847", "user_id": "AF3IEUGVAWWL2HXVLZQ3RG7BBLEQ", "timestamp": 1571866627766, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Refreshing, light read.", "text": "Mr Lynch's Holiday is the story of widower Dermot, a retired Irish bus driver who hails Birmingham who makes an unexpected visit to his son Eamonn who now lives in Spain. Dermot is unaware that Eamonn is severely depressed following the departure of his girlfriend who has returned to the UK.<br /><br />Eamonn is living in Lomaverde, a remote, half-finished ghost estate, where a handful of other ex-pats are struggling to put a brave face on a financial disaster. Many of the unoccupied houses are unfinished, electric cables are exposed on unfinished roads and squatters have moved in. While Dermot expects a relaxing two week holiday, he finds himself dealing with his son's depression and self destructive actions.<br /><br />The strongest parts of the novel are Dermot's memories and the interactions between the ex-pats who try to organize the estate and some social interactions. Unfortunately the character of Eamonn is over-the-top. He's a walking disaster who careens from one faux pas to another, but in spite of its flaws I enjoyed the book for its refreshing, optimistic tone. I'd say that this is basically a light read, but very well done in spite of its weaknesses and slightly annoying, too-pat ending.", "images": [], "asin": "0805091815", "parent_asin": "0805091815", "user_id": "AFKX24ALWAPX366KX6DWTOBWLQAA", "timestamp": 1435504240000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Story good.  Price terrible.", "text": "Mom liked this book. I get all these romance novels for her. She loves to read and this book was no exception. I know when she likes a book because she will read it in a day or two. This book was read in just over a day.<br /><br />I never tell about the book itself as I DO NOT want to spoil anything for another reader. Mom may give me a synopsis about the book but I never talk about the story line. Hate it when someone tells me something about the story that occurs 3/4 the way thru a book or a reviewer tells me they do finally get married. I don’t want you spoiling my reading so I don't want to spoil yours. I figure it you are wanting to know a little about the story, you can read the synopsis that Amazon and the author has provided on the book page.<br /><br />Mom says she liked this book.<br /><br />The reason I gave this book only 3 stars was because of the current price.  The book is listed today on Amazon at $40.79.  That's to much.  There are other enjoyable love stories that at under $10.  Based on Mom's comments, I would have given this book 4 stars for the book and content.", "images": [], "asin": "1784296198", "parent_asin": "1784296198", "user_id": "AFMTB6XAI3YBCJVTOGKOFJU3LUOQ", "timestamp": 1522961411453, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Josefina's Cook Book", "text": "It's OK for my class of ESL adults, but thee ar the things we all cook anyway.  i'm not sure I'll use it much.", "images": [], "asin": "1562476696", "parent_asin": "1562476696", "user_id": "AEMFROPUL54CK6PTIELEUTZFQMHA", "timestamp": 1368841143000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "The first volume was good, but . . . .", "text": "I was fairly impressed by many of the subtle messages in volume one of the series, but this installment ~ albeit containing a few scattered gems ~ has degenerated into the angst-, cliche-, and puppy love-filled perspective of a less-enlightened character who, over the course of 300-odd pages, becomes extremely irksome.  The constant repetition of his waking-state go-to's completely overwhelms and obscures any metaphysical truths that crop up much more sparsely than in the previous.  To be honest, I bought the whole series on the recommendation of a friend, and now I have definite reservations about continuing.  At the least I've had to shift to some different books to create a bit of a breather.  After an entire volume of constant cliches (plus the author's tendency to use the word 'I' in place of the grammatically correct 'me), I was not exactly smiling like a filosterops.", "images": [], "asin": "0958670080", "parent_asin": "0958670080", "user_id": "AGS2ST7VF7K37W4K4SMXHJIZJFAA", "timestamp": 1410858220000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "An ugly portrayal of Scotland", "text": "This book started out like his first. It was a steadily developing mystery with believable scenarios and characters. Unlike his first book, about page 200 it goes bizarre and takes a nose dive. It is difficult to believe that the Scottish police are a morally bankrupt, inept, alcoholic, dishonest force. I know this is fiction, but this was way over the top.", "images": [], "asin": "0312339976", "parent_asin": "0312339976", "user_id": "AGAVPAXHLSVSZJMTKWMSXVQPXBLQ", "timestamp": 1447540893000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Wish for information", "text": "I wish it had more information on the birds themselves.  It's fine, because you can list your observations, but it doesn't give any interesting or quirky details about the different species.", "images": [], "asin": "0486410595", "parent_asin": "0486410595", "user_id": "AEIC24AVB4S5LFL4RBCWCA3GB6FQ", "timestamp": 1384742227000, "helpful_vote": 3, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "No...Solo should be Solo", "text": "If I wanted a cookbook with recipes to entertain friends...I would use one I have or buy one. So no ...irritated to find a chunk of recipes dedicated to precisely that!!!!!! NO!!!!!!!!! Those for solo are nice but don't bother with this book...under false pretenses.", "images": [], "asin": "0544176480", "parent_asin": "0544176480", "user_id": "AH5P3O7AADCQIXRJP3JP3VAVD7QQ", "timestamp": 1461546705000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "For very dummies", "text": "if you need a first impression, just found out that computers exist, if you think PHP stands for a new boygroup, then this is the book for you.", "images": [], "asin": "0764575872", "parent_asin": "0764575872", "user_id": "AGIA5FNEABN3PBYD5OH3TIZUBQXQ", "timestamp": 1174043832000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Basic with no pictures", "text": "Book is ok, very basic, no pictures.", "images": [], "asin": "1981340289", "parent_asin": "1981340289", "user_id": "AHXNTNMUUXREZRN2X4D5JNDQYXZA", "timestamp": 1540658143518, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Some basic background, but quite expensive.", "text": "Not sure what to say about this.  It was ... interesting.  Quite a bit of information about the school itself, and a little bit of information about Mary's time there. (Her grades, for example, and some correspondence.) Also a short chapter on her life after she graduated.  But it's a VERY slim volume, with large print.  I read it all in about half an hour. So it's quite overprices for what you get.", "images": [], "asin": "1545241899", "parent_asin": "1545241899", "user_id": "AGNQCHN5GPWJF53ZD5F6BHZL6O4A", "timestamp": 1513108998756, "helpful_vote": 43, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Three Stars", "text": "It's a great book, but some of the pages started falling out when I started reading it.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Emm2Y64QL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Emm2Y64QL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Emm2Y64QL._SL256_.jpg"}], "asin": "099604180X", "parent_asin": "099604180X", "user_id": "AGPQQS2467Z5JHSAV66DLQN4LZPQ", "timestamp": 1469744019000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Found broken glass inside book!", "text": "What the heck?! We found broken glass in this childrens book! Not cool", "images": [], "asin": "0439513200", "parent_asin": "0439513200", "user_id": "AELX2ISURW2EADAR7I2KCBXQZXNQ", "timestamp": 1645221447103, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Good Resource for Color Mixing", "text": "Used seldom but when needed to select a color that you have problems mixing, it comes in handy. Price is reasonable.", "images": [], "asin": "1600582664", "parent_asin": "1600582664", "user_id": "AFOWD4J5ICFRPHR2RQVZVUKWICAA", "timestamp": 1571577963045, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A much earlier Higgins", "text": "I have read 90% of his books and this one was not one of the best. It is not plausible and the characters seem contrived.", "images": [], "asin": "0671676156", "parent_asin": "0671676156", "user_id": "AGAVPAXHLSVSZJMTKWMSXVQPXBLQ", "timestamp": 1375562129000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "for collectors", "text": "for collectors", "images": [], "asin": "0794845673", "parent_asin": "0794845673", "user_id": "AFUFY4ZETWPJW2K5PH4GSFB4ZXMA", "timestamp": 1542038120379, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Better books are out there.", "text": "The book was not as educational or inspirational as I had hoped.", "images": [], "asin": "1604694572", "parent_asin": "1604694572", "user_id": "AG4IGNE2J3EQ7DQNRAN47TFHFZRA", "timestamp": 1559952727521, "helpful_vote": 1, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Did not finish", "text": "I plowed through the first section about the deceased's sex life and three wives which I found of no interest, forged on into the second section but decided to give it up as it wasn't what I was looking to read. I was looking for an actual story. Lots of references to authors and writing.  I thought it was a book about a dog.", "images": [], "asin": "0735219443", "parent_asin": "0735219443", "user_id": "AHH3BWKJUQ5TNBRLJ6RXHKZJ2OFQ", "timestamp": 1556477428117, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Straight to the Goodwill box", "text": "I got this for my autistic child and decided it was not a good idea.  I opened the book in the middle and the first item I read was about how ancients used to take a little poison -  what????  take a little poison?  that doesn't belong in a children's book especially a child that might read that and think that was the thing to do.  Aside from that I guess the other things might be okay, but I didn't feel like reading anymore to find out.  The print was smaller than I would have liked.  I guess I could have removed that page from the book.  But now I know to read every book cover to cover before I pass it on to a child.", "images": [], "asin": "B0874KZ661", "parent_asin": "B0874KZ661", "user_id": "AFQTHEWF7N5B6FS3K3AC7ZBY7N7Q", "timestamp": 1598867068984, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "A Stumble Of Dragons...", "text": "I'm giving this one star because after waiting years for the story to pick up again.  This book was more disappointing than the last.  It didn't go anywhere.  In the end we're basically where were with these dragons before the book.  It was more plots more characters, boring, slow, and hard to finish.<br /><br />Hard to finish is the least horrible thing I can say.  I bought this book on pre order years ago.  So I got it as soon as it came out.  I just finished it yesterday.  I've read at least a dozen books since starting this book.  I finally resolved to finish it, and with that decided that this series is done for me.", "images": [], "asin": "0553801473", "parent_asin": "0553801473", "user_id": "AH36E4W676AH46RCANRCFCDPYP3A", "timestamp": 1331655828000, "helpful_vote": 17, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Historical fiction of Far North PNW", "text": "Bought it bcuz I lived there growing up. Not as focused on Whidbey as I expected. Natives fighting whites. Life in canoes on the waters. Not my style.", "images": [], "asin": "0997843659", "parent_asin": "0997843659", "user_id": "AGWDWNBJFSKL5SYQWCUHF3OUR3EA", "timestamp": 1656613184687, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "DO NOT BUY THIS BOOK: Solidly Southern propaganda", "text": "This book is in the format of a children’s book with giant type and spacing it is probably only about 15 pages long and does not contain very much information on the subject and is mostly write ins of the author. Absolutely paints all of Floridians as southern sympathizers and racists.<br />Do not buy this book it’s terrible.", "images": [], "asin": "B08C8Z61RR", "parent_asin": "B08C8Z61RR", "user_id": "AGVPU3TYLJPYTYZZEHSR47MANDCQ", "timestamp": 1632962037290, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "Completely not affordable!", "images": [], "asin": "9991509828", "parent_asin": "9991509828", "user_id": "AHFTDXC6V5FIBWPHPT2SV7H4YM4A", "timestamp": 1435277450000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Poor images, difficult to follow written knot tying steps", "text": "There is a good amount of useful info in this book, like what makes one knot more useful in a given situation, but both the diagrams and the written instructions for tying the knots are too small with little contrast for visualizing the tying of the knot.  The written instructions are, in my opinion, difficult if not impossible to follow.", "images": [], "asin": "1698150857", "parent_asin": "1698150857", "user_id": "AG5NWBV3KICK7HSCD3DCGKGD7S3Q", "timestamp": 1645544916880, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not as good as I expected.", "text": "I read rave reviews for this dragon coloring book but the paper is lightweight. I'm keeping it as I am an old dragon and it's different than the other coloring books I have.", "images": [], "asin": "1973832496", "parent_asin": "1973832496", "user_id": "AHUYHJVBLSKOQCR5LBCIQCQMXYVQ", "timestamp": 1607390755766, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Book is great for our small group.", "text": "The book is in pretty good shape, but it is not in fact new as the title said. It had a personalized note in the front where it was given as a small group gift to a couple, and also had writing on some of the pages.<br /><br />With that said, the content is pretty good and we love the discussions that spurn from it in our small group.", "images": [], "asin": "0801013097", "parent_asin": "0801013097", "user_id": "AGXCHPHBQXLJWPR7S2DD2TAR57UQ", "timestamp": 1594779704671, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Supplement curriculum", "text": "Supplement curriculum", "images": [], "asin": "003078137X", "parent_asin": "003078137X", "user_id": "AFLAQQTBXMKBQ4ND2XQRETRZKEGA", "timestamp": 1612712209998, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Very complex.", "images": [], "asin": "0553380168", "parent_asin": "0553380168", "user_id": "AHVDIJ33A2GIE2D2OMDNHG7ONXRA", "timestamp": 1495854755000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Three Stars", "text": "Good book", "images": [], "asin": "B002CLNNW2", "parent_asin": "B002CLNNW2", "user_id": "AFK4NKFJEKVY73TVAZJXYJCI7Z3Q", "timestamp": 1418158271000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "below average book on travel photography", "text": "There are tons of tutorial books on travel photography out there. You're probably asking should you buy this one instead of one of the others? Based on my experience, I would say no. The biggest problem is that the example photos are not very inspirational. Few of the photos are of recognizable landmarks, so you cannot easily compare his ideas with photos you have taken in the past. Most of the photos could be taken anywhere, which is not my idea of \"travel\" photography. I prefer travel photos that highlight unique locations. Further, the printing quality is kind of dull (compared to real printed photos), which is not very encouraging. The text of the book does have some useful information on travel photography, but without inspirational photos to back up his ideas, I lost interest quickly.", "images": [], "asin": "0240823915", "parent_asin": "0240823915", "user_id": "AHDZKPPKUT7HD47LXCBN7RQNN6KQ", "timestamp": 1369166930000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "How many lies does the Government keep", "text": "Diane Chamberlain is one of my go to authors, and when I see she has new book, I rush to purchase.  This one had me so bored in the beginning I was ready to move on. The characters are very vivid and real, she is a masterful writer painting excellent visuals of the characters and their living conditions.  The main character Ivy is a very loveable young girl and you want her to survive and prosper.  As bad as the program was I am sure there were good social workers out there who really thought they were helping these impoverish communities.  While I think it is barbaric that this sterilization went on and the rest of the country had no idea, it does make me wonder &#34;What other secrets are out there that our Government is keeping from us&#34;.  Many things were to easy to figure out from the , Jane's marriage from the first pages seemed to be doomed.  Read this if you are interested in this sterilization project, if not read some of her other work, because this one is not her best novel.", "images": [], "asin": "1250010691", "parent_asin": "1250010691", "user_id": "AFBXDI55GEOEED5P42NJ252QDYUQ", "timestamp": 1399899558000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "each page the same", "text": "each page is exactly the same and not very creative, maybe good for younger than age 8 kids", "images": [], "asin": "194820956X", "parent_asin": "194820956X", "user_id": "AHFRIWDA5RJ3IHMJ44QI3STNMBYA", "timestamp": 1577498972057, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "It's \"The Department of Energy\", Rick!", "text": "Bought as a gift a looooong time ago. &#60;shrug&#62; The recipient enjoyed it.", "images": [], "asin": "0316132950", "parent_asin": "0316132950", "user_id": "AHYXP74QKWADZ2GPJQNFMS2HM2IA", "timestamp": 1478289417000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "An Ok Syfy Movie", "text": "Not a bad movie i mean book. The writing was ok and the characters were ok.<br />Took too long to get to the moon. I was skimming over parts. A syfy movie directed by Michael Bay. Fun but should have been funner. Funner?<br /><br />Would have worked better if two stories were told at once the present earth and the future earth.<br />The Taiwan sub plot and the saboteurs were not necessary.<br /><br />I thought a 'Time Paradox' would create a shockwave uplifting mountains and generate giant tsunamis? Time is circular? Nevermind.", "images": [], "asin": "1503938778", "parent_asin": "1503938778", "user_id": "AEYUTWRDI6DZWLXIH45QPEXKKOAA", "timestamp": 1511566443578, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "I was underwhelmed.", "text": "This book has several faults.  First, it purports to be a reference for novel writers, but it is filled with suggestions and references for screenwriters, which aren't apropos.  Second, the author constantly uses her own special terms, screenwriters' jargon, etc. without bothering to explain what the terms mean.  Sometimes, she gets around to explaining the term many, many pages later, but by then I the reader is thoroughly frustrated.  Third, I was astounded at the poor quality of the writing.  One would hope that a book on writing would be an exemplar of proper writing.  Fourth, it struck me as a glib, shallow exposition on the subject.  I wish I had bought something (anything) else.", "images": [], "asin": "0981899730", "parent_asin": "0981899730", "user_id": "AEOPU2MMQLQ3TMLOAWVXNGCG2QEA", "timestamp": 1381684351000, "helpful_vote": 15, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Eats It", "text": "Bad writing. No insight. Sounds like a wimp, even though he's a marine. Couldn't finish it. Don't bother.", "images": [], "asin": "1632869500", "parent_asin": "1632869500", "user_id": "AFRGBMELRIWKCKH7O3IM5WND36SA", "timestamp": 1529613308935, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Just ok. Disappointing ending.", "text": "The book was ok… if you already know a-lot of info about the cartel. Didn't find much surprising. But if you don't know much, its a good book.", "images": [], "asin": "1250209765", "parent_asin": "1250209765", "user_id": "AGFUP3JTJNQTPCAKAYE25XQNFN6A", "timestamp": 1625234852321, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "It's mostly snacks", "text": "I bought several cookbooks for my 7 year old picky eater, hoping it would make him more willing to eat meals he helped cook. I was really disappointed in this one. It contains \"recipes\" like putting sliced cheese and sliced ham on a sliced Pilsbury biscuit. Even a kid doesn't need a cookbook for that. The most disappointing thing was the lack of meals. There's a lot of ham and cheese: on bisuits, on buns, on bread.  The rest of the book is mostly snacks. Snacks are not that useful for me.", "images": [], "asin": "0764578618", "parent_asin": "0764578618", "user_id": "AFQUHSEESUF2UYXPGP5C3ZAVCXRA", "timestamp": 1301430015000, "helpful_vote": 8, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "long read", "text": "interesting, gave me a look at much of the history that I was very uneducated about.<br />felt the characters were mostly solidarity in their characters and doubted their possible relationships, but it kept me reading to the end.", "images": [], "asin": "B00F9H59VO", "parent_asin": "B00F9H59VO", "user_id": "AEU2HLWFPZ4KCBOBRWH63YPGJZEQ", "timestamp": 1483113268000, "helpful_vote": 0, "verified_purchase": true}
