{"label": 1, "rating": 5.0, "title": "The  Last Days of the Tavern", "text": "_Callahan's Secret_ (1986) is the third collection of stories about Callahan's crosstime saloon. In an introduction, Robinson stated that this would probably be the last of the Callahan books. It wasn't. But I think that it is fair to say that the later stories were \\\"second cycle Callahan tales.\\\" A number of things come to and end in this collection.<br /><br /> There are four stories in the collection, all novelettes from _Analog_: \\\"The Blacksmith's Tale,\\\" \\\"Pyotyr's Story,\\\" \\\"Involuntary Man's Laughter,\\\" and \\\"The Mick of Time.\\\" A comparison between these tales and the stories in the first collection, _Callahan's Crosstime Salooon_ (1977), shows a marked difference. The later stories are more skillfully plotted, more smoothly written, and a bit more bawdy. Also, the jokes, tall tales, and puns are-- if you can believe it-- more clever and outrageous.<br /><br /> We sometimes have a tendency to underrate humorous fiction. Great fiction must be serious and solemn. Humerous fiction can be _good_, you understand. But not great. We forget that doing humor really well can be deucedly hard. In any event, I am giving top rating for these stories. They are some of the best of the Callahan's Place stories. They are great fun and great writing.\", \"images\": [], \"asin\": \"0812572297\", \"parent_asin\": \"0812572297\", \"user_id\": \"AFKQOH5UOFIZUE4R5ITELBUZ6HJA\", \"timestamp\": 1197534903000, \"helpful_vote\": 8, \"verified_purchase\": false}\n{\"label\": 1, \"rating\": 4.0, \"title\": \"Very nice\", \"text\": \"Was exaclty what i was wanting, just wished it wasnt so big, but really good.<br />Really good for couples to do together, just remember all of your \\\"firsts.\\\"\", \"images\": [], \"asin\": \"1579771041\", \"parent_asin\": \"1579771041\", \"user_id\": \"AHJUUHQ6GHYG4SAASV3MQCAX6QDQ\", \"timestamp\": 1324401349000, \"helpful_vote\": 0, \"verified_purchase\": true}\n{\"label\": 1, \"rating\": 5.0, \"title\": \"Easy and Tasty Plant Based Recipes\", \"text\": \"There are plenty of recipes in every category from soups to desserts; main dishes to smoothies. The book's aim is to help you save time and effort in preparing meals. These recipes will help you restore your health and lose weight. Yummy! Format is easy to follow and includes helpful definitions and tips.\", \"images\": [], \"asin\": \"B08JF617VX\", \"parent_asin\": \"B08JF617VX\", \"user_id\": \"AHPEE2EJGZEQK64HE4X4ZGM4XY3A\", \"timestamp\": 1604761655480, \"helpful_vote\": 0, \"verified_purchase\": false}\n{\"label\": 1, \"rating\": 5.0, \"title\": \"Good instructions\", \"text\": \"Great instructions for the large lovely flowers.\", \"images\": [], \"asin\": \"1606521683", "parent_asin": "1606521683", "user_id": "AEWFX5QUHCYIZLQYR6BUJJDC7WDA", "timestamp": 1572400182428, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "An utterly delectable and totally addictive New Adult romance", "text": "BOOMERANG is an utterly delectable, incredibly exciting and totally addictive story that is the perfect blend of sexy and sweet. Told from both Mia and Ethan’s perspectives, this story will keep those pages turning as things between them go from awkward to competitive with an undercurrent of tension that sizzles.<br /><br />Waking from what should have been an unforgettable night that neither can quite remember, Mia and Ethan soon learn that their one-night hookup was not the last they would see of one another. When it turns out that they’re both vying for the same job, they’ll have to decide what’s more important – the chance at an amazing opportunity with Boomerang or the possibility of seeing whether the connection they have could lead to something more.<br /><br />The authors crafted a novel with two very likable characters whose chemistry is electric, whose predicament makes for a story that is at times angst-filled, at others swoonworthy, and whose happily ever after readers will very much hope for. They don’t skimp on character development - readers will get to know and adore both Mia and Ethan, with all their flaws, insecurities and hang-ups, and they’ll get a peek at one of the central characters in the next book in the series.<br /><br />As things heat up both on the job and off, more will be revealed about past relationships, current desires, how they met, and what landing the job at Boomerang really means to each of them. Their story is captivating and romantic, a touch suspenseful and a little bit heartbreaking. It’s a story that will be unputdownable.<br /><br />From the competition, to Mia and Ethan’s undeniable attraction, to the head-meets-desk decisions, to the questions about what exactly happened that first night, BOOMERANG is a quick, nail-biting and wildly entertaining read. It’s a fantastic start to this series that is not to be missed by fans of this genre or readers who like clever and engaging stories with just the right amount of heat, sexual tension and romance.", "images": [], "asin": "006233106X", "parent_asin": "006233106X", "user_id": "AE7G7Z35FDEKPIZO636ZRNFL3O6A", "timestamp": 1406750099000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Poor quality workmanship/binding", "text": "A couple of weeks ago my seven-year-old grandson complained that the book I bought him fell apart. Today he showed me the book and I can see why he complained. He has a lot of books and treats them well. I do not believe it was carelessness that caused this problem but poor workmanship that it fell apart in less than a month of use.", "images": [{"label": 0, "attachment_type": "IMAGE", "large_image_url": "https://m.media-amazon.com/images/I/71Qayq4P0zL._SL1600_.jpg", "medium_image_url": "https://m.media-amazon.com/images/I/71Qayq4P0zL._SL800_.jpg", "small_image_url": "https://m.media-amazon.com/images/I/71Qayq4P0zL._SL256_.jpg"}], "asin": "1338714120", "parent_asin": "1338714120", "user_id": "AGES42F2Z4OSITPNZOMQ6REWFN7Q", "timestamp": 1652826049778, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Excellent companion to Air Fry Everything. Over 100+ New Air Fryer Recipies to make easy and appealing dishes!", "text": "After buying Air Fry Everything and trying out Meredith Laurence's recipes I had to buy this second book that has even 100+ New and more wonderful ideas to use my Air Fryer!<br /><br />Her two books are written from a practical fool proof perspective of how to use your Air Fryer to attain excellent gourmet results.<br /><br />I am absolutely astonished with the results I have yielded by following her recipes.<br /><br />It is an excellent companion to her Air Fry Everything book. I wish I had bought her books first!", "images": [], "asin": "098275406X", "parent_asin": "098275406X", "user_id": "AG4S3VMKGHGEKQIRVNC5LGOFHRIA", "timestamp": 1520967854830, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Great!", "text": "This is a an outstanding book, which in this readers opinion was clearly not created to be a concise and detailed history.  The subjects covered would take multiple volumes to do so.  It does however, briefly cover multiple events in which America took a pivotal role.  Whether we like it or not, we have perpetrated irreparable damage to the environment with nuclear testing in areas in the Pacific.  Its upsetting to think that native peoples were permanently displaced, for all time from their ancestral island homes.  I'd recommend this book enthusiastically to anyone interested in our far reach and as perhaps an introduction to more detailed reading on the many subjects mentioned in this book.", "images": [], "asin": "0062315412", "parent_asin": "0062315412", "user_id": "AHASQEVOHZTPBCONDQAWGLITMIUQ", "timestamp": 1503670496802, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "I almost put it down ...", "text": "I'm not sure the last time I read a book where I was tempted to stop reading and throw it away ... but I was sorely tempted with \"The Pirate\". The main character, Alex Hawke, is completely and utterly unbelievable, the situations which he and his friends get into and - miraculously - get out of border on the ridiculous, the writing cliched, etc. Moreover, the book is riddled with factual inaccuracies in places where the inaccuracies were not needed for the story. Where were the editors??", "images": [], "asin": "1416510796", "parent_asin": "1416510796", "user_id": "AFHCWDSL57LRA5GEOWOHXQXK62BQ", "timestamp": 1635347153028, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A Really Interesting RPG Game. Deserving of the Praise and Awards", "text": "Burning Wheel is a very different experience from traditional RPG games. It really focuses in on the story telling side of the genre and uses a completely different dice system for challenges and actions.<br />The book itself is well put together with easy to read fonts and headers. It does its job as a rule book as well.", "images": [], "asin": "0983645809", "parent_asin": "0983645809", "user_id": "AEBBLMO5JV2H4IFTHPJLYWF332YA", "timestamp": 1630646889823, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "nice book.", "images": [], "asin": "1848190700", "parent_asin": "1848190700", "user_id": "AFH3ZOWEJBREVFQCBXRRFAJNLMZQ", "timestamp": 1461163180000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "daughter loves!", "text": "my 7 year old loves these even though she’s reading at a higher level. what could be more fun than two cute cupcakes on crazy journeys? these are a bedtime favorite for her to read on her own.", "images": [], "asin": "1665917962", "parent_asin": "1665917962", "user_id": "AGCJTNMVSLM32FTOHN2UCC5RNMMQ", "timestamp": 1667358180673, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Story book dolls  to knit", "text": "Story Book Dolls  to  knit. I have not  knitted thes dolls. I am giving it to  a friend.", "images": [], "asin": "1609000994", "parent_asin": "1609000994", "user_id": "AEIYWVW6SSZKOSOROHYPDQCO242Q", "timestamp": 1310145269000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "I didn't really know what to expect. The story ...", "text": "I didn't really know what to expect. The story really kinda sticks with you, gets in your head a little bit. Moves along well with a lot of layers and things to decode and think about. A genre unto itself.", "images": [], "asin": "0375703764", "parent_asin": "0375703764", "user_id": "AHJLMNXN6T3UZ7E5INYQIO57MCIQ", "timestamp": 1443895312000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Michael connelly, the best!", "text": "Love Harry Bosch..Have read all Bosch books..hope there will be more.", "images": [], "asin": "B00IJJUIMY", "parent_asin": "B00IJJUIMY", "user_id": "AF3FTALTUW3AW3TAUQYFALQKAVNQ", "timestamp": 1418962906000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great gift", "text": "This was a gift for my 9 year old niece-she was very excited to get it! That makes it a success for me.", "images": [], "asin": "1593699115", "parent_asin": "1593699115", "user_id": "AFWTGYGZ7V4S7GYYLZG4RUDFPZMQ", "timestamp": 1358340969000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Perfect to build confidence", "text": "I love these for my 8 year old who struggles with anxiety.  They are great and she enjoys doing them before bed.", "images": [], "asin": "1734287667", "parent_asin": "1734287667", "user_id": "AG2KXXRSMKJC5NNUHCYFETW2WAWA", "timestamp": 1645731895544, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Christmas stories!", "text": "This book was so good! It’s a Christmas theme book, so it will definitely be a book you’ll want to read to get you in the mood for the holiday.<br /><br />Sarah M. Eden’s was a great way to start off the book! We get to see a glimpse as to what Lucas, Julia and young Adam are up to while getting to meet Nurse Robbie! I was so excited to finally get to learn more about the famous Nurse Robbie who helped raised Adam. Like most of Sarah’s books your emotions are on a roller coaster ride. I loved making connections to the Jonquils/Lancasters series in this book.<br /><br />Esther Hatch’s novella  had me laughing from the get go. It’s an enemies to lovers story, so if you like that then you’ll definitely love this one. The characters are amazing, but I personally think the grandmother stole the show. She was a riot and so good at playing matchmaker. I wished this one was a little longer because I wanted to see a few things before it ended but that’s just me.<br /><br />Dana LeCheminant’s novella  was one of my favorites from this book. This is my second story by her and I’ve vowed to read all the other books she has written. It was easy to see how this story was going to end but I was more than happy to read the whole thing. Graham and Beth were so much fun to read about! I wish it was longer because I needed more of their story!<br /><br />Anneka Walker’s novella was such a good way to end this book! The way this story started had me dying! Thomas’s sense of humor was so good. And Alice was such a good leading lady to not hold what happens at the beginning against Thomas.  I loved seeing Alice and Thomas grow as an individual and unknowingly as a couple. The ending was great! Bless Alice’s grandmother for saving day.", "images": [], "asin": "1524422223", "parent_asin": "1524422223", "user_id": "AER5D73Y6WNCF5Z2A5TKQARA2QXQ", "timestamp": 1664855912073, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Looks promising", "text": "I purchased this as gift for grandson who likes history & aspires to be an entrepreneur. I’m hoping he will enjoy it.", "images": [], "asin": "1250172608", "parent_asin": "1250172608", "user_id": "AGFAWYHPXROXLPD3UJGR64TCFOSA", "timestamp": 1639255403471, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Perfect for my pennies.", "images": [], "asin": "0307090337", "parent_asin": "0307090337", "user_id": "AFC7QDEFN5URM6UKSCCX5SM5QR4A", "timestamp": 1483578217000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "too much notes/highlighting", "text": "Got delivery promptly which is good, but the condition is poor.  Understand this is used one but did not expect that heavy notes and highlighting within the book", "images": [], "asin": "0314200592", "parent_asin": "0314200592", "user_id": "AGHXRHDMA2C6KIA2LFZLIIZBDYAA", "timestamp": 1390571151000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Difficult and Frustrating.", "text": "I am amused by the professors who rate this book so highly; have you ever followed up with those to whom you recommended the book?<br /><br />While working through this text for a distance education course, I am finding it a difficult and presumptuous book which introduces concepts and formulas without any explanation as to what the parts mean. Seemingly from out of nowhere, numbers are thrown into formulas without explanation of their meaning or even where they come from. The end of chapter questions are of extreme difficutly at times, trying to trick and outsmart you rather than re-enforcing concepts. Expectation of previous knowledge of the workings of financial concepts and markets make parts of this text impossible to understand without outside help.<br /><br />For an introductory text, this one does an extremely poor job of explaining the concepts. From the perspective of a student and not a professor to whom these concepts should be elementary, this is a difficult and poorly geared text that is nowhere near \"high-school level.\"", "images": [], "asin": "0131856154", "parent_asin": "0131856154", "user_id": "AHRBX4SLJEG2FFECY3NWGTMAVG7A", "timestamp": 1294450518000, "helpful_vote": 4, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Charming preteen mystery", "text": "Sharon Shaefer was my sister in law for over 45 years.  She died recently after a valiant fight with an unexpected illness in the presence of us and much of her family.  So I am not totally unbiased.  I had hoped to hear her voice through the pages of this book.  That didn't really happen for me, but it may have for others.  That being said it is a charming book lovingly edited by her friends.  It is reminiscent of books I loved as a young girl and I'm sure she did as well.", "images": [], "asin": "B085K8NXKR", "parent_asin": "B085K8NXKR", "user_id": "AEJCATEARBCA5UX75EA5JM6U56UQ", "timestamp": 1585159013056, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The most important link to GD", "text": "This translation is the best, the most authentic  and the most true to the names of the Almighty GD.  It is resplendent and presentation it is divided into the days of the week and the days of the month it presents the prelude and post prayers and contains grace after meals. The psalms are the word of GD they are the way that we pray they are the strength that he gives us without them we would not have our prayer books  They are the answer to everything that you need", "images": [], "asin": "0899066704", "parent_asin": "0899066704", "user_id": "AFABCEIH37BKCTMJQY57CEVO4JAQ", "timestamp": 1619148020788, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "I really enjoyed this book", "text": "I really enjoyed this book.  I learned a lot about ranch life, rodeo life, land management and what and who it takes to support the rodeo life.  A very good read.", "images": [], "asin": "0393292347", "parent_asin": "0393292347", "user_id": "AGP3PWXTQDTCSBXNNR56BV62JWBQ", "timestamp": 1531180160514, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "An Excellent Addition to the Snowmen series....Love! Love!", "text": "Ah Ha...brilliant!  A Snowman story we can read all year long.  We absolutely love all of the Snowmen books....at night, at Christmas and now All Year!  My kids especially love searching for the tricky hidden pictures.  These books are all illustrated and written beautifully!  Bravo :) As a matter of fact, the hidden pictures in these books inspired me to have pictures hidden in my book<br />[[ASIN:0981756522 Mommy's High Heel Shoes]]", "images": [], "asin": "0803733836", "parent_asin": "0803733836", "user_id": "AELA3LDATCNFFYP35O5XZR5NM5UQ", "timestamp": 1291259596000, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Good book!", "images": [], "asin": "073874798X", "parent_asin": "073874798X", "user_id": "AGTGCRW6X3OB45RNP6DBVLGWLHKA", "timestamp": 1496489734000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "No damage,great price !", "text": "Great quality for what I paid for!", "images": [], "asin": "0440237688", "parent_asin": "0440237688", "user_id": "AFTRSDAWJJZSTREO3V4CUHTVGBNQ", "timestamp": 1476675579000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great book!", "text": "My son is in the fifth grade and just finished reading this book.  When we start a new book we usually read it together at first to get in to it quicker, discuss the book, and make sure he's in to the story before he goes off on his own.  However with this book I found myself grabbing it when he got home from school to catch up on what he read during the day and we'd read it together at night.  What a great book with a lot of life lessons.  This might be my favorite book of 5th grade year.", "images": [], "asin": "1338053779", "parent_asin": "1338053779", "user_id": "AEWDNESNYDDRR4EDEPFNDJZQKXTQ", "timestamp": 1508929343804, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "A cognitive scientist's rant about politics", "text": "I was disappointed with this book.<br /><br />I was hoping for a book full of solid cognitive science, offering readers insights in order to make their own judgements and to better understand politics. Instead, the book felt like a rant about politics; a rant which just happens to be written by a cognitive scientist. Many studies are mentioned, but little detail is provided (though, the author does include references), and the discussion feels very much like hand-waving. I don't doubt the author's own credentials, but he leaves little opportunity for the reader to reach their own conclusions.<br /><br />I therefore found the political discussion unconvincing and cheesy (this may have also have been in part because I am not an American and the book is very US-centric).<br /><br />However, the book was not a complete waste of my time -- I did enjoy reading it as it offered a way of thinking about discourse in terms of framing and metaphors.", "images": [], "asin": "0143115685", "parent_asin": "0143115685", "user_id": "AHIAGXN5WJ3UHF2PKFDUJ4CVMERQ", "timestamp": 1263255616000, "helpful_vote": 22, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "One of my all time favorites", "text": "I kept hearing about this book, and finally read it at the beginning of this year. I ended up staying up all night reading it! It's true what some detractors say about them acting like children in a professional work environment. It gets pretty established though that the work environment is hostile in a lot of ways, since it was a merger of two very different companies with opposing views on the world of publishing. The co-CEO is a blatant sexist. The main character Lucy acknowledges that she's not proud of her behavior, and you get the sense her nemesis Josh never has been proud of it either. He says as much actually. People aren't perfect. We find out that Lucy's childishness is due to just being plain lonely and homesick and wanting attention from the only person she interacts with day in and day out. She's smart and quirky and witty, with lots of attitude. I loved seeing the layers of Josh peeling away as well throughout the book, and learning why he acts the way he does. The way they banter and flirt is amazing, and seeing their relationship develop was so rewarding, paying off with one of the sweetest and hottest love scenes I've read since Chapter 55 of ACOMAF. These are two complex, imperfect people that are perfect for each other, challenge each other, and come to understand each other on a soul deep level. I loved it so much.", "images": [], "asin": "0062439596", "parent_asin": "0062439596", "user_id": "AF7L6ZMSEKXCDZ3L3F5WDPR6LM6Q", "timestamp": 1643400646937, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "CHILLING SUSPENSE, FINE AS A STAND ALONE TOO", "text": "VANISH is part 5 in the Jane Rizzoli and Maura Isles series. However I read it as a stand alone and did just fine, so I can recommend it that way too. I'd also never heard of author Tess Gerritsen before this but will definitely be searching out more from her and this series. I loved her style of writing, the realistic characters, the suspenseful medical based plot and the fast moving thrill of this story as a whole. There were elements that you could tell if you were invested in the series (and reading it in order) would have been even better or funnier or sadder however I never felt lost or left out of some big plot due to the excellent story telling. This is crime writing suspense at its very best.<br /><br />Vanish pulls you in from the very first page starting with Mila's heartbreaking story of human trafficking. She and a group of Russian girls are crossing into America from Mexico having been lured there by the promise of a better life however by the end of the chapter one of the girls is dead and Mila has been sold into a prostitution ring. Mila's story (which we keep flashing back to) is gritty and often hard to read probably because it is very real.<br /><br />We then switch to coroner Maura Isles who is going about her daily routine (in vivid medical detail) when she discovers that one of the bodies in the morgue is still alive. \"Jane Doe\" is rushed to the emergency room where we meet up with our other protagonist Detective Jane Rizzoli who has just gone into labour following a take down at the courthouse (she rocks)<br /><br />Through a fantastic series of events that kept me on the edge of my seat and never able to guess what was coming next, the formerly \"dead\" woman grabs a security guards gun and takes 6 people hostage in the hospital, one of which is Detective Rizzoli. \"Jane Doe\" won't talk to the police negotiator and we only learn her motives after a man disguised as member of the SWAT team joins her. His story is equally enthralling.<br /><br />This tense drama plays out for a large part of the book bringing in a host of other characters (and their POV'S) along with clever plot twists and exciting action. All of which Gerritsen manages to tie together. We meet Jane's husband FBI agent Gabriel Dean (I'm assuming we met him in earlier books) we also have Jane's partner (hints of a love triangle), reporters, spies and bad guys in Washington. We get crime scene investigations and the makings of a political thriller which thankfully doesn't take over and a very realistic story involving a new mother trying to get to know her baby while maintaining her identity. Throughout it all we keep coming back to Mila and her story is the one that haunts me.<br /><br />What a fantastic unputdownable read. Not my usual fare but a series I will definitely be coming back to. Cheers.", "images": [], "asin": "0345476980", "parent_asin": "0345476980", "user_id": "AG5MB5GRJYXP5XGC53IGKWT3W7LQ", "timestamp": 1286222940000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Beautifully written.", "text": "This is such a beatifully written book. Sometimes you want to read a book just for the writing style.This is one of those books. Highly recommended!", "images": [], "asin": "0312275420", "parent_asin": "0312275420", "user_id": "AHUIX4HAFWA2FHK6HTOR5PPZE2XA", "timestamp": 1115501539000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Coloring and Learning", "text": "This coloring book is great for all ages! The pictures are bold and fun to color! The book starts up great discussions on God, the Bible, and the other characters that are a large part of Gods word!", "images": [], "asin": "B089CS587J", "parent_asin": "B089CS587J", "user_id": "AHYT2IABQHVPKEPZFHZ4MAGAR6EQ", "timestamp": 1590973779571, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "One of Seton's best", "text": "This novel has so much to offer. It tells the story of the relatively unknown Winthrop family -- specifically Elizabeth Winthrop. The novel is long but you'll find yourself wanting even more at the end. Seton takes her time, describing the girl's life growing up in England, her voyage across seas to a new land, and her adult life in Massachusetts and Connecticut. It is a fascinating story and once again, Seton does an immense amount of research that makes the novel even more enjoyable to read. I certainly recommend it for anyone from the New England area, as the Winthrops were quite a prominent family in the 17th century. One of Seton's best.", "images": [], "asin": "155652644X", "parent_asin": "155652644X", "user_id": "AG2NR7RXWMVNVYBQPEAN67THHHMA", "timestamp": 1234904698000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "love this book", "images": [], "asin": "147113685X", "parent_asin": "147113685X", "user_id": "AHINMYQVIZAZ4BQ26LYJOGMAPO3Q", "timestamp": 1431627387000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Be Ready To Spend Some Time Cooking", "text": "This cookbook works to ensure your access authentic Indian recipes! Richa does a wonderful job explaining different ingredients as well as cooking methods.  I also like that most recipes have alternatives written into them, so you don’t have to google a replacement.  As with most great home cooking, the recipes I’ve tried do take some time, but they are worth it! The pictures are also a wonderful motivator for what your food could (and probably will) look like. I love that this book helps keep so much diversity in my diet, as well as teaches me about Indian culture through cuisine. Definitely buy if you love Indian food, vegan food, or cooking in general!", "images": [], "asin": "1941252095", "parent_asin": "1941252095", "user_id": "AGYWTEQRTEVM4RQYPZRBHPEFSU7Q", "timestamp": 1659961825647, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "My kids teachers loved these", "text": "Cute!", "images": [], "asin": "1546956883", "parent_asin": "1546956883", "user_id": "AFOOEIJT5M5BHRZQQDSP5TNWSDBA", "timestamp": 1569469791008, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A Miraculous Journey", "text": "Imagine healing from the atrocities of war without punishment, prisons, or revenge. Imagine demonstrating a new way of being, based on the strength and wholeness of individuals and communities. Imagine working with impoverished villages devastated by war and Ebola, where those remaining are not seen as victims, but are seen as creative leaders with the power to rebuild their devastated communities.<br /><br />This book describes a journey of healing for the author and the leaders of the Fambol Tok movement, and how together they rebuilt Sierra Leone, village by village. As the story progresses, the villages heal and transform, and the author and her partners also transform in some beautiful ways.<br /><br />The book gets a bit rambly in places, but delivers a powerful message. It shows us what humans are capable of, when given the opportunity to organize themselves for the common good. It shows that traditional humanitarian aid, no matter how well intentioned, often prevents communities from organizing and getting what they truly need. Readers will find new ways of looking at the world, and great hope for humanity in this unique and highly engaging book.", "images": [], "asin": "B0BJ11XLY3", "parent_asin": "B0BJ11XLY3", "user_id": "AFXNQ644IWF2WYOPFMWECUXHLSLQ", "timestamp": 1666829089573, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "disappointing let down", "text": "After reading and adoring Tam Lin, I rushed out to buy Juniper, Gentian, &amp; Rosemary, but after the first few chapters I was bewildered, and finished the book out of duty, hoping it would take off.  The literary  references in Tam Lin inspired me to check out things I meant to read in  college but never got around to, where as the references in Juniper,  Gentian, &amp; Rosemary just seemed pretentious.  ( I guess one expects  references from a university crowd, but not from young high school  students)  I kept waiting for something intriguing to happen, some element  of Faerie, but when it revealed itself I was alternately relieved that I  had finished the book, and disappointed that there was nothing more.", "images": [], "asin": "0312859708", "parent_asin": "0312859708", "user_id": "AHCLG4337WFGVS7IN4FDKJYZCQXA", "timestamp": 957592792000, "helpful_vote": 7, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Pacifists that got people killed.", "text": "While this book is informative, the author takes great pains to both credit the anti-warriors with helping to end the war, but basically absolve them of any responsibility for causing the Vietnam War to continue and kill more Vietnamese and Americans.  They emboldened the North Vietnamese to continue on, end of story.<br /><br />Anyone who knows history knows that the North Vietnamese attacked American where it would hurt most, that is, the court of public opinion back home.  They knew from their experience with the French that no matter the cost, the population of a democratic government will inevitably cause that government to end its participation in a war, no matter how noble the cause seems.<br /><br />Too bad we’ll never know how many people the anti-warriors killed.", "images": [], "asin": "084202896X", "parent_asin": "084202896X", "user_id": "AHWOETF6APFIEOIBML2SWAIDJG5A", "timestamp": 1385698281000, "helpful_vote": 7, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "I actually fell in love with this review", "text": "I actually fell in love with this review!  It covers all the necessary information to pass your CBEST.  The explanations are clear, complete, and with no &#34;nonsense&#34; at all.  The company also has online resources that will assist you too in passing this exam.  You will have one practice test in the book and one online.  I highly recommend this book!", "images": [], "asin": "1635308070", "parent_asin": "1635308070", "user_id": "AHC74YL7BUXOSJ3AAWFV3XWCIZZA", "timestamp": 1514513460906, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "This book will change your heart", "text": "The other reviewers were right; this book is amazing.  I have a hard copy AND a digital copy because I love it so much.  This book really will have you laughing and crying, smiling with and yelling at God in the same chapter; it's true to this grace filled mess we call life with Jesus. it's just a must read!<br /><br />Enjoy!", "images": [], "asin": "1439153159", "parent_asin": "1439153159", "user_id": "AHWEXELJS76BQSJBOSWUEQZLH4JQ", "timestamp": 1354661305000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Fun!", "text": "If you want to draw skeletons for fun but have no drawing skills, this is the book for you, whether you're a kid or an adult.", "images": [], "asin": "0590452630", "parent_asin": "0590452630", "user_id": "AHWSHCNQS2VNNTPHTGEV57T6WHFA", "timestamp": 1483143033000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Helpful!", "text": "We booked a trip to Europe and did minimal planning beforehand, so this was great to have while we were there! Especially because we didn't have pone service 80% of the time. His recommendations are accurate and very helpful. I would say just don't plan on relying on it for its maps because they are pretty small and not as detailed as you would need. I plan on using his books for other trips in the future.", "images": [], "asin": "1612380085", "parent_asin": "1612380085", "user_id": "AGKN6BO6SRFA33G6NWEUG23LVDPA", "timestamp": 1410971845000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Must have.", "images": [], "asin": "095598761X", "parent_asin": "095598761X", "user_id": "AH7PGNXU5IQEYM7K2WONIWSQOVHA", "timestamp": 1527723557295, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "My favorite Thanksgiving book", "text": "I love this book so much! It’s perfect to teach inferencing and context clues. It’s fun to use  the voices of the characters too.", "images": [], "asin": "1416907149", "parent_asin": "1416907149", "user_id": "AFLFELEFG7RVVHO23XBETPMVISZQ", "timestamp": 1639927721348, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Beautiful", "text": "I loved this book. I did not want it to end. The characters, the writing, and the plot were absolutely breathtaking.", "images": [], "asin": "B01COJUEZ0", "parent_asin": "B01COJUEZ0", "user_id": "AHUIWD5WKXHON6WTVV2RFSGMMVCQ", "timestamp": 1517358676618, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "just okay", "text": "This toy has some fun features and was a great idea, but it didn't last for a week in our house (admittedly because we have a cat who punctured it easily while trying to play with the balls).  I'd go with a play tent instead, or even just a little inflatable pool filled up with balls.", "images": [], "asin": "B002OC72NA", "parent_asin": "2749920582", "user_id": "AGMPVWHZ7DYIIZEYEXE65WZFEZLA", "timestamp": 1281124656000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great Book", "images": [], "asin": "1585362581", "parent_asin": "1585362581", "user_id": "AE7FKI7XFH2LGUJ5GCR3DUWDBOEQ", "timestamp": 1444585855000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "A good read", "text": "Suspenseful till about 3/4th of the way through - then predictable.  Still a fast easy good  read.  Would recommend if you don't want something that will take you a long time to read.", "images": [], "asin": "B00FAX7A1Y", "parent_asin": "B00FAX7A1Y", "user_id": "AFTTVNFWPMUY2CSASMQFTY6JAH4A", "timestamp": 1392260000000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A great thriller!", "text": "Great adventure series, highly recommended.", "images": [], "asin": "1517585848", "parent_asin": "1517585848", "user_id": "AEMFD77JG6M7BPE7UF25QTCJNGSA", "timestamp": 1681148860707, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not what I was looking for, but okay.", "text": "I am sure for some this will be great. For me, it was a bit too fur-fru with the recipes. It did give a lot of good advice on cooking pans that are needed.", "images": [], "asin": "190314194X", "parent_asin": "190314194X", "user_id": "AFTISACW7WA6O4AZDCAUQSS6CPZA", "timestamp": 1354889181000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Glad I finally read it - Should have read it sooner!", "text": "I finally read this book right before the movie came out. I admit that this book had been sitting on my bookshelf collecting dust. I also admit to enjoying the Twilight books, so I was not opposed to Ms. Meyer's writing or style. But I'm not a huge Sci-Fi person, and the premise of this book just did not appeal to me, despite having friends tell me how much they liked it. So I procrastinated...and procrastinated...and procrastinated. It took the movie and a Stephenie Meyer event I attended to kick me in the butt and move it up my reading pile. And once I read it, what do I have to say now?<br /><br />I LOVED IT! This was one of those books where I just shook my heads and thought to myself, \"What took me so long?\" This was a beautifully written book, exposing the many layers of love and humanity. The size of the book is intimidating, and it starts a bit slowly. But I found reading it worth the time and for me the reading process quickly sped up as I became more and more engaged and invested with the characters and plot. I found the plot unique and engaging, the character development well fleshed-out, the multi-layers of love development thoughtful, and the analysis of real humanity beautifully examined.<br /><br />I also admit to not being a fan of love triangles. They tend to be exhausting, unrealistic, selfish, and overly dramatic. But what I loved about this story is that it really wasn't a love triangle, not in the simplistic sense of the term. I don't want to spoil the plot, but I found the whole thought process and relationship between Melanie and Wanderer fascinating. I really found their relationship the most engaging. Then with a love interest or two thrown in there, and the confusion over two minds sharing one body, the plot really thickened, but again, with an imaginative process. And the love discussed wasn't limited to just romantic love - there's also friendship, family, forgiveness, camaraderie, community, sacrifice, and many levels of love in between these. This is one of the things and subjects I was most impressed with in this novel.<br /><br />Bottomline: I loved this book and added it as one of my favorites. I have also listened to the audiobook (because I needed to read/hear the book twice in a row, it was so good), and found the narrator quite engaging, so if you'd prefer the audio-version over text, I highly recommend it. This is one of those books you don't want to pre-judge. Perhaps you disliked Twilight, perhaps you hate love triangles, or perhaps you have an aversion to Sci-Fi. I would still recommend giving this book a chance. I'm glad I did.", "images": [], "asin": "B003NAAZK4", "parent_asin": "0316068047", "user_id": "AHTMRAYGBGQY7HHZ7AQXQFP6YGEA", "timestamp": 1366234729000, "helpful_vote": 5, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "I couldn't put it down!", "text": "Once I started this amazing book, I couldn't put it down. I am not a \"horse person\", but Melissa made me understand the special bond between horse and rider. As other reviewers have commented, it was a book that really resonated during this time of divisiveness. It made me remember that the power of human kindness transcends politics. Plus, there is the added bonus of a wonderful dog and mule!", "images": [], "asin": "1570769605", "parent_asin": "1570769605", "user_id": "AEGYNWZDKT62I7R4SARXQFFGAMFQ", "timestamp": 1606231226836, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great fun", "images": [], "asin": "1572972939", "parent_asin": "1572972939", "user_id": "AFVMNOHRNVSFQSMTWNC7T5T2PVNA", "timestamp": 1516812215166, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "No Not really!", "text": "So so boo, rather far fetched.. I know it's fiction. However, I didn't put it  down until  I could finish it!", "images": [], "asin": "148274631X", "parent_asin": "148274631X", "user_id": "AGJWU2XB3CRKARVU4SMPW3OGBFMA", "timestamp": 1407983365000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Wouldn’t recommend", "text": "Black and white pictures. Hard to understand.", "images": [], "asin": "B08NVXHFCF", "parent_asin": "B08NVXHFCF", "user_id": "AGU2GN5RP2E3OWRS4KJUGIDPXWCA", "timestamp": 1609952372619, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "1st Class!", "text": "great book. most of Knaak's work is. read whole trilogy.<br />about the delbin issue, basically i think that he was stuffed in there to provide some comic relief or something. this is sad because knaak is such a good  author that he should just focus on the story and characters, rather than  worrying about what the readers think, because it would be even better  without all that fudge.", "images": [], "asin": "0880389109", "parent_asin": "0880389109", "user_id": "AGFSGVA3WHZD4KH2RUQTV5GCRTGA", "timestamp": 951193691000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Hard to put down", "text": "I’ve worked with children on the autism spectrum and found Jen a very interesting character. I loved the way she grew as she trusted others.  The story is great.", "images": [], "asin": "B008X3NCRE", "parent_asin": "B008X3NCRE", "user_id": "AGWJSJYZ6A3L4MZIHUWAA4N2BCRQ", "timestamp": 1551188456247, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "Great motivation", "images": [], "asin": "0671797484", "parent_asin": "0671797484", "user_id": "AFZKHOF7HPRHWCRYVGWRKJEKEBCA", "timestamp": 1405373840000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Give it a chance!!! You'll like it, I'm sure of it =)", "text": "Okay, so I wasn't that thrilled with the first two chapters...I thought they were pretty boring, and I just couldn't get into them. BUT, as I continued reading,  slowly but surely,  the characters developed, and so  did my interest in the book. The soliloquys could be a bit much at times  and a little distracting, but in a way, they added to the flavor and  uniqeness of the novel. A fresh idea, or something that seemed out of the  ordinary to me, was Brandon's almost year-long celibacy. This is rare in  romance novels and refreshing, because the ultimate moment when Heather and  Brandon make love is looked forward to. (in other words, there are not  abundant sex scenes) When I finished the book, I missed the characters,  just as I always do with books I enjoy.", "images": [], "asin": "0380005255", "parent_asin": "0380005255", "user_id": "AEHYIUSCXNRMBO3VOHED67S7DJUA", "timestamp": 910840314000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great read!", "images": [], "asin": "1499727860", "parent_asin": "1499727860", "user_id": "AFXIJR6FSVUG2ZPDGOVEZQ7Y3ETA", "timestamp": 1464561177000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "Good information, easily understood", "images": [], "asin": "1118532783", "parent_asin": "1118532783", "user_id": "AGA3YUMX5BJ3A22EYGPVLF2RTDRA", "timestamp": 1449791263000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Dracula", "text": "I have watched several versions of Dracula but reading this book is the first time for me. Well, it has no close similarities with any movies I've seen except, of course, Bram Stoker's Count Dracula which has Hollywood spices in it. Compared to the movie, I felt the book's sense of the sensualities and Dracula's motivation in choosing his targets were less fluid and sometimes too coincidental. But I enjoyed the original hunting process more than the movie one, with treasured views from each man involved, not just Van Helsing's. My edition has the afterword which really helped to understand how the writing came to be like that but aside from all values it tried to represent, this is a referenced literature work everybody must not missed.", "images": [], "asin": "014143984X", "parent_asin": "014143984X", "user_id": "AHHDSMJJX5Q55VX5XFWHXQOTYU7Q", "timestamp": 1129193704000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A must read!  Excellent, exciting, enlightening, evocative.", "text": "In Secret and Shadows is a must read for anyone intrigued with the concepts touched on in the da Vinci Code.  The difference is:  Janet's story is non-fiction!  Janet takes us on a fascinating journey through the history and intrigue of southern France, including the Cathars, Mary Magdalene, Occitania, the Catholic Church, and much, much more.  I literally could not put the book down.  Thrilling, engaging and enlightening best describe Janet's recollection of this real-life da Vinci Code.", "images": [], "asin": "1452500185", "parent_asin": "1452500185", "user_id": "AG7M3KOSHV3WJ3N33UYLGXEWVY3A", "timestamp": 1288889497000, "helpful_vote": 6, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Very informative", "text": "I bought the book on a recommendation of a friend.  It didn’t disappoint.  Very helpful to understand Russia today.  The book reads like a thriller.", "images": [], "asin": "B00LD1ORX6", "parent_asin": "B00LD1ORX6", "user_id": "AHIFQZFQD6LKC5UQPU2RMJ6BPCZA", "timestamp": 1537326151339, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Yay!", "text": "I've been waiting for this to be published for... a quite long time, but it's finally here! It came in good quality and it's also a good read to add into the title game as well. A good addition to the Manga series/collection of Zelda.", "images": [], "asin": "1421593475", "parent_asin": "1421593475", "user_id": "AGNT3MZ2YTSCS42XJI3B7A3UCKHQ", "timestamp": 1494041675000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "An excellent companion for any Tolkien fan.  Beautifully illustrated.", "images": [], "asin": "0753704595", "parent_asin": "0753704595", "user_id": "AGZQMRF6ILDE5NVNEQPJXUBXZB3Q", "timestamp": 1489771850000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "good book", "images": [], "asin": "0470665416", "parent_asin": "0470665416", "user_id": "AH32E72J4G7PICXMQRHRH6SJ3DMQ", "timestamp": 1438752888000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "A die-hard Alex Cross fan expands her scope", "text": "I have long been a fan of James Patterson's Alex Cross Mysteries.  I like Mr. Patterson's style of writing, as well as the depth to which he explores his characters.  I was not disappointed with this foray into a female lead in San Francisco.<br />I was up late at night to read this, early in the morning to find out what was going to happen next...  it was great.  Only a few disappointments, but overall a good read.", "images": [], "asin": "0316666009", "parent_asin": "0316666009", "user_id": "AH4QV5W5ESCZKYBOBBQCOPDMIRHQ", "timestamp": 1007409767000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Many sections seem to have unclear explanations", "text": "I find the book is focused on too many objectives, outlining history behind a particular subject and explaining complex ideas altogether in short sections. It makes the topics hard to follow, especially for readers new to this domain, and you will often need to use additional resources to fully comprehend the authors' intent. I'm utilizing this book as required reading, but definitely frustrating in some areas for non-experts. I do not recommend if this book is not required reading material for you.", "images": [], "asin": "1260142655", "parent_asin": "1260142655", "user_id": "AGT7R7ERFXGBZ7QDOO2HFWZNBNQA", "timestamp": 1664167806788, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Warning - Horrible", "text": "Horrible to make a fake book about Snowden. Do not buy!", "images": [], "asin": "1522071075", "parent_asin": "1522071075", "user_id": "AFJOYH3WSQ2WLNH36UXKKNUCXJOQ", "timestamp": 1594219720404, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Believable Characters", "text": "Hitchcock can weave a story populated with believable characters and never fails to throw in suspense.", "images": [], "asin": "B003D7JXJ6", "parent_asin": "B003D7JXJ6", "user_id": "AHA7H5OZPRVKRR5G74NQ7ML6S57Q", "timestamp": 1417989210000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "I appreciated Spithill for taking on the challenge of sharing his story and recommend this easy read", "text": "Two-time America’s Cup winning skipper Jimmy Spithill opened the window wide open to his life in the release of ‘Chasing The Cup – My America’s Cup Journey.’ Spithill takes us on a trek that explains his character and convictions, from his early days around Sydney Harbor to the consolation beers following his recent defeat in Bermuda.<br /><br />The book is a tale with two halves: before Team Oracle and with Team Oracle.<br /><br />I found Spithill to be quite brave in the first half, revealing so much about his physical and family troubles. He was no silver-spooner, and the fight we have seen on the race course and interviews is well rooted in a bullied kid that found solace in the boxing ring and waterfront.<br /><br />His scrappy rise up the ranks earned him a lead position when Russell Coutts took over the reins of Team Oracle. Spithill shares the stories of these three America’s Cup campaigns, offering fascinating behind-the-scenes insight during the most disruptive period in the event’s modern history.<br /><br />Spithill also uses the book to even the score with critics, question authority, opine on parenthood, and teach the tenets of team. While the reporting on his Team Oracle era came with some bias, I believe he fulfilled his mission with the book to show how honest effort can be rewarded.<br /><br />I appreciated Spithill for taking on the challenge of sharing his story and recommend this easy read, especially to anyone who seeks to inspire youth sailors to reach farther.", "images": [], "asin": "1472948076", "parent_asin": "1472948076", "user_id": "AEOD6MXTSTMUWXZUAKFJHZW2CSMQ", "timestamp": 1504013184907, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "excellent read", "images": [], "asin": "B003IYI6T2", "parent_asin": "B003IYI6T2", "user_id": "AEC72YRZDTOFLAVHKY4KSEUX6IWQ", "timestamp": 1425170043000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Stupid, stupid, stupid", "text": "I'm sorry...I am very much in the minority, but...this book is a pathetic story about a pathetic young woman who is so self-absorbed that she is not able to see the reality of her situation.  Even if she hadn't 'lost' her mother, she would be adrift in the real world.  Yes, she does learn some things on her journey but her lack of understanding is monumental.  She is always on the lookout for her next 'sack-mate' at the expense of her soul's mending.  She reminded me of all the hippy-dippy dopers who floated from one experience to the next.  From the author's information of her life at present, it sounds like she made some break-throughs along the way.  That is good.  Because where she was in this book was not good.", "images": [], "asin": "0307592731", "parent_asin": "0307592731", "user_id": "AHIX5IJFCT34SWCHSE3D3DPQ4FHQ", "timestamp": 1355608567000, "helpful_vote": 15, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Audio CD read by Suzanne Toren", "text": "I was enchanted by this audio book. Suzanne Toren did a wonderful job narrating the story. I haven't read any of Kristin Hannah's books and I didn't expect much from the story line after having read the brief summary on amazon.com. I bought the audio version because I enjoy audio books narrated by Suzanne Toren and her voice surely lends a magical touch to this audio book.", "images": [], "asin": "1596008512", "parent_asin": "1596008512", "user_id": "AGM2INRJMRKZTHMQYOVVAVOW4EXA", "timestamp": 1171430070000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Finally!", "text": "I love this book. It is full of very useful info and styling tips to help deal with curly hair. After reading it cover to cover, I went to the DevaCurl website to find out where to buy her products and immediately started using them. For the first time in my life I love my curls. Her website even provides a hairdresser search page to find a curl savvy stylist in your area.  And the dvd included with the book is great too, it shows you how to care for your hair and yes there is some product endorsement but hey, the products actually work and she shows you how to use them. It's a relief to finally find someone who understands how to deal with this unique and temperamental hair type. I fully reccommend this book.<br />((8-2-2014 UPDATE:)) While I still refer back to this book from time to time for styling tips or to make one of the homemade recipes, I have switched to a different haircare product line called: \"Shea Moisture\". It's way more affordable and the products are awesome! They are also a lot easier to find locally. They are sold at both nationwide discount dept. stores as well as drug stores. IMO, for my hair at least, I think they perform better than the DevaCurl line of products. And for half the price!", "images": [], "asin": "076115678X", "parent_asin": "076115678X", "user_id": "AF53APY2LMYQ54TZHU3SMIQRYCKQ", "timestamp": 1337550540000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Perfect book for granddaughter!", "images": [], "asin": "1848566018", "parent_asin": "1848566018", "user_id": "AHDIGX74OMUJ2SKUHWJ4OBRZ77KA", "timestamp": 1519508778003, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Fun Cozy Mystery Series", "text": "This installment of the series was funny, and witty. The characters Anna and Pratt were interesting and the case they were involved in was plausible. I really like how the ghosts Bess and Joss added to the ambience of the story. Anna's and Pratt's sleuthing skills were believable. I liked that the main characters never did anything dumb. I recommend this book. I am getting the next book in the series.", "images": [], "asin": "B009R9B7LG", "parent_asin": "B009R9B7LG", "user_id": "AGT7B3UQELT63QGZ5YSKTH6IQSSQ", "timestamp": 1548973970672, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Good content !. Low quality images...", "text": "I liked very much that the book is structured in several self contained project. Several of them are very useful for my work and research.<br /><br />I did not like the images, in general of low quality.", "images": [], "asin": "1789533570", "parent_asin": "1789533570", "user_id": "AHZUJU4JRU5P7YTWTGSVKWQVXNQQ", "timestamp": 1550949243243, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "excellent", "text": "Ann Kodicek's creates a delightful story, with facts that I did not find in other books on Ballets Russes.<br />There are some sensational images. There are revealing details about Diaghilev that I did not find in<br />other books on Ballets Russes, for example, that he was a despot, an important part of his character.", "images": [], "asin": "0853316880", "parent_asin": "0853316880", "user_id": "AH2J4UJP7LZP4N4YRY65PHEMBBGQ", "timestamp": 1304730438000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "More an essay than a book", "images": [], "asin": "B010BBHDAC", "parent_asin": "B010BBHDAC", "user_id": "AHV7ZKFO5YKP6B6IBLVY5K6FUV6Q", "timestamp": 1453781205000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "The only Java book  to buy!", "text": "Horstmann has been in this business for 6 years.  I read all the Java books that he wrote. A professor from Germany, knows all the details and pitfalls of Java, gives good contrast with C++ and makes it easy for anyone to start programming from ground zero. Yes, SDK 1.4 compiler rules!... I use his books for Developer training in 6  colleges and companies in the New York area since 1997.  Most of the readers (my students) enjoy his books. The coverage of Applet is very poor. The next book, should have the SDK1.5 compiler or ?? version, with the Sun One Studio editor, and the source codes all installed on the CD-ROM.  Comparing with Deitel... this book is more practical in the business world.  If it has more examples in finance, fixed income, or derviatives, the book will be better.", "images": [], "asin": "0130471771", "parent_asin": "0130471771", "user_id": "AHDPBWK42ODDPULE25ZXI4S5EGRQ", "timestamp": 1045919847000, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "but fortunately the story line was fresh", "text": "This was a &#34;can't put down&#34; novel!  This is devoted to a not uncommon plot, unfortunately, but fortunately the story line was fresh.  Great writing and development of plot and characters.", "images": [], "asin": "B00YTXTIDO", "parent_asin": "B00YTXTIDO", "user_id": "AG7ORWTSLFASUZ7MYOR7VTALNW4A", "timestamp": 1453919015000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Heartbreaking Survival and Revenge", "text": "This was such a well written story, not only of survival but the lengths that Orion will go for her revenge.<br />Stolen off the streets as a 14year old girl.<br />10 years caged and abused for the depraved pleasures of monsters in ways that have ruined her ability to heal. Or so she thought.<br />These authors should consider co-writting more together.<br />It was a tragically cruel however beautifully written story about more than the abuse. More than just survival.<br />While heartbreaking to read in parts, it was captivating  and kept me intranced throughout. I want more.", "images": [], "asin": "B08F719CLS", "parent_asin": "B08F719CLS", "user_id": "AFJGA7TSAWMMNTE2GSYWMTF5LU5Q", "timestamp": 1597021285640, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "NO CD!", "text": "I bought this book expecting to receive the accompanying CD. It was not included so I have returned this purchase.", "images": [], "asin": "0195130464", "parent_asin": "0195130464", "user_id": "AFON7QOLZTDIQELGTRF32XOGGKRQ", "timestamp": 1646092599886, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A very good read, i bought it to read and then ...", "text": "A very good read, i bought it to read and then have my children read so we can have a family discussion about believing in themselves and asking for help when needed. It was a quick read, obviously, for veteran readers, my son is in 5th grade and has been reading a few pages each night. So far he is enjoying it.", "images": [], "asin": "0385744250", "parent_asin": "0385744250", "user_id": "AHTHTVNL7MGRIICNR2RNQNNCBFDQ", "timestamp": 1415190070000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "simply wonderful", "text": "This is a great book! The photographs are clear (no annoying fade outs so you can't see the image) and there are many detail photos. The directions are well written and easy to follow. What I like best about this book, is how modern the projects actually are. I could easily picture finding the jewelry in this book at an upscale boutique or gallery. What's even better, the designs aren't trendy, which means you'll get a lot more wear from a piece and not feel its outdated a season later. I highly recommend this book!", "images": [], "asin": "1596680482", "parent_asin": "1596680482", "user_id": "AGNQRHJPXQB27MKLPO37SF6UVDVA", "timestamp": 1213573262000, "helpful_vote": 5, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Arrived just as described!", "images": [], "asin": "0199587418", "parent_asin": "0199587418", "user_id": "AH4IPKXI2CRIRW5EBES76EFI2AUA", "timestamp": 1413992495000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Disappointed", "text": "Checked this cookbook out of library buying and glad I did.  Too many pictures with nothing to do with the recipes. Please if you make the shrimp dishes clean the vein out of the shrimp. People from the North don't seem to mind, but Floridians<br />certainly care.", "images": [], "asin": "1250130441", "parent_asin": "1250130441", "user_id": "AGMJ3UIYE3JVUEYUBCNMKTTY6EIA", "timestamp": 1495396316000, "helpful_vote": 4, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "One of the best books that I've ever read", "text": "One of the best books that I've ever read. Literally kept me on the edge of my seat from beginning to end. I would highly recommend it to anyone would want it to be a good thriller.", "images": [], "asin": "B00USC3SUY", "parent_asin": "B00USC3SUY", "user_id": "AFNTWXX6QP4PX7ZVCJGAYJQYET4A", "timestamp": 1440767404000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great book", "text": "Love this book. I was new to camtasia and this book was perfect. Easy to read. Easy to follow.", "images": [], "asin": "184969866X", "parent_asin": "184969866X", "user_id": "AEM74EEAFFWBTIOLDUDPD23LYY2A", "timestamp": 1455050597000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "The Elite Cheat", "text": "Should be required reading in the 8th grade...and repeated thereafter", "images": [], "asin": "0060926430", "parent_asin": "0060926430", "user_id": "AEDCZ36D4KV2OJFYSDO3JHSGK7XQ", "timestamp": 1470190781000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "great", "images": [], "asin": "0399171231", "parent_asin": "0399171231", "user_id": "AF6JPRLSYP7IUXA2OVWVNKSSI4EA", "timestamp": 1411736314000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "fun", "text": "Sphere is a really cool book. I am a big fan of Chrichton, I love how he weaves fiction and non-fiction together in his books (he knows a lot about science if his books are any indication). If you saw and hated the movie (as I did), you should still pick up the book because it is far better. The book is very suspensful (if a bit predictable, but if the writing is good then its easy to overlook that). I loved the ending, its different and intriguing, it shows that the real enemy wasn't any of them, but rather the power the sphere had to offer. Highly recommended.", "images": [], "asin": "0345353145", "parent_asin": "0345353145", "user_id": "AEG34JWYOVO4CVHSB3MHZNXFYSUA", "timestamp": 983998045000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Love this Bible!", "text": "I was kind of skeptic to purchase because I read a comment that said that the letters are so small you can't even see them. I'm glad I did buy it because in reality, the letters are just fine! I can still read without my glasses and its pretty cool to have both the spanish and english versions in one page. This is a great buy and to tell you the truth, the bible itself is not as big and bulky as you would think for basically having two bibles in one! Highly recommend!", "images": [], "asin": "1563206579", "parent_asin": "1563206579", "user_id": "AFXWIESRZBHIYCQDMOK4FREKKOPQ", "timestamp": 1405752143000, "helpful_vote": 56, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "This book is...", "text": "Superb; simply superb.", "images": [], "asin": "B002LLRDW4", "parent_asin": "B002LLRDW4", "user_id": "AGQFF4IOC2CRSTFSQYXWQ6IUK7YA", "timestamp": 1445629279000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Way ahead of its time.", "text": "One of the truly great science fiction novels. Fast paced, exciting, and reads like an action movie written by the smartest, funniest guy you know.", "images": [], "asin": "0553380958", "parent_asin": "0553380958", "user_id": "AGD6IFLDIAR4H5E7DW3477UCV4DA", "timestamp": 1532693896311, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "very adult topics....very full of dark topics", "images": [], "asin": "1573222453", "parent_asin": "1573222453", "user_id": "AHN6LG3RLU3CXBHCCGKXMQZOXO3A", "timestamp": 1438462242000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "All that glitters is not gold", "text": "Joan London's \"The Golden Age\" is a promising story, tenderly written, and full of both hope and sorrow.  Set in Perth, Australia in the early-1950s, Frank and Elsa both suffer from polio.  They meet at The Golden Age, a converted pub that serves as a hospital for children recovering from the disease.  We learn quite a bit about Frank, a sensitive boy and a budding poet.  But Elsa remains a mystery -- a wispy shadow whose character isn't as well developed.<br /><br />Frank and Elsa's romance blossoms, but then it's cut short when the young couple gets a little too close. They both kicked out of the hospital.  That's when things go sideways in the story.  It's not that the ending was disappointing -- that's life -- I just wasn't sure if things made much sense.  I'll leave it to you to decide.  But to me, the book was very enjoyable, just lacking a bit in the final chapters.", "images": [], "asin": "1609453328", "parent_asin": "1609453328", "user_id": "AEHTVFE57E24J4EA6YK6H43R5EYA", "timestamp": 1632753713780, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "skip it", "text": "This book begins much better than it ends. I'm a longtime Ludlum fan (I've read every book he's ever done), and for awhile, I really thought the Ludlum of old was back. I thought MATARESE COUNTDOWN and APOCALYPSE WATCH were just bad dreams I could forget.<br />Nope. This one isn't much better. Ludlum does a great job hooking you with the premise, but then proceeds to go nowhere with it. The much vaunted &quot;high tech&quot; angle is rarely reflected in the plotline, which I thought got duller and duller as it went. It was a real struggle for me to finish the last 40 pages or so, because I just didn't care anymore.<br />Overall, it reads like a lukewarm rehash of Ludlum's earlier (and much better) book AQUITAINE PROGRESSION. The problem as I see it, is that the Ludlum of today no longer connects the twists and turns to the story. Instead, the characters just stagger around from city to city, country to country, with little rhyme or reason to be found.<br />Sigh. I think I'll go back now and re-read BOURNE IDENTITY.", "images": [], "asin": "031225346X", "parent_asin": "031225346X", "user_id": "AFMTDOXLLSHHPFBDQN4M7CWMPGXA", "timestamp": 975735814000, "helpful_vote": 31, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Another great book by Edwina!", "text": "So.e of the cutest little pictures to color!", "images": [], "asin": "1726195554", "parent_asin": "1726195554", "user_id": "AGJQ5B3FQMPF32ZWTPYL6DOOTYLA", "timestamp": 1539308130665, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "She is an amazing thinker.", "images": [], "asin": "0882145630", "parent_asin": "0882145630", "user_id": "AE3PLL4L3QJA2KML5IMIUJJCFYQQ", "timestamp": 1504391898167, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Refreshing!!!", "text": "Well, i have to admit, i was quite surprised with this book. The main character is not your typical urban fantasy chick, you know the one that has become popular: really strong, whinny in a childish way and all the guys after her!<br />She is actually smart, doesn't really complain, tries her best even though it's not always enough and has to wow!! get this, really work for it!<br />There is no mushy romance but there is a bit of tension and one sex scene in the begining. However, the author tunned it down and focused on the really wicked plot and not the romance!!<br />The story is delivered in a medium paced way where you actually get to understand and love the world you are discovering!<br /><br />I really recommend this and hopefully others will discover that we have a talented author rising!!!", "images": [], "asin": "0553592351", "parent_asin": "0553592351", "user_id": "AGJ4HB3SOVCHRYCO4GTQ6MG3WH7A", "timestamp": 1247674141000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "Sultry sexy and fast paced", "images": [], "asin": "151691127X", "parent_asin": "151691127X", "user_id": "AF7QFNZUK2ZJJ6SYF6PKMRFRTW4A", "timestamp": 1441805675000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Timeless classic", "text": "Edward Abbey captures the desert, and is very thought provoking. This memoir was based on experiences in the 50's, first published in the 60's, but I think the messages are timeless.", "images": [], "asin": "0671695886", "parent_asin": "0671695886", "user_id": "AG5TOA35EWH7ASP4O36MZFALXY3A", "timestamp": 1387913217000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Quickest way to hit the ground running", "text": "If I have to have one Spring book, this would be it...very well written, extremely practical and with the right level of detail. This is not only great in content but also a joy to read...and as a result one gets the most bang for the time spent with the book. This is a must have companion for learning a key Java technology framework.", "images": [], "asin": "1590599799", "parent_asin": "1590599799", "user_id": "AHHWZZHJCRXM7XXHSVG7G6O6YCHQ", "timestamp": 1260075299000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "Nice patterns", "images": [], "asin": "1564773116", "parent_asin": "1564773116", "user_id": "AFICGN2EBDL7JP326QXURRAARPFQ", "timestamp": 1457654990000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Love", "text": "Love", "images": [], "asin": "0060537221", "parent_asin": "0060537221", "user_id": "AELJEOPBUHSHBCLXWCJ7IEBTJDRQ", "timestamp": 1606143943789, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "A great author, and an excellent read.", "images": [], "asin": "0451238915", "parent_asin": "0451238915", "user_id": "AGFQK545JM2B6R6M2324IEZNHRAA", "timestamp": 1422767760000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Would like a little more backstory", "text": "Quite entertaining. Would like a little more backstory, maybe in the next one", "images": [], "asin": "1401228283", "parent_asin": "1401228283", "user_id": "AFNKLF3STMY4ITW6HKIQQHDTTBMA", "timestamp": 1447728266000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Nice", "text": "Super fun", "images": [], "asin": "0399161945", "parent_asin": "0399161945", "user_id": "AGTKUQLCYUJIM753O65PFL3ABH4Q", "timestamp": 1634168297195, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Excellent Non-traditonal way for piano practice", "text": "Excellent non-traditonal approach to improve piano practice. I have been using the guide to fix some bad habits.", "images": [], "asin": "1527207005", "parent_asin": "1527207005", "user_id": "AEFMYVSRYL7YRLYX3TTG75TBAKVQ", "timestamp": 1504664154929, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "History of a brave young woman in WWI and shortly thereafter", "text": "This is a wonderful story for many reasons. Maisie is a woman ahead of her time, she's gutsy, ambitious and smart as a whip.<br /><br />Maisie Dobbs began her first job at age thirteen. Her parents wanted to send her to college but the unexpected death of her Mum changed that and her father found a job for her in a suitable position.<br /><br />Maisie became a maid in an home of Lord and Lady Rowan Compton. Lady Compton was a suffragette and was for the advancement of woman in general. In Maisie, she noticed her in her library and Maisie told her she wanted to read books and learn. Lady Compton was impressed and kept her eye on Maisie. Later, when Maisie became an investigator she sent Maisie customers.<br /><br />Later, as WWI began, Maisie took nursing training and went to France to help care for the soldiers who were being injured in many ways with gas, shrapnel, bullet wounds and psychological injuries. While overseas, working with the soldiers she was drawn to one.<br /><br />After the war, Maisie uses some skills learned from one of Lady Compton's connections. Dr. Blanche was a trained psychologist and detective. He taught Maisie deductive thinking and since she had good common sense, he told her to trust her instincts and to beware of coincidences.<br /><br />Her first case leads her to a woman who would travel to a cemetery twice a week to mourn a young soldier. Maisie travels to a convalescent home being used for wounded and maimed soldiers.<br /><br />What I liked about the book was Maisie's compassion, her desire to raise above the situation to which she was born, and her manner in working with patients and the people around her.<br /><br />The scenes in France are well described and we get a look at the difficulties the young nurses faced during the Great War. They not only had to deal with soldiers wounded grievously but they had strict rules of behavior and little understanding for their plight.", "images": [], "asin": "1616954078", "parent_asin": "1616954078", "user_id": "AHV25QXIC4BZ5MNJXPTPGVQR73VA", "timestamp": 1440023791000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "Excellent children's book - missing the CD.<br />I found it on the internet!", "images": [], "asin": "1596871814", "parent_asin": "1596871814", "user_id": "AGPFN7465OILLLC224BCHEYYGHGQ", "timestamp": 1425304162000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Love this book", "images": [], "asin": "0136042597", "parent_asin": "0136042597", "user_id": "AGPELGNX3KG7T33E22KTSDNAA6RQ", "timestamp": 1504557691851, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Worth the wait!", "text": "Each year the authors delight their fans with a Christmas story packed with heart and action!  The previous Christmas titles are as follows:  A Lone Star Christmas, A Rocky Mountain Christmas, A Big Sky Christmas, A Frontier Christmas, A Texas Hill Christmas, A Colorado Christmas, An Arizona Christmas, A High Sierra Christmas, A Jensen Family Christmas and A MacCallister Christmas.  Each book can be read alone and in any order a reader chooses.  The novels include some of the favorite characters from Johnstone country such as Smoke and Sally Jensen, Preacher, etc.<br />In A Death Valley Christmas, it was enjoyable to meet up again with Ace and Chance Jensen.  The story starts out with a descendant of theirs telling of one of the twin’s adventures from the past.  As I turned pages, it was not only the plot that held my attention but the geographic location of the tale.<br />While these rugged men go wherever they choose, they have no problem stepping in to help those in need.  When Chance wins a silver mine in a poker game, what sounds promising may hold more trouble than it is worth.  Ace and Chance are each other’s best friend, and they rely on each other to come to the other’s aid if the need ever arises, which it does often!<br />As I neared the end of the tale, the authors introduced a familiar character which brings even more excitement to the conclusion of the book.  I hope audiences will enjoy reading the newest addition to the Christmas series by these wonderful authors.  If you’ve missed any, I highly recommend obtaining copies and then prepare to cozy up to wild and exciting tales!", "images": [], "asin": "1496731999", "parent_asin": "1496731999", "user_id": "AFEJI4X7IL5GWC62TIHPQBEP3OLQ", "timestamp": 1627935452670, "helpful_vote": 4, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "how confusing can a calendar be?", "text": "I love Lonely Planet calendars. For years they were perfect, then in 08 they changed their format. Not enough photos. I and many others complained to LP and I was told they were making an adjustment for 09. It is true, the photos are back to the old format more or less, BUT and it is a big BUT, they start the week on Monday. Sunday is all the way to the right. After one month of missed meetings and confusion with my life, I had to abort the LP 09 calendar.", "images": [], "asin": "1741791006", "parent_asin": "1741791006", "user_id": "AFNZUHP3ZN4XQNB6LYALLPZBXZ2Q", "timestamp": 1234621265000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Five Stars", "text": "Needed it for school.", "images": [], "asin": "1457673371", "parent_asin": "1457673371", "user_id": "AEGAY7DA72CDWOKTL3WQDKD5EYHQ", "timestamp": 1506373254323, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Embrace the power of magic in your life.", "text": "Like talking to a wise, encouraging friend. Inspirational!", "images": [], "asin": "1408866749", "parent_asin": "1408866749", "user_id": "AEK72ETMICKKRWB4EQL5QWVXGF3A", "timestamp": 1453316464000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "So Worth It!", "text": "I’m a huge fan of Shel Silverstein and this took me way back to reading his books in the library as a kid! I’m almost 30 and these stories had my giggling like a little girl. Everyone can find something to enjoy in this collection! The illustrations add so much to the atmosphere of the collection as well. Not to mention it touches on the important topic of mental health. This collections helps to show children, and grownups, that smiling never gets old. Definitely an experience that should be had by children and adults alike.", "images": [], "asin": "1735246344", "parent_asin": "1735246344", "user_id": "AEL2QDV3DLO5H2HEMOKAFLEG6GHA", "timestamp": 1631650557046, "helpful_vote": 3, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Marius Gabriel is fast becoming one of my favorite authors. First with \"Wish me luck as you ...", "text": "Marius Gabriel is fast becoming one of my favorite authors. First with &#34;Wish me luck as you wave me goodbye&#34;, and now with The original sin. I'm impressed with this authors knowledge of and how deeply he delves into history, in this book it is with the Spanish Civil War. But also with his rare literary talent...he has lots of it. The main character in this book is deeply complex and fascinating. I can't wait to read  more of Gabriel's books! I will say that I was surprised that this book was written by a man.", "images": [], "asin": "B015ENC2LM", "parent_asin": "B015ENC2LM", "user_id": "AFQEN7EDMNIDQ35FVSWCQQTGTQWA", "timestamp": 1452469059000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "The best way to read.", "text": "I love these hardcovers these editions are cheap and affordable. And no spoilers its just a amazing read", "images": [], "asin": "1421578840", "parent_asin": "1421578840", "user_id": "AGUDHDKIEF3DW7FXHVNE44TG2HYA", "timestamp": 1513450363860, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A page turner", "text": "I was skeptical about this book but once I started reading, I couldn’t put it down. I didn’t think I’d like the subject matter.  It was so compelling, so exciting at times. I loved it. I can’t wait to start book 2 of the trilogy. Great read.", "images": [], "asin": "B00AESRRQS", "parent_asin": "B00AESRRQS", "user_id": "AHPU5OEMDVRCJRPEOLGKWT4BFTXQ", "timestamp": 1589491853134, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "Bored me to tears", "images": [], "asin": "B014WBAUES", "parent_asin": "B014WBAUES", "user_id": "AGLYH7CETTD4RGNZZURSDHRZH5UQ", "timestamp": 1461360216000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Nice book!", "text": "Very well made book. I'm not a photographer but I don't like paying for someone to take my family pictures. This is really nice book to get some great ideas and learn how to make your own family pictures fabulous without paying someone else tons of money to do it. Lots of great pictures. Very colorful!", "images": [], "asin": "1781574227", "parent_asin": "1781574227", "user_id": "AHV7LKZELPOHGBWXQ6GLKLYHHPDA", "timestamp": 1517313238664, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Excellent for me to see the bigger picture with teaching art!", "text": "With being a homeschool mom to a preschooler and a 1st grader, this book came at a perfect time for me! I enjoyed how easy the lesson plans are to follow and that they are to the point. I appreciated that Jerry writes out the objectives for the first grader before diving in to the units. We are enjoying the creative process with each of the lessons! It has been a lot of fun to see my daughter start to look at the world around her with new eyes as the lessons have challenged her to take note of her world. This is an excellent resource for teachers, no matter your class size!<br />I received this book from Celebrate Lit. This is my honest review and is in no way influenced by receiving a complimentary copy.", "images": [], "asin": "1683145712", "parent_asin": "1683145712", "user_id": "AE57TAJUSZM7XUSI7AZ6BQCNEDTQ", "timestamp": 1569119378414, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Great Gift!", "text": "Purchased as a gift for a friend, he loved it and would recommend it to everyone.", "images": [], "asin": "1604593458", "parent_asin": "1604593458", "user_id": "AGW36ZG3DBWFKLWZ2A46Y73MOXCA", "timestamp": 1495772608000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "A Good Weekend's Read", "text": "When I started the book, I couldn't put it down.  Really enjoyed the development of the two main characters, Cain and Danziger.  Once the plot started linking in Meyer Lansky, Lucky Luciano and others, I started to have trouble following what was happening. If I was the author's editor, I would have told him to re-write the second half of the book and omit the mafia references.  I would have preferred the plot based on the letter writing.", "images": [], "asin": "1101875062", "parent_asin": "1101875062", "user_id": "AEUW7FUIMJS7LMNXH3FXFM5RHLBA", "timestamp": 1467034456000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Very informative.", "images": [], "asin": "1440496501", "parent_asin": "1440496501", "user_id": "AFOSK7CWRS25AROEAZ6SWU4HIK3Q", "timestamp": 1524502559264, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great classic Sci-fi book.", "images": [], "asin": "0345358554", "parent_asin": "0345358554", "user_id": "AGA5WAVZW7G3C62A2BYHOJ7WPCLQ", "timestamp": 1443896224000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Fascinating personal touch to some history", "images": [], "asin": "1503270645", "parent_asin": "1503270645", "user_id": "AGVP2RQDQE4ZWOICHWFX7TAHLS4Q", "timestamp": 1452690307000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Anita Blake", "text": "Love!! Looking forward to the next book already! Off to the book store to read more Anita Blake adventures! Yay!", "images": [], "asin": "B000OCXIMQ", "parent_asin": "B000OCXIMQ", "user_id": "AGPB35F2GLA26PM3CZOHDB7YETIQ", "timestamp": 1580510290031, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Very nice!", "text": "Great help!", "images": [], "asin": "1426758251", "parent_asin": "1426758251", "user_id": "AGJ6UWSOUSOV6UO4HK6Q7DJ7RWSA", "timestamp": 1412679043000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Not high-school geometry -- thank goodness!", "text": "Well, typically most geometry self-teachning books focus on the topics typically covered in a high school geometry class, which I might add are quite simplistic in nature. I skimmed through this book at my local bookstore out of curiousity (I've had good luck with the demystified series, especially physics, by the same author), and what really caught my attention was the coverage of the elementary high school topics in a lean, mean six chapters with the rest covering hyperspace, warped space, polar coordinates, and basic vector mathematics.<br /><br />The quizzes are pretty good for reinforcing the concepts...they actually make you think (gee, what a concept)! It'd be nice if there were more of the problems, however (but not as many as Glencoe's books do). The tests really give one a sense of being in a classroom, especially since there's a final exam as well.<br /><br />This book is a gem, and for $13, you can't really go wrong.", "images": [], "asin": "0071416501", "parent_asin": "0071416501", "user_id": "AHTCD6BDPBSB7HA2SQ7V7YQ3JTEQ", "timestamp": 1147570817000, "helpful_vote": 17, "verified_purchase": false}
{"label": 1, "rating": 3.0, "title": "Good window on qualities in giant schnauzers", "text": "Wanted to have a new prospective on owning a giant schnauzer", "images": [], "asin": "B0BSJLDGK6", "parent_asin": "B0BSJLDGK6", "user_id": "AHDPWPUX6N354AJA3MKEK7OXWP7A", "timestamp": 1676500242693, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Four Stars", "text": "I think it could've used a section on fair isle.", "images": [], "asin": "1596681497", "parent_asin": "1596681497", "user_id": "AGASQRQYBCD5POIAK62TSCW5RBVQ", "timestamp": 1441839549000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "hurricane", "text": "I was familiar  with the subject because I live in a hurricane region", "images": [], "asin": "071808425X", "parent_asin": "071808425X", "user_id": "AF377CPMLRPK3KTYPTO5DFC357MQ", "timestamp": 1534176227798, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 2.0, "title": "Badly organized and edited", "text": "Here are some examples of the errors in this book; I gave up on it around page 50.  It tries to distinguish between RISC and CISC but gets them backwards.  Most of the underscores in the code listings have been replaced by spaces.  It states that linked lists and arrays are the same thing.  A table refers to the &quot;Bite size&quot; of processor architectures.  Structurally, it jumps quickly into a deep description of x86 instruction scheduling without explaining why.  There's some useful information in there, if you can find it through the errors and poor organization.  There are better books on the topic.", "images": [], "asin": "0072125985", "parent_asin": "0072125985", "user_id": "AEWYX2CB3IHXBCCG3S7GDJ2665SA", "timestamp": 994630280000, "helpful_vote": 13, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Makes you have second thoughts on cruising.", "images": [], "asin": "B000FC10TS", "parent_asin": "B000FC10TS", "user_id": "AHNAIWXXTGSSTOAZDY7R3EXQXB7A", "timestamp": 1508650323986, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Love this!!", "text": "We love this book!!! Such a cute relatable story that helps kids understand how to make money doing what they already love doing. I especially love the “talk about it” and behind the scenes sections at the back of the book.", "images": [], "asin": "B08TZ7DP4H", "parent_asin": "B08TZ7DP4H", "user_id": "AHMEHU7FFX6NM4QHKPSRKXSQAUAA", "timestamp": 1647531001682, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Delightful pictures illustrate this story that teaches good values", "text": "This has been a favorite in our house for 20+ years. With our first child and now with our youngest. The pictures are wonderful, your child will love finding new things every time they read the book. And the messege that is taught, each time the fairy purchases a new animal and then sets it free after she admires it or when she shares her coat with the frog so he can stay warm. The message of caring for others is expressed in an easy to understand way. Great book for children and adults to share.", "images": [], "asin": "0140547517", "parent_asin": "0140547517", "user_id": "AHTV7I22YZSGETBSHL5DSK4BE7SA", "timestamp": 1178514669000, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A Fabulous Addition To Any Art Lovers Collection!", "text": "Belle and Brimstone find themselves on a journey they were destined to make. Being butterflies, and stuck in a painting for centuries, their life was uneventful and motionless, until that one day when fate stepped in, not only educating the butterflies, but educating the reader, as well. In trying to find their own painting, they had been popped out of when it was being taken to the Conservation Studio, the butterflies find themselves on an adventure, eluding danger, meeting new characters in other paintings. Belle's humor will delight children as they read the story, wondering if the butterflies will ever reunite with their painting. Mary Lee Corlett has created a masterpiece of her own, while the artist, Phyllis Saroff, brings her fun and illuminating story to life. What a fantastic pair. Children and adults of all ages will devour and relish this 56 page softcover picture book.", "images": [], "asin": "1593730845", "parent_asin": "1593730845", "user_id": "AHBCKZYUHK3IJEHJ26ZO7JPADLYQ", "timestamp": 1329051228000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Mozza", "text": "One of the BEST cookbooks I have. Therer is a pizza crust recipe that beats out anything I have ever put in my mouth! Simply delicious. Thin-crusty and chewy on the inside. It is perfection. It takes a few hours, well several, to make and let rise etc. BUT so worth it.", "images": [], "asin": "0307272842", "parent_asin": "0307272842", "user_id": "AGBC64IU7RZGRFBEZPFA622ANBWA", "timestamp": 1355341258000, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Classic!", "text": "Great classic. Good quality book", "images": [], "asin": "0448405202", "parent_asin": "0448405202", "user_id": "AGL6D3ZP7UYI365NBFRX2MNNYREQ", "timestamp": 1558438231516, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "My students like it, too", "text": "I teach a psychological economics and policy course in an MPA program.  About twelve seconds into reading this book, I knew that I would be adding it to my syllabus.  Every week, I give the students a reading comprehension quiz; this book's quiz was the only one on which every student received an A.  I suppose one hypothesis is that I made the quiz too easy that week, but I suspect that the students did so well because they found the book particularly engaging and memorable.  The class discussion was also particularly enthusiastic.<br /><br />The book is easily accessible to a broad audience.", "images": [], "asin": "0553384112", "parent_asin": "0553384112", "user_id": "AEKGARQYGZSRWOICSSGR72BV5ZXQ", "timestamp": 1325904829000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "I really enjoyed this refreshing and unique package from the first unwrapping ...", "text": "I really enjoyed this refreshing and unique package from the first unwrapping of the little treasure box to the reading and exploring. The text and photos took me on a very special journey through the wandering life of Tony Gwilliam who seems to have scoured the planet for his experience and inspiration. A fun easy to read book and a great addition on your coffee table providing no end of stories for conversation.", "images": [], "asin": "0692484477", "parent_asin": "0692484477", "user_id": "AGSPSUZKBDGWUQHDA33QIVWZDLKA", "timestamp": 1454957322000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "A wonderful learning story for young people.", "images": [], "asin": "0385374143", "parent_asin": "0385374143", "user_id": "AHENKNR2NCZH3SROMGLHKW5UDCGA", "timestamp": 1462840338000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Wrenching", "text": "If these novelettes were one novel then they would make on rocking book! The fourth in Workman's series is darker than the first three. Many of my suspicions and predictions came true and were revealed in this heart-stopping tale. As usual, a lovely blend of horror, fairy tale and teen drama. Snow's tantrum was annoying, but it also reminded me that she's just fifteen and therefore, completely allowed to freak out at least once. Looking forward to the next!", "images": [], "asin": "B008ROJOWG", "parent_asin": "B008ROJOWG", "user_id": "AEY3G3HMUKABX5DXAAPMZCB2XU6Q", "timestamp": 1355899090000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "No hands on book work examples or enough detail to ...", "text": "No hands on  book work  examples or enough detail to flesh out the concepts.", "images": [], "asin": "1530918154", "parent_asin": "1530918154", "user_id": "AGCR63DQA4CYBI2D3S5LETVXTZWA", "timestamp": 1530587735439, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Great Read - Share with Friends", "text": "I found this book not only entertaining but enlightening.  It really gives a great point of view - why we are where we are in life and how we are all connected.  I'm going to have all my kids read it and am giving it as gifts to all my sibs and sib-inlaws.  That's how good I think it is.", "images": [], "asin": "0786868716", "parent_asin": "0786868716", "user_id": "AH4MQVWGMU3BXTALZHIV72IFZ62A", "timestamp": 1068564225000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Intelligence enhancing without games", "text": "You won't agree with all and maybe you'll disagree with most, but they are provocative, mind challenging, and often quotable. The only problem is that they go by so fast that you'll have to, want to, back up and listen again. Never mind the so-called intelligence enhancing games. This will do it.", "images": [], "asin": "1400069971", "parent_asin": "1400069971", "user_id": "AE53IQXJ36A27VDA6M2KUOJNF5MA", "timestamp": 1462160139000, "helpful_vote": 0, "verified_purchase": true}
{"label": -1, "rating": 1.0, "title": "Uninteresting first chapter.", "text": "With the best intentions (and a lot of concentration), I managed to get through the first chapter of Oryx and Crake.  But then I closed the book forever.  Maybe I just don't like science fiction, but I didn't find the book interesting at all.  It's unfair for me, perhaps, not to begin chapter two, but I have a rule never to read a second chapter if the first one bores me.  And Oryx and Crake did.", "images": [], "asin": "0385503857", "parent_asin": "0385503857", "user_id": "AGXWRESID535YR2GTDSUB24U6KVQ", "timestamp": 1056958275000, "helpful_vote": 5, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Perfect", "images": [], "asin": "0786222417", "parent_asin": "0786222417", "user_id": "AF5PKZ2PJWCXQG5AYA4A6DQ3M2XQ", "timestamp": 1464289652000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "GREAT BOOK", "text": "SUCH A GREAT BOOK! While I still think the 4th one was just a little bit better, it was still a great read. The suspense was great as it is with all the books in the sieries.  I also loved the characters, especially Clare because she reminded me of myself. Cassandra Clare also did a wonderful job at describing each scene. It really. Made me feel like I was part of. The book. The only thing I didn't really like about the book was the fact that the 2 main characters were apart for a majority of the time. Still, I really hope there is a 6th book because I'm already wondering what's going to happen next.", "images": [], "asin": "1442416866", "parent_asin": "1442416866", "user_id": "AE2QEEWRRZS66RFWTYESK63WSWLA", "timestamp": 1383854832000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "helpful", "text": "Very helpful to help children be more familiar with basic phonic skills. You can also make the task more challenging, like introducing the word for each picture instead of merely write the beginning letters.", "images": [], "asin": "076968291X", "parent_asin": "076968291X", "user_id": "AFEK5UNOZC5N5HKJGN6P7LOQ6IKQ", "timestamp": 1386391377000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Good book kept me laughing", "text": "I definitely enjoyed this book, and am so glad I purchased it. It definitely gave me insite into what the author goes thru on a daily basis and the things that she sees. Fast read, would definitely refer to friends.", "images": [], "asin": "B00AT065SW", "parent_asin": "B00AT065SW", "user_id": "AFWU6XZ5CXBD3TOKUPBYIU4N55DQ", "timestamp": 1358776352000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Bloodhound", "text": "you have to love Tamora Pierce, all of her books are great!<br />Though i would of liked to know what happened when Beka met up with rosto at the end of the book.", "images": [], "asin": "0375814698", "parent_asin": "0375814698", "user_id": "AHPRH4AYVCECAUX4KKPVKJOXQORA", "timestamp": 1240022823000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A Great Book To Own", "text": "When a cookbook gives me at least one really great recipe, it is worth the money. This book provides page after page of scrumptious fare! It is for those with adventuresome tastebuds and willing to invest a little time preparing a tasty meal. Do not buy this book if you are looking for appetizer recipes in the typical sense. The recipes in this collection feature flavors from around the world. They run the gamut from bread based tasties to flavorful soups, unique salads, vegetables, pasta, meats and seafoods with a nice assortment of sauces and salsa. Each dish typically provides about 4 - 6 small servings. Make several for a little party, or prepare one just for yourself with leftovers. Enjoy!", "images": [], "asin": "1586857819", "parent_asin": "1586857819", "user_id": "AFFDNENWJMMZMELLA2IBVVWQAR6A", "timestamp": 1214972985000, "helpful_vote": 6, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "I like it. Short book lots of contents. I recommend it if you want to learn more about history", "images": [], "asin": "0595470475", "parent_asin": "0595470475", "user_id": "AED5VZNLEZVYPWNE55K6S64HMTWA", "timestamp": 1530467995153, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Loved it!", "text": "Fabulous book!  Loved it from start to finish.  This is a clean book as far as I remember.  The main characters sleep together but it's just implied in the book.", "images": [], "asin": "0062072048", "parent_asin": "0062072048", "user_id": "AFPXB3XEAHTB5W43SG63GVPXSENQ", "timestamp": 1376427158000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "CARIAN COLE IS AMAZING. THIS BOOK WAS PERFECT", "text": "𝕋𝕙𝕚𝕤 𝕓𝕠𝕠𝕜 𝕨𝕚𝕝𝕝 𝕙𝕒𝕦𝕟𝕥 𝕞𝕖 𝕗𝕠𝕣 𝕒 𝕝𝕠𝕟𝕘 𝕥𝕚𝕞𝕖 𝕀’𝕞 𝕤𝕦𝕣𝕖. 𝕀 𝕨𝕠𝕟’𝕥 𝕗𝕠𝕣𝕘𝕖𝕥 𝕥𝕙𝕖𝕤𝕖 𝕔𝕙𝕒𝕣𝕒𝕔𝕥𝕖𝕣𝕤 𝕒𝕟𝕕 𝕥𝕙𝕖𝕚𝕣 𝕤𝕥𝕠𝕣𝕪 𝕒𝕟𝕪𝕥𝕚𝕞𝕖 𝕤𝕠𝕠𝕟. 𝕋𝕙𝕚𝕤 𝕚𝕤 𝕨𝕙𝕪 𝕀 𝕝𝕠𝕧𝕖 ℂ𝕒𝕣𝕚𝕒𝕟 𝕒𝕟𝕕 𝕙𝕖𝕣 𝕓𝕠𝕠𝕜𝕤 s𝕙𝕖 𝕜𝕟𝕠𝕨𝕤 𝕙𝕠𝕨 𝕥𝕠 𝕞𝕒𝕜𝕖 𝕞𝕪 𝕙𝕖𝕒𝕣𝕥 𝕙𝕦𝕣𝕥 𝕓𝕦𝕥 𝕒𝕝𝕤𝕠 𝕙𝕠𝕨 𝕥𝕠 𝕙𝕖𝕒𝕝 𝕚𝕥.<br />ℙ𝕚𝕡𝕖𝕣 𝕒𝕟𝕕 𝔹𝕝𝕦𝕖’𝕤 𝕣𝕖𝕝𝕒𝕥𝕚𝕠𝕟𝕤𝕙𝕚𝕡 𝕚𝕤 𝕚𝕟𝕥𝕖𝕣𝕥𝕨𝕚𝕟𝕖𝕕 𝕨𝕚𝕥𝕙 𝕒𝕕𝕕𝕚𝕔𝕥𝕚𝕠𝕟 𝕒𝕟𝕕 𝕞𝕖𝕟𝕥𝕒𝕝 𝕚𝕝𝕝𝕟𝕖𝕤𝕤. ℂ𝕒𝕣𝕚𝕒𝕟 𝕕𝕚𝕕 𝕤𝕦𝕔𝕙 𝕒𝕟 𝕒𝕞𝕒𝕫𝕚𝕟𝕘 𝕛𝕠𝕓 𝕤𝕙𝕠𝕨𝕚𝕟𝕘 𝕙𝕠𝕨 𝕓𝕠𝕥𝕙 𝕤𝕚𝕕𝕖𝕤 𝕒𝕣𝕖 𝕒𝕗𝕗𝕖𝕔𝕥𝕖𝕕 𝕓𝕪 𝕓𝕖𝕚𝕟𝕘 𝕚𝕟 𝕒 𝕣𝕖𝕝𝕒𝕥𝕚𝕠𝕟𝕤𝕙𝕚𝕡 𝕨𝕚𝕥𝕙 𝕤𝕦𝕔𝕙 𝕓𝕚𝕘 𝕠𝕓𝕤𝕥𝕒𝕔𝕝𝕖𝕤.<br />𝕄𝕪 𝕤𝕥𝕠𝕞𝕒𝕔𝕙 𝕨𝕒𝕤 𝕚𝕟 𝕜𝕟𝕠𝕥𝕤, 𝕞𝕪 𝕔𝕙𝕖𝕤𝕥 𝕗𝕖𝕝𝕥 𝕙𝕖𝕒𝕧𝕪.<br />𝕀 𝕗𝕖𝕝𝕥 𝕙𝕒𝕡𝕡𝕪, 𝕖𝕩𝕔𝕚𝕥𝕖𝕕, 𝕒𝕟𝕘𝕣𝕪, 𝕤𝕒𝕕, 𝕒𝕟𝕩𝕚𝕠𝕦𝕤. 𝕆𝕟𝕖 𝕞𝕚𝕟𝕦𝕥𝕖 𝕀 𝕨𝕒𝕟𝕥𝕖𝕕 𝕥𝕠 𝕣𝕖𝕒𝕔𝕙 𝕚𝕟 𝕒𝕟𝕕 𝕙𝕦𝕘 𝕥𝕙𝕖 𝕔𝕙𝕒𝕣𝕒𝕔𝕥𝕖𝕣𝕤 𝕒𝕟𝕕 𝕥𝕙𝕖 𝕠𝕥𝕙𝕖𝕣 𝕞𝕚𝕟𝕦𝕥𝕖 𝕀 𝕨𝕒𝕟𝕥𝕖𝕕 𝕥𝕠 𝕥𝕙𝕣𝕠𝕨 𝕞𝕪 𝕜𝕚𝕟𝕕𝕝𝕖 𝕒𝕔𝕣𝕠𝕤𝕤 𝕥𝕙𝕖 𝕣𝕠𝕠𝕞!<br />ℙ𝕚𝕡𝕖𝕣 𝕒𝕟𝕕 𝔹𝕝𝕦𝕖’𝕤 𝕣𝕖𝕝𝕒𝕥𝕚𝕠𝕟𝕤𝕙𝕚𝕡 𝕨𝕒𝕤 𝕤𝕠 𝕤𝕨𝕖𝕖𝕥 𝕚𝕟 𝕥𝕙𝕖 𝕓𝕖𝕘𝕚𝕟𝕟𝕚𝕟𝕘. 𝕀 𝕗𝕖𝕝𝕝 𝕚𝕟 𝕝𝕠𝕧𝕖 𝕨𝕚𝕥𝕙 𝕥𝕙𝕖𝕞 𝕤𝕠 𝕢𝕦𝕚𝕔𝕜𝕝𝕪 𝕒𝕟𝕕 𝕥𝕙𝕖𝕟 𝕤𝕙*𝕥 𝕙𝕚𝕥 𝕥𝕙𝕖 𝕗𝕒𝕟 𝕒𝕟𝕕 𝕀 𝕨𝕒𝕤 𝕕𝕖𝕤𝕥𝕣𝕠𝕪𝕖𝕕. 𝔹𝕦𝕥 𝕥𝕙𝕖𝕣𝕖 𝕨𝕖𝕣𝕖 𝕒𝕝𝕤𝕠 𝕤𝕠 𝕞𝕒𝕟𝕪 𝕥𝕚𝕞𝕖𝕤 𝕥𝕙𝕒𝕥 𝕀 𝕝𝕒𝕦𝕘𝕙𝕖𝕕 𝕠𝕦𝕥 𝕝𝕠𝕦𝕕 𝕒𝕥 ℙ𝕚𝕡𝕖𝕣’𝕤 𝕚𝕟𝕟𝕖𝕣 𝕞𝕠𝕟𝕠𝕝𝕠𝕘𝕦𝕖𝕤 𝕒𝕟𝕕 𝕙𝕠𝕨 𝕤𝕚𝕝𝕝𝕪 𝕒𝕟𝕕 𝕡𝕝𝕒𝕪𝕗𝕦𝕝 𝔹𝕝𝕦𝕖 𝕒𝕟𝕕 ℙ𝕚𝕡𝕖𝕣 𝕔𝕠𝕦𝕝𝕕 𝕓𝕖 𝕥𝕠𝕘𝕖𝕥𝕙𝕖𝕣.<br />𝕀 𝕝𝕠𝕧𝕖𝕕 𝔹𝕝𝕦𝕖’𝕤 𝕝𝕖𝕥𝕥𝕖𝕣𝕤 𝕒𝕟𝕕 𝕟𝕠𝕥𝕖𝕤 𝕒𝕟𝕕 𝕤𝕠𝕟𝕘𝕤 𝕙𝕖 𝕨𝕣𝕠𝕥𝕖 𝕥𝕠 ℙ𝕚𝕡𝕖𝕣.<br />ℙ𝕝𝕖𝕒𝕤𝕖 𝕣𝕖𝕒𝕕 𝕥𝕙𝕚𝕤 𝕓𝕠𝕠𝕜! 𝕀𝕥’𝕤 𝕤𝕠 𝕓𝕖𝕒𝕦𝕥𝕚𝕗𝕦𝕝𝕝𝕪 𝕨𝕣𝕚𝕥𝕥𝕖𝕟, 𝕚𝕥𝕤 𝕚𝕟𝕥𝕖𝕟𝕤𝕖 𝕒𝕟𝕕 𝕡𝕠𝕨𝕖𝕣𝕗𝕦𝕝. 𝕀 𝕜𝕖𝕡𝕥 𝕘𝕠𝕚𝕟𝕘 𝕓𝕒𝕔𝕜 𝕥𝕠 𝕥𝕙𝕖 𝕡𝕒𝕣𝕥𝕤 𝕀 𝕙𝕚𝕘𝕙𝕝𝕚𝕘𝕙𝕥𝕖𝕕 𝕨𝕙𝕚𝕝𝕖 𝕤𝕥𝕚𝕝𝕝 𝕣𝕖𝕒𝕕𝕚𝕟𝕘 𝕥𝕙𝕖 𝕓𝕠𝕠𝕜.", "images": [], "asin": "1727613244", "parent_asin": "1727613244", "user_id": "AFMAAFGNKTARLBMEMVEHAUG2X7TQ", "timestamp": 1656321508582, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "VAI MUSIC THEORY", "text": "ANOTHER VIEW OF MUSIC THEORY THAT I ENJOYED. ALWAYS LOOKING FOR NEW LEARNING MATERIAL.", "images": [], "asin": "1540030997", "parent_asin": "1540030997", "user_id": "AEBOR6P6SPJNM2ZDLYUVWUMS2G2Q", "timestamp": 1561000614143, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Thank you for the great playscript", "images": [], "asin": "0822223937", "parent_asin": "0822223937", "user_id": "AGJKLP3H2YYO4I3EFMAXM3LCHH7A", "timestamp": 1445043746000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Transported", "text": "The farther I got in to this book, the more I liked it, and two days after finishing it, it is still on my mind. It fulfilled my strongest desire for a reading experience: to be transported to another time and place. The first part, chronicling Sidonie's pre-Morocco experiences of disease and loss, was difficult reading, because it was hard to watch someone having such a miserable life (although the author made it completely believable). But, once she got to Morocco, the story really turned around for me. The author did a great job of depicting the country, and I felt that I was there with Sidonie. The characters were interesting and well developed. From a travel standpoint, it was great: the very atmospheric back alleys of Marrakesh in 1930 and the landscape beyond the cities, with the nomadic Tuaregs. But it was also fascinating to watch Sidonie's development from a sheltered, repressed individual to one with growing confidence and a real sense of being where she was meant to be. This was almost as much of a story as the more obvious plot line. I look forward to reading other books by this author.", "images": [], "asin": "B005OTKTAS", "parent_asin": "B005OTKTAS", "user_id": "AE62QUYVHK2QT6IKEL4IJYB7GNBA", "timestamp": 1352231244000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "the Littles in pictures", "text": "It is wonderful for children to see the world of the Littles in visual detail.  They delight in studying the pictures of the rooms and the maps of the areas.  A nice adjunct to the texts.", "images": [], "asin": "0590313940", "parent_asin": "0590313940", "user_id": "AFT6NFGP7TAF7AVBUPWHLDH6S3ZA", "timestamp": 1208976766000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A wonderful rhyming children's book involving technology", "text": "I teach technology at a public school to Kindergarten through 8th grade students.  There are unfortunately very few children's books involving the topic of technology that are interesting to younger students.  This book is one of the best according to my Kindergarteners and 1st graders.<br /><br />Some of the language in the story is a bit challenging for such young students, but the rhyming/sing-songy flow of the book makes it very understandable overall.  I would definitely read this book aloud to 2nd or 3rd grade classrooms as well.", "images": [], "asin": "0142408573", "parent_asin": "0142408573", "user_id": "AELDREZM4TO3RLZWTN3S7Y6LJZOA", "timestamp": 1321200267000, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The best book I ever read.", "text": "One of the best book I ever read. This book is completely a life changer and I feel every one should own and has to read this book.", "images": [], "asin": "0812997794", "parent_asin": "0812997794", "user_id": "AH4PNXF42UJBAFCUKKXCM4DYLECQ", "timestamp": 1475195679000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Honest, intelligent and detailed", "text": "This open and honest account of Kerry’s Experiences in politics, war and foreign service is interesting and eye opening. I learned so much about the way in which the world works as I read about negotiations with foreign powers, the workings of the senate and the war in Vietnam and the protest. Kerry is an exceptional leader and dedicated public servant. I also appreciated his personal sharing of faith. It was so helpful to hear. I do regret that he lost the presidency to Bush because I think his leadership would have provided a bonding glue this country needed.", "images": [], "asin": "1501178954", "parent_asin": "1501178954", "user_id": "AGNWXAZ5V6YR2YUZEOPGW64R2RDA", "timestamp": 1549157354298, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "This is one of the author's best novels. The surface story is easy to like ...", "text": "This is one of the author's best novels.  The surface story is easy to like and may seem very light but structurally this is a very complex work.  Like  Garcia Marquez's other novels, it can be read on more than one level, and lends itself to analysis and interpretation.", "images": [], "asin": "0307475352", "parent_asin": "0307475352", "user_id": "AECDTWT2LBNDUUOSU6FTVQO4YAUA", "timestamp": 1464634477000, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "Another disappointing effort", "text": "I should have known better, after reading Shaara's previous book on the First World War, which I thought was a mediocre volume. After reading his latest effort, I must say that I likely won't waste my time reading another of his books. I applaud him for writing a book about this campaign, but it is again painfully obvious that he has limited writing skills, a poor grasp of character development, a lack of technical knowledge regarding weapons, army organization, etc., and a real ignorance of militaries other than the United States. As other reviewers have stated, the few battle scenes are poorly drawn, and unexciting, he makes numerous technical errors, and the fictional protangists in particular are unconvincing. Another reviewer mentioned the removal of Jewish American POWS, by black trench-coated Gestapo agents, in Tunisia, in May. Never happened, and this was the final straw for me. I will admit that I expect an author to know his subject, especially when it comes to historical topics. If Bernard Cornwall, Patrick O'Brien, W.E.B. Griffith,C.S. Forrester, etc., etc. can do it, why not Shaara? It amazes me that so many people rave about this book, and his earlier efforts. He apparently has a well-oiled publishing machine, and he sells books, so the bottom line is that we can expect more of the same, but I doubt any any better effort will result.", "images": [], "asin": "034546141X", "parent_asin": "034546141X", "user_id": "AF7AZIBT4NRX4HPXIN7B5NVF4FLQ", "timestamp": 1167425302000, "helpful_vote": 16, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Great Book", "text": "This book was assigned by my Grad Instructor and it has really helped me grasp the world of Assessments.  Thank you.", "images": [], "asin": "013117990X", "parent_asin": "013117990X", "user_id": "AHMPRXICDHN6W63ZUOLAQALZXOEA", "timestamp": 1204564819000, "helpful_vote": 4, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Readers join the family and experience a war and a love story", "text": "It doesn't take one long to feel like a member of the family, as this enrapturing love story, war story, and an inside look at our &#34;Greatest Generation&#34;<br />A remarkable job of taking exhaustive research and then making the story read live a novel.  I was so glad the author included the last chapters that revealed his passion for the story and the truth by making numerous trips to Great Britain and Germany to piece the story together.  As I stated,I felt like a member of the family who had the privilege to be able to observe the lives of so many of my &#34;relatives,&#34; including the author.  Well done, J. Ross Greene, well done.", "images": [], "asin": "1512262307", "parent_asin": "1512262307", "user_id": "AG4Y2IXFBQGEAUFUGUKDMAJVTT6Q", "timestamp": 1473451213000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Great Book - condition not great", "text": "The book is amazing ... I wish the book condition was detailed better.", "images": [], "asin": "059063142X", "parent_asin": "059063142X", "user_id": "AHSRJF64KPQ4NJYFCZKI735HZJUA", "timestamp": 1544268570281, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Mary Fons does it again!", "text": "Love it !", "images": [], "asin": "1607058626", "parent_asin": "1607058626", "user_id": "AFI62U7C5BAKJBYY2YIIKAVYVXUQ", "timestamp": 1405643674000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Great little book, nice read.", "images": [], "asin": "1591847850", "parent_asin": "1591847850", "user_id": "AHXDTPJW6GNHEHAY6ZVM7WHDFKFQ", "timestamp": 1523254781137, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Good Reading", "text": "Great book and good read.", "images": [], "asin": "0802482279", "parent_asin": "0802482279", "user_id": "AEDN6AJS7XSZLYDSG6UVPZCC2ZYA", "timestamp": 1459131711000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great", "text": "A real history about Cuba and a fake democratic regimen, corruption and the a decadent society,  This it my first reading from Amir Valle and it is really great! Good surprise.", "images": [], "asin": "B00B7OGXEU", "parent_asin": "B00B7OGXEU", "user_id": "AHRHSBHMPDF4D6NS4IJBOSWSJJPQ", "timestamp": 1363139902000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great comprehensive history", "text": "In terms of format, this book is almost like a textbook of Byzantine history. Each chapter has a clear purpose and a mini-timeline, differences in text size and shape mark off the sections and subsections, and there are even inserts every few pages with primary sources. This actually helped me mentally organize the details of what was happening - there's a lot to keep track of in 12 centuries!<br /><br />A few elements that I really liked:<br />1) Graphic Organizers and Visuals. The author occasionally made use of graphic organizers - for example, representing the hierarchy of Byzantine governments with a table, or showing the decline in value of the nomismata in the 11th century. In addition, rather than banishing the images to an appendix, the author actually integrates them into the relevant sections of the text. It's a pleasant surprise to find a historian who actually appreciates the value of a good illustration to, you know, illustrate history.<br /><br />2) Breadth. This is a broad history - the focus is not just on the emperors or on Constantinople, but on the Empire as a whole. I appreciate that the author takes the time to explore social and economic trends, art, literature, and ordinary life.<br /><br />3) Historiography. The author cites other scholars, and also talks about both debates and shifts in understanding. The best example was his take on the Blues vs. Greens fights of the 5th-6th centuries. According to the author, while older scholars often tried to impose a religious, class, or political ideology on these fights, it's better to view the Blues and Greens as the Late Antiquity version of football hooligans who liked to riot. As a non-expert, it's actually helpful for me to understand how scholarship has changed.<br /><br />4) The last chapter is about post-Byzantine Byzantine culture. Most Byzantine histories that I read use the last chapter to eulogize the fallen empire. In contrast, this author actually explores what happened to Byzantine culture after the Ottoman conquest. I appreciate that the author acknowledges that the Greeks, Armenians, and Slavs didn't just magically stop practicing their culture after 1453.<br /><br />Great general history, would recommend it to anyone new to the Byzantine fandom.", "images": [], "asin": "0631235132", "parent_asin": "0631235132", "user_id": "AHTBPY6EI6JIOCLQZFQNQKWTX2FA", "timestamp": 1558924827500, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Insight", "text": "Susanna Kaysen gave a very well detail description of her struggle and livelyhood as a mental patient in a ward and her perspective of the world", "images": [], "asin": "0679746048", "parent_asin": "0679746048", "user_id": "AFT2XGJ6OO7LZTGQCGYVLGUNZUIA", "timestamp": 1367423781000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A great summer read.", "text": "This is not a book that I would normally choose. I enjoyed it thoroughly and learned about WWII, and the Philippines.", "images": [], "asin": "B07JW54QCW", "parent_asin": "B07JW54QCW", "user_id": "AEINX4ZX6T3TXIEXWMTX5CAF3JNA", "timestamp": 1563990693345, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Great story that starts out slow", "text": "Fantastic story that is a little hard to get started but well worth the read. It feels like there’s a little lost in translation but it’s good", "images": [], "asin": "B07GN6DL2Y", "parent_asin": "B07GN6DL2Y", "user_id": "AFKKDOGSU56BIJGQBG3OVLJF2DLQ", "timestamp": 1555322744994, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Loved the format and writing was amazing", "text": "Outstanding read. Loved the format and writing was amazing. Can't wait for the next book from this author.", "images": [], "asin": "1517583004", "parent_asin": "1517583004", "user_id": "AFDIJEWVRV3LEEB4TUDTOZ5EFRTA", "timestamp": 1449110616000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Read about microsprinkers!", "text": "This volume highlights the most compatible native plants for California gardens. Lots of color pictures and outstanding advice regarding how to care for native plants.  I particularly like the idea of micro-sprinklers instead of all that ugly black irrigation lines.", "images": [], "asin": "1604697091", "parent_asin": "1604697091", "user_id": "AE4VNAWOJGRRHWQSM53NRS5SEVHQ", "timestamp": 1466990485000, "helpful_vote": 15, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Loved this small town romance!", "text": "I'm so happy I discovered this! The abs definitely drew me in, but the story was sweet and fun and kept me entertained. The main characters Mia and Nate have so much in common and I was pushing for them to be together from the start. Both were a bit isolated from other people and needed someone who understood what they were going through. They also bond over their love of Mia's grandmother, who may be one of the best gran's ever!<br /><br />Mia is a bit all over the place emotionally. She's just decided to quit her job at her dad's law firm and her parents do not take it well. They're incredibly selfish people and I was glad that Mia distanced herself from them. Her grandmother is great and encourages her to pursue other interests, including getting her with Nate. Nate is a retired doctor from L.A., now living in a small town. He's interested in Mia immediately and I loved watching them get closer.<br /><br />There are a couple sad moments in this, but overall it's a fun story about doing what you're passionate about and not holding back. I'll definitely be checking out other books from this author!<br /><br />I received a copy of this book from NetGalley in exchange for an honest review.", "images": [], "asin": "1952121124", "parent_asin": "1952121124", "user_id": "AH3XATQYVLAE4QIDBXF5EKPQ4BAQ", "timestamp": 1611764187604, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Dark, violent, and fascinating", "text": "I'm kind of torn about how to rate this. I almost want to rate it 5 stars because it was such a good story, but there were quite a few times were I felt that it went a bit too far w/ the violence. Now, I don't particularly mind dark or violent themed books, I usually enjoy them, but I want it to make sense and not just to be there for shock value which I kind of felt happened throughout this book. It sort of went from being reminiscent of Harry Potter to suddenly becoming like one of those Saw movies!<br /><br />Still, I will absolutely, without doubt be continuing this series.", "images": [], "asin": "B00IMO7V1M", "parent_asin": "B00IMO7V1M", "user_id": "AEA5IAZYWC4BWJNXGJTQISXEIW3A", "timestamp": 1414964713000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Wonderful book full of imagination!  Illustrations are so lovely.", "text": "This book and accompanying coloring book was such a huge hit for my sister's grand daughter. She loved that she was able to read the book all by herself and stopped on several pages to talk about each unicorn and which was her favorite.  She decided to color the pages \"just like the pictures in the book\" because they were so beautiful.  Great book for spending time just imagining these beautiful creatures and talking about what makes each one unique!", "images": [], "asin": "B09XZVKQQL", "parent_asin": "B09XZVKQQL", "user_id": "AHZPSLN46MKRAYS4EDHNEMOK77YA", "timestamp": 1651339342399, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Very interesting", "text": "Can't imagine going through what S. Cahalan experienced, but was fascinated all the way through this one.  Given the subject matter, it was interesting how readable Cahalan was able to make this one.  I enjoyed it very much.", "images": [], "asin": "B007EDOKZW", "parent_asin": "B007EDOKZW", "user_id": "AEKH2XMAO4B67GAH2AUGPMDI6BPA", "timestamp": 1365349114000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "informative reading", "text": "I purchased this book for my nephew who just graduated from the Marine boot camp on Parris Island. He love the picture illistrations and details.", "images": [], "asin": "076031697X", "parent_asin": "076031697X", "user_id": "AHFB2Z7WXYIEDKYGTRGDIAP45LWA", "timestamp": 1389272663000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Teen loved it.", "text": "Teen loved it!", "images": [], "asin": "0521618762", "parent_asin": "0521618762", "user_id": "AFBHVKVZZMIZGXXHWYJSB757EHQQ", "timestamp": 1446788529000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Didnt see that coming", "text": "My....what a whirlwind of action. This being the last book in this series is bittersweet, but it went out with a bang.<br />All of my favorites are back. I love Denise so I'm glad she jad a big role in here. Ian is awesome as ever. The big surprise plot twist I didnt expect. I liked it. I thought it was a satisifing end to a great series.  So much to say bit I dont want to spoil it for everyone else.", "images": [], "asin": "0062076116", "parent_asin": "0062076116", "user_id": "AEHDBJOHAEF25PAVBTVK5MBABEYQ", "timestamp": 1391888739000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "some cute ideas", "text": "It has some cute ideas. Nothing you of course can't think of on your own, but I put them in a fishbowl and have the kids pick onef they need an idea. It was cheap enough and I did not have to create it myself.", "images": [], "asin": "1575429446", "parent_asin": "1575429446", "user_id": "AG4W5XLKQ5NR52ID44UPWX3CFTBQ", "timestamp": 1366062651000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 3.0, "title": "Undercurrents ,''The truth behind stepmothers''", "text": "Underurrents,<br />This story is about a girl named Nickie and her family. One day they were<br />walking in the mountans in a small city in Europe.And just as they were<br />walking their mom fell, and later go sick . soon after she died,their dad<br />brought home a new wife,her name was crystal.Nickie felt realy confused<br />about the hole thing,and wanted to know why her dad didn`t love her mom<br />anymore.Nickie`s sister Bonnie applied to go to a University and got in.<br />Nickie tryed her hardest to keep her sister from leaving,but it didnt stop<br />her.Soon after she left Crystal moved in,and Nickie kinda felt sorry for<br />her because her dad pushed Crystal around alot.Little by little Nickie<br />started to like her stepmother and getting use to her ways.Crystal`s<br />great aunt died and left her a house on the beach.Nickie`s father was<br />looking forward to getting the house,But this made Crystal uneasy.Nickie`s<br />father was plaining a trip up their to check it out.Nickie was very<br />intrested in why Crystal didn`t want to go,Nickie thought,maybe something<br />bad happend to her their.Who knows your just going to have to read it for<br />yourself.I RECOMMEND YOU DO!!", "images": [], "asin": "0689859945", "parent_asin": "0689859945", "user_id": "AEKA54HVW5LJXGD2VFPL7ILQB43A", "timestamp": 1197991696000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Excellent", "text": "I bought this for our grandson who lives in New York City and loves to go to the museums and especially likes this painting.  He loved it!", "images": [], "asin": "1563977362", "parent_asin": "1563977362", "user_id": "AFJ6J7WYCHUR26LMHL55EH53LTRQ", "timestamp": 1377375094000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 5.0, "title": "Where I worked", "text": "Twenty years I worked for Woodies  . Found that my uncle, Harry Ashby de Butts was on the Board of Directors.", "images": [], "asin": "1258362074", "parent_asin": "1258362074", "user_id": "AEWRFYBO7S2CQJHDB5H4MDES2CXA", "timestamp": 1582322706249, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Nearly flawless!", "text": "4.5/5<br /><br />This was a pretty dang good story. It had mystery and suspense and horror. Some of it corporeal and some of it ethereal. There are many moments here where I envisioned a movie with jump scares and a booming soundtrack, and I found that super cool. I had to suspend my disbelief and go with the action as it unfolds and that was a little bit of a bummer. In the end I was satisfied.", "images": [], "asin": "B084G9KFDF", "parent_asin": "B084G9KFDF", "user_id": "AHWJ7XO77DKZJROC6KUZWI3I2QGQ", "timestamp": 1601980627051, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Beautiful flowers!", "text": "Beautiful photos of flowers to greet you each day.", "images": [], "asin": "0761188657", "parent_asin": "0761188657", "user_id": "AGXOMHMIL4Z4LNX5MP3NC5QFIORQ", "timestamp": 1485629745000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Awesome!", "text": "A great start to a Great series!!!", "images": [], "asin": "B000WH7PLS", "parent_asin": "B000WH7PLS", "user_id": "AGZGM7CTNIEBTOKG3RJQ3NQQU6PQ", "timestamp": 1480900616000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Daughter loved it!", "images": [], "asin": "0439929865", "parent_asin": "0439929865", "user_id": "AENT66X4JEF3PSJ4JMF4HBNUMMOA", "timestamp": 1465932003000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Beautiful pics.", "text": "Beautiful pictures of people in private moments. Good quality. I read tthis book in exchange for my rewview.", "images": [], "asin": "1542787289", "parent_asin": "1542787289", "user_id": "AGDGHRZZPAEBT5G2ODEC4VD6DEEA", "timestamp": 1491434264000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 4.0, "title": "Sexy pageturner with my favorite trope!", "text": "Let’s start with the main characters – Georgie and Travis. They both grew so much over the course of this story, which I lived for. Not only them, there were also side characters showing obvious signs of growth. Any author capable of doing that deserves an extra star in my book!<br />When it comes to Georgie, I specifically loved seeing her go from being and feeling the “little sister” towards being her own woman, standing up for herself and fighting for what she wants. Seeing that evolution was wonderful.<br /><br />As mentioned in the triggers, there are quite a few explicit sex scenes in this book. I didn’t mind them at all – but I know some people don’t care for that type of thing. All in all, I found them well written – apart from all the dirty talk. I’m simply.. not that kind of person so I wouldn’t have mind had that aspect not been present, haha.<br /><br />In my intro, I mentioned the renovating company being one of the things that piqued my interest. It wasn’t that present, but it was there enough for me to be satisfied. As for the fake relationship-trope? I loved how it was done! Not every author is able to pull it off, but I enjoyed seeing Georgie and Travis struggle with their feelings, doubting the realness of their fake relationship and eventually having to admit to themselves what was going on. Yup, definitely my cup of tea!<br /><br />I only have ONE but:<br /><br />Travis, our other main character, definitely had his own demons to fight. Unfortunately, the story focused way more on Georgie’s growth, struggle and evolution than it did on his. I would’ve loved to have more insight in his past, his brain and his feelings. It would have added so much more to the story!<br /><br />4 / 5!<br /><br />I cannot wait to read the sequel - which focuses on two characters present in this one: Dominic and Rosie. So curious to find out their story!", "images": [], "asin": "0062872834", "parent_asin": "0062872834", "user_id": "AFJMMY33DXJAP6352C6SYE4N6JUA", "timestamp": 1560357169662, "helpful_vote": 0, "verified_purchase": false}
{"label": -1, "rating": 1.0, "title": "One Star", "text": "I didn't like the book. I would like to return it.", "images": [], "asin": "1593376235", "parent_asin": "1593376235", "user_id": "AGIDVUZ6XCFL544SP3PWPX2T5JXA", "timestamp": 1481682199000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great read", "text": "So amazing to get an insight in all the struggle that went in to making the band a success.  RIP Chester", "images": [], "asin": "1682619672", "parent_asin": "1682619672", "user_id": "AGV3637BDLVHNJ3MMSQ3NAGWW7NQ", "timestamp": 1623785716126, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "I was not disappointed.", "text": "After reading book one, I knew I would read book two.  I was not disappointed.", "images": [], "asin": "B0074VTH70", "parent_asin": "B0074VTH70", "user_id": "AGF6HJLFRYJUMG3ZP4HVGIPJXS6Q", "timestamp": 1462579152000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1 , "rating": 4.0, "title": "I think the most enjoyable thing of this novel was the ending", "text": "This review has been crossposted from my blog at The Cosy Dragon.com. Please head there for more in-depth reviews by me, which appear on a timely schedule.<br /><br />'Skeleton Key' is the third book in this series about Alex Rider, a teenage spy. Alex is sent on an expensive holiday to Skeleton Key in Cuba. Well, it's supposed to be a holiday, but really he's there to do his job - nuclear war is coming. Hit the jump for more...<br /><br />Alex is given the opportunity to see tennis live at Wimbledon. However, instead of the interesting time he expected to have, he uncovers a sinister plot by the Triad. He heads off on a surfing holiday with his budding girlfriend Serena, but is followed there by the Triad. MI6 says that they will put him out of harm's way by sending him on a tropical vacation. What could go wrong? Everything in fact.<br /><br />I think the most enjoyable thing of this novel was the ending, seeing Alex push through the terrors he had been through to become a better person on the other side. In this novel you can really see him grow up, and start taking an interest in girls. Horowitz has managed to take a series that could become quite stale with the same character and same spy elements and make it continue to develop.<br /><br />This novel is more bloody than the first two novels (in the same way that the Harry Potter series became more adult as it progressed). I'd still say that children could read it, but not those with impressionable minds or those who were likely to be scared. If they enjoyed the first two novels, this is certainly not too much of a step forward.", "images": [], "asin": "0142406147", "parent_asin": "0142406147", "user_id": "AEQMNJF7DPAPKF43TPUAKQ367G7Q", "timestamp": 1425612911000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "The strength of this book is its focus on the life stories of individual civil servants.", "text": "It does not neglect the big picture, and provides extensive description of Trump's transition team (which he had to be forced to accept.) But it is the tales of the several civil servants, gleaned from interviews, that I found most compelling.  With the help of reporters like Jenny Hopkinson of Politico and Rachael Bale of National Geographic, Lewis show us how dedicated professionals like Elizabeth Sherwood-Randall, Frank Klotz, Cathie Woteki, DJ Patil, Lillian Salerno, and John MacWilliams were frustrated by the Trump appointees who came in late to their departments, neither knowing or caring much about the jobs they were taking on but filled with loyalty to Trump and set on monetizing such vital functions as weather forecasting.<br /><br />This book is an excellent complement to name-filled chronologies like Russian Roulette, and I consider it a must read.", "images": [], "asin": "1324002646", "parent_asin": "1324002646", "user_id": "AE3TLMWBR3DDVER6IPRUKPDXCXHQ", "timestamp": 1545257142804, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "I Will Never Forget is Enlightening and Inspiring!", "text": "Elaine C. Pereira's captivating memoir, I Will Never Forget is a moving book written with a gentle and humorous tone describing her mother's journey through dementia. The author helps us to understand the frightening and awkward aspects of dementia. I would consider the book,  I Will Never Forget, a comforting companion for caregivers coping with dementia. It is also a beautiful study and response to her mother's life. Truly Inspiring and Enlightening!", "images": [], "asin": "1475906900", "parent_asin": "1475906900", "user_id": "AFXU7EN6UQCOUWJFRP5WOAGTDBPQ", "timestamp": 1426380854000, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A Sympathetic Vampire Assassin", "text": "This novel is the gentlest of Ms. Kroese's fantasies and my personal favorite thus far.  The story contains elements of the hard-hearted hero who loves puppies and kittens and the hooker with the heart of gold woven into a tale of violence, destruction, magic, and love.  The social issues evident in the fantasy correlate easily with many of today's headlines. Ms. Kroese's choice to have dual narrators takes a little time to grasp on beginning the novel, but works well in presenting two points of view.", "images": [], "asin": "B08C98YVQQ", "parent_asin": "B08C98YVQQ", "user_id": "AHEC4VIEFDLSHXWRQVILA25GZSVQ", "timestamp": 1597615397773, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Suggested to me by other Francophiles like me!", "text": "Loved the read.", "images": [], "asin": "1592400388", "parent_asin": "1592400388", "user_id": "AERQHFEZO6YEOBJAXYGDQWUBSN7Q", "timestamp": 1506451969920, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "a good read", "text": "Picked this up one afternoon and put it down only to perform life’s necessities. A bit too long, but a good story arc and satisfying conclusion", "images": [], "asin": "B004IEAATA", "parent_asin": "B004IEAATA", "user_id": "AE5PCZOFEA34HUR4RDEP7UIM5FXA", "timestamp": 1643218093478, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Great Deal!", "text": "Great Deal for the price compared to hard bound journals. All the fields are accounted for, lifhtweight. Love it!", "images": [], "asin": "1499378904", "parent_asin": "1499378904", "user_id": "AEE2VTDQRRVDMDWDFAIP3VJOWEJQ", "timestamp": 1457157961000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "He said he enjoyed the book", "text": "This was for my son. He said he enjoyed the book. Fast shipping!", "images": [], "asin": "037584631X", "parent_asin": "037584631X", "user_id": "AFP3LUU5FUU6JTGYRWWKDMUGWGBA", "timestamp": 1491113325000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "A must read!", "text": "Best book I've read in quite some time. As soon as I finished it, I wanted to read it again. The story is written with a compelling narrative pull and complex characters who are both memorable and admirable. I was fascinated with each individual character's story which ultimately blended to be a very rich novel indeed. I didn't want it to end.", "images": [], "asin": "B00P434ELO", "parent_asin": "B00P434ELO", "user_id": "AFPRB3NAYUFG4QFXGJBAPFFNI6GQ", "timestamp": 1440448095000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Interesting Follow-Up", "text": "Well, this sure did start one place and go somewhere no one could have ever seen coming.<br />In this follow-up to the Cinderella story, the stepsisters are followed in the aftermath of what happened after the night they tried to hack their feet up to fit in the slipper that Cinderella rightfully owned. It starts with them having to deal with an entire town of people snickering and mocking them for being \"ugly\" and terrible people for what they did to poor Ella. They locked her up and made her a servant to them,etc (you know the story). So, people charge them more for less and they run low on money so bad things happen.<br />The story really focuses on one stepsister though both are part of the whole story. Isabelle is the main character and the one that longs the most to be beautiful because she feels that to be beautiful is all it takes to get what you want in the world. Like Ella. So when she meets a \"fairy god mother\" of sorts that's what she says she wants the most so when she is told she needs to do somethings before her wish can be granted, she sets out to do them.On the other side she has \"fate\" and \"chance\" betting on her. Each comes into play as a person in her life. How they play their part is for you to find out.<br />So much is going on and happening in this book, I'm not even touching the surface. This book is packed full of story. It has some 'girl power' themes running through it that are really good with some strong messages for young and old alike. It has so many good things going for it! If I were to say anything negative at all it would be that I have to admit at one or two points I got pulled out of the story a little bit. I'm not sure if there was just so much going on it got distracting or if at a few points there was a lull that just stalled it? Either way, it picked back up and got real good again!<br />All in all this is an interesting take on what happened after Cinderella left in the carriage to wed her prince.", "images": [], "asin": "1338268465", "parent_asin": "1338268465", "user_id": "AHWCZ47A7FIYEJ7KEJG3BO3F5YXQ", "timestamp": 1563031194903, "helpful_vote": 1, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "well  worth the read", "text": "Gripping", "images": [], "asin": "B083J7QQ89", "parent_asin": "B083J7QQ89", "user_id": "AGCIFKZZ4EDOUKROBXCKL3VW7C7Q", "timestamp": 1605725205401, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Four Stars", "text": "my daughter's love it.", "images": [], "asin": "1609589165", "parent_asin": "1609589165", "user_id": "AH5TREMYGA6YQJM2IH5Y3Q3NZPOA", "timestamp": 1462430416000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Must read for beginners", "text": "Great beginner book for those of us that aren't familiar with a lot of the terminology associated with stock market investing. Able to read most investing books now without getting lost.", "images": [], "asin": "1945051868", "parent_asin": "1945051868", "user_id": "AEZBVDY27CF7FJ7KSI32LYZ5QINA", "timestamp": 1567892770489, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Best cookbook I've found!", "text": "Have yet to cook anything from this cookbook that I haven't received multiple compliments... I bought my son one for Thanksgiving and while visiting him I had a chance to use the pecan pie recipe. I was so impressed I order myself one!", "images": [], "asin": "0960941606", "parent_asin": "0960941606", "user_id": "AGA3WPQTJW2YBCWSWTXGTSBW6XUQ", "timestamp": 1550902185404, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Use this influential framework from the mind of an analyst strategist", "text": "Great book about how to influence the enhancement and protection of our democracy by framing and clarifying issues clearly.  Short, clear, easy to follow.  Jam packed with useful info. You will be more influential by reading it. And you will have the framework to become expert!", "images": [], "asin": "159594561X", "parent_asin": "159594561X", "user_id": "AGZXELYJLYNFZHK7DEOL46URL3OA", "timestamp": 1496811662000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Excellent, excellent!", "text": "Great suspense and great romance! It was hard to put this book down. Can't wait to read another Sandra Brown book!", "images": [], "asin": "B00HQ2N52K", "parent_asin": "B00HQ2N52K", "user_id": "AF64JJMGPHTIBXGJHBI6QSM2MUZQ", "timestamp": 1423415368000, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Perfect.", "images": [], "asin": "1622024044", "parent_asin": "1622024044", "user_id": "AGWELQYRZUDS3QF7BDKH2N7OMX7A", "timestamp": 1491084930000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The Perpetual Reference and Guide", "text": "I'm still trying to decide how to describe this book. It strives to be a classic textbook in a great many areas and succeeds quite well. I feel as though I'm in a textile school and using a professional text when studying this book. By submerging yourself in the information you will become very well informed and, through practice, skilled in several areas of needlework. Included here is information on every aspect of basic stitchery and then some. You are introduced through picture and charts to materials, frames, hoops, notions and various floss', pearl cottons, blending filament, silks, wools and threads in great detail. Then specific stitches, not just cross stitch, but many others that may be used individually or with cross stitch are introduced.(The photography and charting is excellent, showing some of the best detail work I've yet seen.) And you go on to exercises that develop skill in that particular technique or material or both with the use of a motif. There is information on creating patterns, working with computer design, reproducing designs from pictures, using mirrors to graph corners, reverse designs, central themes and borders. There is even a section on blocking. Much more is included in this book than I could record here. This is really a compendium. As was stated by another reviewer, this is not a book of motifs or independent projects and it doesn't pretend to be one. It is the sort of refrence book that will be looked at often.", "images": [], "asin": "0762416645", "parent_asin": "0762416645", "user_id": "AEHHNT6RNQGTOSMR34LZUNVKGYDA", "timestamp": 1267594069000, "helpful_vote": 8, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Master ful. book", "text": "Enthralling made the reader see these people as human tragic as sell as faux beautifully written i will fead.ore by this author", "images": [], "asin": "B00X2F109A", "parent_asin": "B00X2F109A", "user_id": "AFS6V6XCDAPPJLVWWEXWDC4AYTNQ", "timestamp": 1529397278713, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Therapy", "text": "This is my favorite book of all time.  Whenever I need a laugh, I take this out and read it….again.  My husband and I know parts of it by heart and use phrases from this book as shorthand to describe events around us or some activity we intend to pursue.  The illustrations are like old friends because I've seen them so many times.  You can show me a drawing from this book and I will know what story it illustrates, what action is taking place, and sometimes I can give you the caption verbatim.  The reason I bought this book at this time was that my paperback copy is falling apart and I thought it was high time I had a hardback copy for safety's sake.<br /><br />I will comment that the printing in this particular edition is blurry in several places.", "images": [], "asin": "0848807715", "parent_asin": "0848807715", "user_id": "AGVMGRRHZTGRYOQQLDOZAUMIFBSA", "timestamp": 1395079773000, "helpful_vote": 6, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Balm to my introverted mama soul", "text": "I am only a little ways into this book so far but I have laughed, cried, and just breathed such a great sigh of relief! Someone finally gets me and I am not crazy! I am introverted. It has been a balm to my mama soul and I highly recommend it to encourage the heart of any introverted mama out there.", "images": [], "asin": "0310354978", "parent_asin": "0310354978", "user_id": "AE5MIVXQ5GTNGWJO353NHZSP47JQ", "timestamp": 1558099836009, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Ponti exhibition", "text": "This is the catalog of the exhibition about Ponti that took place at MAD Paris in 2019. A very comprehensive book dedicated to this mid-century design master. Good info and pics.", "images": [], "asin": "8836641253", "parent_asin": "8836641253", "user_id": "AFAVJSP2OT3KOOVVHGB7L2YZX3UA", "timestamp": 1596858418356, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Fun exercises~", "text": "I give this to my kid when we have a long car trip and she loves it. Keeps her occupied for hours!", "images": [], "asin": "1641240342", "parent_asin": "1641240342", "user_id": "AHW77VJ7G7HNIWQORUZS3VPDW2EA", "timestamp": 1568040159083, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "If you can't stand the Smoke, get out of my kitchen", "text": "Wonderful book - very humorous.  Will keep you laughing.  We all need laughter in our lives and this one book and others by Martha Bolton will bring that laughter.  Great seller and would deal with again in the future.", "images": [], "asin": "0834113619", "parent_asin": "0834113619", "user_id": "AEJDGL3ELGG3KYGNIJ6OMUUX7W7A", "timestamp": 1320192864000, "helpful_vote": 3, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Love it", "text": "Fun, playful, and yet deeply & thoughtfully crafted from cover to cover. Wonderful for all ages with a message everyone must hear.  A heart warming read - perfect for a frosty and often frenzied season!", "images": [], "asin": "B00PCWYMFK", "parent_asin": "B00PCWYMFK", "user_id": "AGJA7F5PA3NZYDLBQSTHMQNRJ7NA", "timestamp": 1416037483000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Absorbing account of Korean war battles", "text": "This is the latest in the author's series of  books which attempt to look at war through the eyes of participants on both sides.  The accounts of the battles during the U. S. forces' retreat from the Yalu River are particularly well done with vivid and detailed descriptions of the intense action.", "images": [], "asin": "0578370352", "parent_asin": "0578370352", "user_id": "AFQ6JYSCIGS4PBMGS6C3F3NLBVLQ", "timestamp": 1649904982477, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Superb guide for becoming emotionally intelligent", "text": "Charles Stanley has put together a superb guide to unraveling the truth about our emotions and lies about the same. In a day and age when emotions seem to be out of control frequently for so many people, this book is a necessity. If only someone taught young people how to handle their emotions and deal with them successfully, we would not hear about the violent tragedies which have come to be part of our daily lives. This book helps do just that. It has helped me tremendously. I also found great help in a book by Lin Tomasso which I recently downloaded to my laptop. It's called Prayer Warrior: How to Get Your Prayers Answered. I paid $2.99 for it at smashwords.com. You can download it to your computer or any device, nothing special needed. The author is straight forward and funny, and will have you laughing at her real life experiences-she puts on no airs. Thanks to her book, I learned how to pray correctly. There's a formula for prayer which actually produces results, so if you're going to pray, you'd might as well do it right. I'm seeing positive results now since I corrected my former errors. I highly recommend both books, and I want to say again that Lin Tomasso's Prayer Warrior: How to Get Your Prayers Answered at smashwords.com will truly help you get your prayers answered so I’m spreading the word so that others can receive the benefits I have. I believe both these books will help every reader.", "images": [], "asin": "1476752060", "parent_asin": "1476752060", "user_id": "AH2SFW532VBHSUWVP5BJF2QVBSCA", "timestamp": 1382489608000, "helpful_vote": 1, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "Mirrors are one of the few things that easily freak me out..", "text": "I received a free copy of Mirror Image from the publisher in return for an honest review.<br /><br />I was excited to make a start on Mirror Image because mirrors are one of the few things that easily freak me out. I was looking forwards to immersing myself in a story that had the potential to put me on edge, unfortunately, that didn't happen. It took me 4 days to read 325 pages, kinda says it all really.<br /><br />The book started off well but I soon found my attention wandering. I couldn't bring myself to care for any of the characters, they were flat and unappealing. The reasonings behind the characters actions were insubstantial, I felt like they were just going through the motions for the sake of the story. Where was the fear? The inner conflict? The panic? There was nothing of substance driving them, they came across as puppets playing out a story rather than real people living through the story.<br /><br />Throughout the book the reader is taken back and forth between several different timelines. The timelines reveal the history of the mirror, how it came to be, and the characters that have been a part of its story before the present timeline. For this format to work the different timelines need to come together, to flow into each other and build a bigger picture, a more in-depth understanding, but in this case they felt disjointed and too separate from one another. The ending felt rushed and thrown together. I think I was holding out hope that things would come together in the end and that it would at least be worth the reading time invested. It wasn't, it lead to even more disappointment<br /><br />There was also quite a few inconsistencies and plot holes, as well as many spelling mistakes, typos, wrong words etc, which really didn't help improve the reading experience.<br /><br />Not one I would recommend.", "images": [], "asin": "0765385228", "parent_asin": "0765385228", "user_id": "AHX7JX33DX2N2OZIHZ4TTDAXT3QA", "timestamp": 1472006075000, "helpful_vote": 2, "verified_purchase": false}
{"label": -1, "rating": 2.0, "title": "I was disappointed. These jokes were based upon UK humor", "text": "I was disappointed.  These jokes were based upon UK humor, and many of the jokes did not make sense to me, as I am<br />an American living in the U.S.A.  Sorry to say, this book was not a good choice for me.", "images": [], "asin": "1517775787", "parent_asin": "1517775787", "user_id": "AFIJUFDWVNRUFU5C73UPNVF3LJLQ", "timestamp": 1452285143000, "helpful_vote": 2, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "The Jerico Deception", "text": "The Jerico Deception is a pager turner. It has a clear quick movie like quality that takes you in completely.  The questions posed within the story line are timely and profound.  Character driven this read keeps you cheering for the science as well as the scientists.", "images": [], "asin": "B00BAHA0MK", "parent_asin": "B00BAHA0MK", "user_id": "AEJ6H3PJLVV4M2KIMGP56YD76PFA", "timestamp": 1368872798000, "helpful_vote": 2, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "When you run out of Narnia books, give this a shot", "text": "This is book five in a series of eight.  Imagine a Christian version of Indiana  Jones who travels the word with his two teenage kids having archeological adventures in the 1990's.<br /><br />This book is not the best in the series, and the series is not the best writing Peretti has ever done.  The plots, dialog, character development, and style in the five books I've read so far just aren't on par with some of the other books he has written.  That said, my 9 and 12 year old children love the series and I can be confident that each page is kid safe.  The stories may not have allegories and apologetical theory wrapped in every other sentence, but they have a sprinkle of scripture in good measure along with practical application of faith by each and every character that is believable.<br /><br />This particular book has an unexplained premise that really doesn't make a lot of sense even when you are open to a supernatural explanation.  The resolution also leaves a lot to be desired as it doesn't fit either into a good theologian's prayer book or a Scooby-Do scientific \"Man behind the curtain\" kind of explanation.  But like most of the books in this series, the plot allows for tension to build through the story that gives the author time to plant seeds of wisdom and faith.  And more importantly as I said before, my kids are no where near as critical as I am and truly loved it.  If you're looking for a series of Christian themed books for young adults, this series is pretty good.", "images": [], "asin": "B007FZOXXI", "parent_asin": "B007FZOXXI", "user_id": "AGM2PXNSFVORRU2ZBOR43FGTFBHQ", "timestamp": 1608580199276, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "A must-have for F-111 fans", "text": "I'd give this six stars if I could.  The research that went into compiling this book is incredible.  I have limited personal knowledge of some of the facts surrounding some of the losses described in the book because I was a crew chief on F-111Fs at RAF Lakenheath during the 1980s when we lost a handful of birds, but the \"official\" word on losses often didn't filter down to we maintenance troops so it's nice to now read the full accounts.  I wish the authors would compile more major mishap (non-loss) data for a second edition; I personally know of some major incidents (in-air collisions, speed-inflicted damage, etc.) that aren't reflected in the book's section on mishaps, and I'm just one former knuckle dragger -- I bet interviewing former aircrews and crew chiefs would reveal a ton of additional incidents.", "images": [], "asin": "0764342789", "parent_asin": "0764342789", "user_id": "AGEYOONM2KVZX3SBTULWHCT7C54A", "timestamp": 1390747988000, "helpful_vote": 5, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "Well done!", "images": [], "asin": "0316265829", "parent_asin": "0316265829", "user_id": "AG6VH7C3W5JNKRJUTARBWQWDPZBQ", "timestamp": 1459617593000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 4.0, "title": "Meh", "text": "Not my favorite one yet, but it wasn't awful. Just, meh. I'm losing faith in Jimmy... I realize that's harsh, but it's true.", "images": [], "asin": "B00FCQW6HW", "parent_asin": "B00FCQW6HW", "user_id": "AEXSTXMQROQVEM34EQAPXTUBNEQQ", "timestamp": 1679115617551, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "SciFi/Futurism", "text": "Excellent read that kept me on the edge of my chair the entire book. Lee’s prose flows well.", "images": [], "asin": "B005AJZRO0", "parent_asin": "B005AJZRO0", "user_id": "AHBR2CRA232MF622JTRMVDT2QFXQ", "timestamp": 1605467322302, "helpful_vote": 0, "verified_purchase": false}
{"label": 1, "rating": 5.0, "title": "One of my new favorites!!", "text": "Melanie has a way with words and making her books come to life and make you feel like you have known the characters all your life.<br />Tease was an excellent story about two friends who were both quirky in their own way. They understood each other and had some much love that they don’t want to admit.<br />Hutton, I felt so much for him, with his  anxiety and not being around a bunch of people. My son is the same way.<br />Felicity was amazing with him and they could both be themselves around each other<br />The side characters made the story as well! Hutton’s mom and the Prancin’ Grannies were hilarious!<br />I can’t wait to read about Millie’s story!", "images": [], "asin": "B0B4JQ52GD", "parent_asin": "B0B4JQ52GD", "user_id": "AETXK3U5UQK5QKWJCVH7LUVKWKMQ", "timestamp": 1657550218695, "helpful_vote": 1, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "Five Stars", "text": "really helpful book", "images": [], "asin": "0842382372", "parent_asin": "0842382372", "user_id": "AEMSWPBSKKZFREYBFEOVUCWX5DVQ", "timestamp": 1470602538000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 4.0, "title": "Would definitely purchase again.", "text": "I have enjoyed the book like how the main points are already highlighted for me.  It arrived on time and was very affordably price.", "images": [], "asin": "1591391903", "parent_asin": "1591391903", "user_id": "AETLTYU2BGIDCYM2MEBTGPW5ZTCA", "timestamp": 1376484391000, "helpful_vote": 0, "verified_purchase": true}
{"label": 1, "rating": 5.0, "title": "I have a number of mosaic books but can tell i like this one a lot too", "text": "Received quickly. I have a number of mosaic books but can tell i like this one a lot too.", "images": [], "asin": "1446301591", "parent_asin": "1446301591", "user_id": "AFNSCEBENIJT4QB33VZJK2Z73PGA", "timestamp": 1404447963000, "helpful_vote": 3, "verified_purchase": true}
