{"label": 0, "rating": 3.0, "title": "Mercenaries at Play", "text": "I went the distance and frankly wasn't much impressed. Overly long and populated with too many secondary characters, the tale features  Charlotte, whose cultured existence covers her secret life as fixer. For a fee, she provides information and identification for various and sundry mercenaries. Against her better judgment she  agrees to assist a hit man  who needs to break into a prison to complete a hit.<br /><br />Although the writing was crisp and the action scenes taut, the characters were stock and difficult to care about. Relative morality is a hard  sell and with murky motives and mutable loyalties, it is a challenge to remain engaged. Narrated by the major players, it has plenty of graphic violence. The plots were all somewhat familiar, i.e., breaking into prison, the brutal prison colony presented as a progressive program, the veneers of civility. I found the longing between Charlotte and the hit man unconvincing. It would have better had there been characters worthy of emotional investment. If you enjoy clever but familiar plot devices, strong action scenes and graphic violence you will probably enjoy this book. But if you are looking for characters with depth, keep looking.", "images": [], "asin": "0385536992", "parent_asin": "0385536992", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1409330473000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Cheap", "text": "This is very disappointing. The paper is thin newsprint-type paper. The backs are a dark-ish blue, not pink. Not that it would matter. The paper is too thin to write on. Every piece is TINY. Like Barbi-size pockets or envelopes.<br /><br />I'm returning it.", "images": [], "asin": "B09V3HNL4B", "parent_asin": "B09V3HNL4B", "user_id": "AE7REPEHHSBSBKY4MQNGL4MUXQNA", "timestamp": 1677212273472, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Tiresome", "text": "I read about 35% of this book and then checked to see if I could return it as it was just tiresome to me.  I wanted a mystery, I didn't want to know so much about everyone's feelings to the exclusion of the actual murder.  Oh Me!  I realize there are many fans and perhaps I should have tried an earlier book when Montalbano may have had less angst.  I was also excited about the possibility of seeing the videos of these stories.  The book cured me of this idea.", "images": [], "asin": "0143120131", "parent_asin": "0143120131", "user_id": "AG6GMS3CPDKDFX2AEPYUDMSTK4FA", "timestamp": 1368218603000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "One Star", "text": "No disk, no info on the web site, returned.", "images": [], "asin": "0071850171", "parent_asin": "0071850171", "user_id": "AGZKSWDHKSO7BURKY5MBAIPOY2PA", "timestamp": 1444044911000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Interesting read", "text": "An exciting read, other books, however, have &#34;caught my eye&#34; and focus with greater interest.", "images": [], "asin": "0316412694", "parent_asin": "0316412694", "user_id": "AESNIXKR5AZGQO55AJ2P4DRLENZA", "timestamp": 1532917602611, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Melissa & Carrie's part was interesting", "text": "\"The Price\" is a romance novel with a mystery. The romance was pretty typical: worries that could easily be put to rest if they simply asked about them came between the \"perfectly matched\" pair, Toni and Abe. The main \"whodunit\" was never in question, but Toni did question some people about a possible accomplice. Though the unknown accomplice was not obvious, anyone who reads a lot of mystery novels should have no trouble spotting the accomplice. However, Toni and the police--though getting close--were stumped until said accomplice decided to kill Toni for being nosy instead of sensibly going into hiding in another state.<br /><br />Anyway. The Christian general fiction aspect of the novel was very good. Teenager Melissa had to deal with why God would allow her best friend--who loves God and wanted to be a missionary--to be shot by a school shooter and paralyzed by the bullet, yet Melissa and others weren't even hurt. Melissa's friend and an elderly lady living with Toni and Melissa gave good, godly answers to her questions.<br /><br />Melissa's turmoil, struggle, and way of reacting to the people around her was realistic, and her best friend also struggled realistically with forgiving (or not) the boy who shot her. The other characters were complex but their actions sometimes didn't seem realistic to me.<br /><br />There was no sex or bad language. This book was the second in the series, and it thoroughly discussed the case and \"whodunit\" of the first novel. However, the first novel hit about every pet peeve I have, so I'd recommend you just start with this book if it sounds interesting to you.", "images": [], "asin": "0805425667", "parent_asin": "0805425667", "user_id": "AGRCXV4NM763VGZGD6BQ2VGNCJNA", "timestamp": 1290442811000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "very small print", "text": "Rick Steves provides so much information.  But the print is very small, and as a sight impaired person, I'll need something else when I travel.", "images": [], "asin": "163121053X", "parent_asin": "163121053X", "user_id": "AGW3NATH5YKXOD57OS65CVHC43HA", "timestamp": 1441661994000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "weak worldbuilding and characters", "text": "Breathe, by Sarah Crossan, is an unremarkable new entry in the teen dystopia field. Its premise is relatively simple:  in the far future, the world's oxygen level has dropped so far that people are relegated to living in oxygenated \"pods,\" where \"Premiums\" get all the oxygen they want and the commoners have to get by with far less. One result of this disparity is that the average person has to carefully moderate their physical activity (there are \"speeding\" laws with regard to walking) while the Premiums can go for a nice little job with their person oxygen tanks. The company that controls the oxygenating process, Breathe, controls the pod. It will come as no surprise that they're just a little corrupt and power-hungry.<br /><br />We're introduced to this world via three teen point-of-views. Alina is a commoner who is also a member of the resistance, a group trying to take down Breathe as well as break the monopoly of the pod's on human existence, both by long-term re-oxygenation of the atmosphere and by short-term retraining of people to enable them to survive in the outside. She's embittered and wide awake to the realities of this world, though not utterly aware of how far the resistance will go. Quinn is the son of a higher-up Premium and is being groomed to take his own place among the elites. Bea is his commoner best friend. Both have so far blithely accepted all they've been taught of their society's workings, though that will soon change once their paths intersect with Alina's. As one might expect, the seemingly inevitable triangle forms:  Bea wants to be with Quinn while Quinn, oblivious to Bea's desire, wants to be with Alina. Alina, meanwhile, just wants to be with the Resistance.<br /><br />As is usual with books I don't much care for, this will be a relatively quick review, as I don't like to belabor a book's flaws or bash an author who has at least accomplished completing a novel, even if it wasn't a very good one. To begin with, Breathe's plot is not particularly compelling or surprising. The three characters are introduced one after the other and then quickly end up outside the pod together. In short order they are facing off with Breathe's soldiers and running into the Resistance, though there was never any real sense of danger or urgency with regard to what might happen to them. Worse, many of the violent encounters felt a bit cartoonish and barely sketched in.<br /><br />The Worldbuilding is also pretty sketchy. I had a problem with the general premise as it was presented, and while there were occasional flashes of sharp details, mostly in the early sections, overall the setting and society never came alive as real constructs. The same is true of the characters, who do change but in pretty much wholly predictable fashion. None of the side characters, save one (an old woman whose been outside for some time), feel fully fleshed out, playing more as types or plot necessities than real people (one might get my pick for worst naming of the year, a villain named \"Cain Knavery\"). The prose is mostly pedestrian throughout, rarely rising above merely functional and at times its simplistic, repetitive nature was distractingly noticeable.<br /><br />Breathe ends with some resolution but with a clear path forward. I, however, will not be picking up book two, as for me, Breathe failed across the board: character, story, setting, style.", "images": [], "asin": "0062118692", "parent_asin": "0062118692", "user_id": "AEJIPQY4UD6ZS2ATZPPUSQYEVSQA", "timestamp": 1357577674000, "helpful_vote": 11, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It's really too outdated to be of use to me.", "images": [], "asin": "1907498001", "parent_asin": "1907498001", "user_id": "AFNVIXS7NZIHJ6C4TCGSACTQPI7A", "timestamp": 1448153813000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I love the illustrations.", "text": "The pictures in this book are bouncy, vivid - just delightful.<br /><br />The text, unfortunately...<br /><br />There's nothing wrong about it, or bad about it. It just is a very basic, very solid \"self-esteem is good\" book. Banal, bland... maybe a little boring.<br /><br />This is made all the worse by the artwork, which is so not boring and banal and bland that it shows up the words even worse.<br /><br />Oh well.", "images": [], "asin": "0152020136", "parent_asin": "0152020136", "user_id": "AF3B7N46YKJFHVZJWAKKCUIDO6HQ", "timestamp": 1238606736000, "helpful_vote": 7, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "More for Adults than Kids", "text": "This is an absolutely horrendous excuse for &#34;children's literature.&#34; It's the kind of &#34;kid's book&#34; written for the cynical eyes of an adult rather than for an imaginative child. Going on strike? Ultimatums? Terrible. The children's lit market is flooded with mediocrity like this. Grown-ups might get a &#34;cheap laugh,&#34; but I find it hard to believe any kid will want to read this again.", "images": [], "asin": "1442408898", "parent_asin": "1442408898", "user_id": "AH4SF64IHADWBJ2P6LSUGWS657FA", "timestamp": 1505240981252, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "I pad pro quide", "text": "Sent too many copies. Somewhat difficult to read if you are not tech savvy", "images": [], "asin": "B089M43VWK", "parent_asin": "B089M43VWK", "user_id": "AEKOSRWJOAFUEBC6XGF447R6NTFQ", "timestamp": 1630952001543, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Quite Amusing", "text": "\"historical acumen and political savvy\"<br /><br />Pure marketing.  Beck has neither acumen nor savvy.<br /><br />No one, especially Glenn Beck, needs to 'interpret' the Federalist Papers.  Beck is not in any position to do so.  He is not a history professor.  He is not a scholar.  He is not a federal judge.  He is a RADIO PERSONALITY.  In addition, he is a RIGHT WING radio personality.  That in itself makes him uniquely unqualified to tell anyone in the 21st century what the Founders had to say or what they meant or intended for the creation of the very first secular nation on this planet (and the first one with a written Constitution).  The Founders spoke for themselves.  Any interpretation of what they created (eg, the US) is done by the SCOTUS, not a voice on the radio named Glenn Beck.<br /><br />So, with all that in mind, I'll let you all in on a secret about Tom Paine, one of the Founders. He wrote a very scholarly book called The Age of Reason.  I highly recommend reading it.  It's very inexpensive.  It's available as an ebook.  It is one of the definitive works from one of the most intelligent Founders.  It's far more important than anything the self-aggrandizing Beck has to say or will ever say.", "images": [], "asin": "1451650612", "parent_asin": "1451650612", "user_id": "AH4SVVFGKFHEHAYZVOHBEZ3AKIFQ", "timestamp": 1331898075000, "helpful_vote": 8, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Not up to par", "text": "Fox and o'hare are too long on technical and not long enough on chemistry between Kate and ohare .  Don't get this one if you are wanting romance or at least chemistry.  Leaves you wanting", "images": [], "asin": "B017G7IVSW", "parent_asin": "B017G7IVSW", "user_id": "AE4T722JOW4GEKKCRNHZ6FAV3P6Q", "timestamp": 1481777162000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "The numbers don't line up to the image on the ...", "text": "The numbers don't line up to the image on the next page. If you have a young child, I don't think it reinforces the number to image concept very well.", "images": [], "asin": "1419704125", "parent_asin": "1419704125", "user_id": "AGRZH22OXKI4YYJSKXKXY7XJD5QQ", "timestamp": 1478130730000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Shrug", "text": "The author has a style that entices, but other than that, this was not that scarey--as the reviews on the back cover had me believe it would be--and the ending was foretold long, LONG before the reader got there.", "images": [], "asin": "1590200918", "parent_asin": "1590200918", "user_id": "AEALTL7SXNWI3N37UEYGUOHY6SPQ", "timestamp": 1224584273000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Not sturdy.", "text": "Pages frayed very easy. I have had it for two months and it’s barely holding together. Not a good find. Couldn’t stand up against a 15 month old.", "images": [], "asin": "0312514212", "parent_asin": "0312514212", "user_id": "AHEJFGNIFUTSHWTFUQ2ZI42X3I6Q", "timestamp": 1525675397110, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Cute", "text": "It was an ok read. The acceptance of witchy powers is just so casual. Powers are used immediately. Come on....where is that normal? The mystery was good, characters did develop well but things were just so unbelievable.", "images": [], "asin": "B01MSEO50P", "parent_asin": "B01MSEO50P", "user_id": "AER5CAFFZADVFTU6457GC45EKI4A", "timestamp": 1499999966688, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Nice cookbook", "text": "Her recipes are created with the home cook in mind. Easy ingredients and easy prep.", "images": [], "asin": "1400054346", "parent_asin": "1400054346", "user_id": "AH6Q6UWOADEFPSURZ4BVUNPBLTAQ", "timestamp": 1550069164547, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Fascinating topic, but dry and poorly organized", "text": "I am hesitant to post this review for fear of being accused of lack of intelligence (as has already happened to several reviewers here), but here goes.  I am surprised to find myself saying that I found this book dry and unreadable---I have a background in linguistics and history and a passion for the topic of language change.  But there was too much jumping back and forth across topics within chapters and too much rather dull historical minutiae.  As much as I wanted to take in the many gems within this book, it wasn't worth plodding through the dull majority of the text.", "images": [], "asin": "0060935723", "parent_asin": "0060935723", "user_id": "AEA2RDAQL5WA3YPAO74YNQ73VFRQ", "timestamp": 1308421225000, "helpful_vote": 14, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "No cassette, just the book.", "text": "Great book but did not come with the cassette!", "images": [], "asin": "1559942282", "parent_asin": "1559942282", "user_id": "AHDYM4WLDHWNAIPFLRIILCA2KBBQ", "timestamp": 1591053786163, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Made for TV", "text": "this book is broad in scoope and highlights the dangers of global criminal syndicates. It is scary in parts, pretentious in others. It is definitely made for tv. some of the coverage is superficial while some of it attempts to be scholarly. Not as much depth as i had hoped. still as the world grows smaller due to technology and travel opportunities grow for criminals as welel as the law abiding. would have liked to see more on  combatting thessed organizations. Not bad but not a must read.", "images": [], "asin": "0525564438", "parent_asin": "0525564438", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1543344435332, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "not so much disney", "text": "not really centered around disney...more like disney characters in elaborate scenes.", "images": [], "asin": "1449417140", "parent_asin": "1449417140", "user_id": "AG26GTWA7ELVYRJ3S5SHZA34BXHQ", "timestamp": 1545181419740, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It isn't terrible", "text": "It seems very rushed to end.  I think she was tired of writing them and just wanted to sum it up very fast.  I was disappointed...", "images": [], "asin": "B009NY43NY", "parent_asin": "B009NY43NY", "user_id": "AEFGUQ4PXDL5QJE3EI4PQQ2CZMLQ", "timestamp": 1370807768000, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Narrators is very inconsistent.", "text": "Story is great, of course, but the narrator of the audiobook is very inconsistent with how he pronounces character names. He's called Joffrey \"Jeffrey\" several times, Bran is occasionally \"Bryan\", and Catlyn's name is different pretty much every time he says it. A minor thing, but I found it annoying.", "images": [], "asin": "B0001DBI1Q", "parent_asin": "B0001DBI1Q", "user_id": "AFPKWFTU3W2DHVZQDSKFGVOZICGQ", "timestamp": 1556000771912, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Jay Z wasn’t even interviewed for this book", "text": "This book wasn’t actually written by Jay Z, meaning he wasn’t even interviewed for this book so it was just alright. I wouldn’t waste your money tho", "images": [], "asin": "1591848342", "parent_asin": "1591848342", "user_id": "AH7TTEIDWDZDTSEF4V47LMTK25EA", "timestamp": 1606707983574, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "First three were amazing so this one doesn't even compare", "text": "To many maps!  Kids wanted more activities.  First three were amazing so this one doesn't even compare.", "images": [], "asin": "0972860355", "parent_asin": "0972860355", "user_id": "AFR7PH6W3KFIMX2Y76P6PQHRIZ6A", "timestamp": 1407771448000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "It works.  But shouldn't it be more than that?", "text": "A bunch of standards in the genre.  You get the charts and the CD to play along with.  Sound good right?  Well play the songs and they sound stiff - esp for blues shuffle.  Play it a few times and you start to go insane.  The songs were rather lifeless.  I found it useful for two tunes I wanted to tighten up but otherwise there are better \"Play Along\" volumes or go back and just play along with Jimmy Reed himself.<br /><br />This feel like you're messing with the computer software \"Band In A Box\" except not as good.  (That product is available from Amazon.  Check it out.)", "images": [], "asin": "1423486692", "parent_asin": "1423486692", "user_id": "AEQFIGS5UJKWTXXLHOE4KJ32RYIA", "timestamp": 1306368458000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Give me just a little plausibility...please!", "text": "This review will have a couple spoilers so ALERT! So...this officer of the law who's deceased first wife (from suicide) falls in love with a VICTIM of a crime who has a bullet in her head and has amnesia! ARE. YOU. SERIOUS!?!?! This one was just too far out for me!", "images": [], "asin": "B07HHJKMNF", "parent_asin": "B07HHJKMNF", "user_id": "AGVZF4IY3WXPP6VKGT4VWTP5INUQ", "timestamp": 1547500841259, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Cute book", "text": "Cute but as an adult, kinda drives you crazy reading it over and over.", "images": [], "asin": "1442450703", "parent_asin": "1442450703", "user_id": "AH7NKTRQ6UFPK3JTTZYBVUURXQSQ", "timestamp": 1619719874449, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "This book was recommended to me by my doctor", "text": "This book was recommended to me by my doctor, to help me understand what my adult ADHD is all about. Like most of these books, there were helpful parts and not so helpful parts.<br /><br />That being said, it was nice to hear about other adults with this problem, and while the behavioral solutions were ones my doctor had previously recommended it always helps me to have things said multiple ways. I would recommend this book to people with a new diagnosis. I will be looking at more of Dr. Hallowell's books to find one that works better for me.", "images": [], "asin": "0307743152", "parent_asin": "0307743152", "user_id": "AFFLWMFIPE6WIXLANWFLJBCMHQEA", "timestamp": 1442244312000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "A little rudimentary.", "images": [], "asin": "0805097899", "parent_asin": "0805097899", "user_id": "AGWRHAU2MTM2X6OBFPCA3BJ3EH6Q", "timestamp": 1421541129000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "6 PAGES OF ERRATA!", "text": "Anyone buying this book needs to go to the Olive Knits website ( I am not allowed to post a link here) and download the errata correcting mistakes in ALL the patterns in this book. When I copied them into a Word document, there were SIX PAGES of corrections in all.<br /><br />It is very disappointing to buy an expensive book of patterns, only to discover they have not been tested and then edited for accuracy.<br /><br />I do not know if the errata is included in the current Kindle version.", "images": [], "asin": "1624147402", "parent_asin": "1624147402", "user_id": "AFPIRKJGGP23ZAF3CV77GJQYWBTA", "timestamp": 1673111568918, "helpful_vote": 11, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good, I guess, but not nearly as good as the original.", "text": "Again, the old story was so good!  Not sure why they had to mess with this version.", "images": [], "asin": "0769658687", "parent_asin": "0769658687", "user_id": "AEY6NV2HRRND6OBI67DVGCD4XIRQ", "timestamp": 1627585372622, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Disappointing", "text": "I was so disappointed after reading this book because it didn't solve one single issue I have with my three cats.  They were all introduced properly but yet one of them has a tendency to play fight with the other two but they're too laid back to play.  This book may be helpful if you have multiple cats who are very domineering but for the most part, I'd just get this book at the library and save your money.", "images": [], "asin": "0142004758", "parent_asin": "0142004758", "user_id": "AELHNTAU54MHMZWHKPD3DNMJJRRA", "timestamp": 1119396604000, "helpful_vote": 5, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Pretty good book and seemed to hold my interest", "images": [], "asin": "B003B02ON2", "parent_asin": "B003B02ON2", "user_id": "AG4IMHF2GGHSJU2FYZ7J3GQB4THA", "timestamp": 1470855111000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Written by a 5th grader", "text": "Don't waste your time or money on this \"book\" unless you enjoy mispellings and dull stories.  The book appears to have been written by a 5th grader...a slow 5th grader at that.  In addition, there must not have been an editor because the book is filled with mispellings and poor grammar.  A total waste of time and money.", "images": [], "asin": "B003Z9K59E", "parent_asin": "B003Z9K59E", "user_id": "AG3Z7GJY4YL7CHN77YF7NXS6CKJA", "timestamp": 1329793453000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Well written with great narration", "text": "A well-written and thought-provoking story, told in the epistolary style, with a solid command of character and world. 3.5 stars.", "images": [], "asin": "B09RQZVXHT", "parent_asin": "B09RQZVXHT", "user_id": "AFA25ISRNCAKMURYNDLKCO2I5WQQ", "timestamp": 1667591958555, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Not durable", "text": "This is the cutest book.  Sadly after reading it only a couple days and 2 of the pages pull outs broke.  My son is a toddler and this books intended audience.  He didn’t do anything out of the ordinary when reading it, but it doesn’t work :(", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/816oO+whJCL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/816oO+whJCL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/816oO+whJCL._SL256_.jpg"}], "asin": "1935703005", "parent_asin": "1935703005", "user_id": "AFP2LWTTE25DROI4KV6QIZDQXTNQ", "timestamp": 1524256925634, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not worth the time", "text": "Moved<br />Too slow. Not what I expected. Did not finish book try. Not sure I will. She is still a great actress", "images": [], "asin": "1451656297", "parent_asin": "1451656297", "user_id": "AE7EL5Y5QFWOM3BIHGJYX6SKOZKA", "timestamp": 1388885300000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Dull and way too long.", "text": "Not recommended because of poor writing, stilted dialogue and plodding pace. Uunlikeable main character is reckless to point of being unbelievable.  Painful to read.", "images": [], "asin": "B000FBFO5K", "parent_asin": "B000FBFO5K", "user_id": "AFC6ZUVCUOJCD2UOZITMJDNBJV2Q", "timestamp": 1549829741438, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Book arrived in poor condition", "text": "Dust jacket does not fit book and is covered in goo or residue from prior stickers or something. incredibly disappointed in the condition of the book as it is a gift.", "images": [], "asin": "067003178X", "parent_asin": "067003178X", "user_id": "AHKU3WJG7G6LV2M5K2IHJCCCC7GA", "timestamp": 1666542559078, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not ready for Prime Time but not totally useless", "text": "Aloha!<br />I'm using this Linux+ Practice Tests book to prepare for that exam and this book has some problems.<br />Technically, I have to hope it's accurate because who has time to do a fact-check on a book that's supposed to be authoritative? (I don't, and shouldn't have to.)<br /><br />Anyhow, view the image: You'll see two things:<br />1. There's no clickable link to hop from question to answer in a timely manner. This means you must flip through hundreds of pages to find the answers when a hot link to the answer is easily added to e-books.<br />2. Silly mistakes like the question has numbers next to answers but the answer section letters next to answers.<br /><br />Again, not totally useless because (hopefully) it's technically accurate but it's the formatting and practical use that makes the book almost not worth it.<br /><br />Maybe they'll address these two shortfalls so the book is more usable and less amateurish.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/51MAuN8etQL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/51MAuN8etQL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/51MAuN8etQL._SL256_.jpg"}], "asin": "B07T25SZ7C", "parent_asin": "B07T25SZ7C", "user_id": "AH6UMQKZIU7DVX7KELOMGTCVAEWA", "timestamp": 1603656990748, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not For Me", "text": "Oh well, nothing really held my interest in this story.  characters were flat and the plot was quite uninteresting, sorry to say.  I will not be purchasing any more books from this author.", "images": [], "asin": "0749080256", "parent_asin": "0749080256", "user_id": "AHYYNTUYOY643QKQNBOOZGNZSD6A", "timestamp": 1400679683000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "COMPACT INTO SMALLER SIZE BOOK FOR HOLDING", "text": "Good puzzles, but book too ackward to handle....", "images": [], "asin": "0997092947", "parent_asin": "0997092947", "user_id": "AFIGYBGOYRKRUJBTHSJ5LOQ2CEXQ", "timestamp": 1490166547000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "good", "text": "good", "images": [], "asin": "B004HO5VQI", "parent_asin": "B004HO5VQI", "user_id": "AEHTUOF3PKX6YUXFUGX545XUD4SQ", "timestamp": 1544465559615, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Size was deceiving", "text": "I bought this for a present. Have a copy myself. It looked to be the same size, but it was much smaller. Kept this one anyway for lack of time to replace before party.", "images": [], "asin": "0399226907", "parent_asin": "0399226907", "user_id": "AGWJJHXLW2WSK4NWME5KP6NVFH2Q", "timestamp": 1400078176000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "OK if user did not have Windows 8 to begin with.", "text": "This is really a revised version of the Windows 8 version. It does not address the differences between  the two which is what I bought it for. I already was familiar with Windows 8.", "images": [], "asin": "1118826248", "parent_asin": "1118826248", "user_id": "AEBJJCPIJNJK4VTXGPM7QOKNRXGQ", "timestamp": 1395907213000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Thinks inside the box", "text": "It is possible to read too much into a picture book.  A funny statement since what were talking about is literature for people who haven't even seen a decade of time pass them by.  But historically picture books have been places where prejudices are both intentionally and unintentionally on display.  Yet for every \"[[ASIN:1849393893 Denver]]\" by David McKee (a picture book about the beauty of trickle down economics) you'll find fifty people reading WAY too much into something like \"[[ASIN:1558584412 Rainbow Fish]]\" (communist propaganda) or \"[[ASIN:1442433701 Click, Clack, Moo]]\" (inculcating kids into unionism).  The thing is, picture books are meant to teach and inform our children.  Yet along the way a parent or gatekeeper might be worried about the unintentional messages getting pushed along the way.  At the end of the day you have to weigh your reactions carefully.  You can't be pointing fingers left and right, claiming authorial intent where there is none.  Okay.  So round about now you're trying to figure out what the heck any of this has to do with \"The Day the Crayons Quit\" by Drew Daywalt.  I mean, talk about an innocuous title.  Why am I going on and on about unintentional messages in works of children's fiction in preface to talking about this book?  Well, here's the trouble.  I have a major problem with this story and it's entirely possible that it's just in my own head.  So here's what I'm going to do.  I'm going to lay out the facts as they stand and you can judge for yourself whether or not this book does indeed make a major you-can't-do-that-in-the-21st-century mistake, or if I'm simply suffering from a case of Reading Too Much Into It.  Either way, it sure makes this Daywalt/Jeffers collaboration into an interesting point of discussion.<br /><br />Duncan's your average kid.  Not the kind of person who's going to expect that when he reaches for his crayons at school he is, instead, going to find himself with a bundle of letters.  Each letter is from a different crayon voicing their complaints.  Says gray, \"I know that elephants are gray but that's a lot of space to color in all by myself.\"  Or pink saying, \"Could you please use me sometime to color the occasional pink dinosaur or monster or cowboy?\"  Red and blue need a rest, white feels empty, yellow and orange both claim the sun, and all black ever wanted in life was, for once, to color in a rainbow or a beach ball.  By the end of the letters Duncan wants to make the crayons happy.  And that's when he comes up with the perfect solution to everybody's woes.<br /><br />Now let's talk crayon history for a bit.  This is fun.  In 1962 the U.S. Civil Rights Movement was underway.  America was going through big changes.  Assumptions that had lain dormant for years were finally getting challenged and even crayons were getting a double glance.  You see 1962 was the year that Crayola decided to officially change the crayon known as \"flesh\" to \"peach\".  You see where I am going with this, I suspect.  While white children certainly would use the color as flesh, it wasn't exactly on the up and up to assume that white was the de facto skin color.  Fast forward to 2013 and the publication of \"The Day the Crayons Quit\".  Peach does indeed make an appearance in this book and in that section complains vociferously that its wrapper has been removed.  \"Now I'm NAKED and too embarrassed to leave the crayon box.  I don't even have any underwear!\"  That Daywalt is linking peach to flesh again is no crime.  Interestingly, on the previous page the pink crayon has been making a very different complaint about never being allowed to draw cowboys or dinos or monsters.  The monster that it HAS drawn is covering its private parts, obviously believing itself to be naked as well, as the dinosaur points and laughs.  So.  Pink and peach are clearly equated with flesh tones.<br /><br />Then what's the deal with brown?<br /><br />There is only one vaguely brownish crayon in this book and it is the much maligned beige.  The official brown does not make an appearance it would seem.  Beige's sadness is the fact that while \"Brown gets all the bears, ponies and puppies . . . the only things I get are turkey dinners (if I'm lucky) and wheat.\"<br /><br />Mmm  hmm.<br /><br />This is precisely where the difficulty comes into play.  How much am I reading into this through my own prejudices?  Let me give you a bit of comparison.  This year is also seeing the publication of \"[[ASIN:076365714X The Black Rabbit]]\" by Philippa Leathers.  In that particular book a little white rabbit keeps seeing a \"scary\" big black rabbit that he runs away from.  The black rabbit is, in fact, the little rabbit's own shadow and at the end he comes to love the big black rabbit after all.  A librarian recently commented to me that it would have been far preferable if the little rabbit had been brown or some other color.  Otherwise you have a book where a white character fears a big black one.  At first I was inclined to agree, but after thinking about it I wasn't so sure.  After all, the white rabbit's fears are entirely in its own head.  There's also the fact that the book, I believe, is originally Australian, so the author wasn't working with a lot of the codes and keys common in American culture.  I was even reminded of the huge brouhaha surrounding \"[[ASIN:0060264950 The Rabbits' Wedding]]\" by Garth Williams.  In 1958 the Alabama state library system removed the book from circulation because it featured a black rabbit and a white rabbit getting married.  But sometimes a rabbit is just a rabbit.<br /><br />So is a crayon just a crayon?  I think the difference may lie in what a kid gets out of reading this book.  In the case of \"The Black Rabbit\", few kids are going to equate themselves with fluffy bunnies.  Even if they do, the black rabbit is ultimately the hero of the story.  There's a bit of a difference with crayons.  Kids are constantly coloring themselves and the people they love with the crayons they have on hand.  Crayola, knowing this, even released a brand of multicultural crayons of varying brown tones in response to the public's desire for that very product.  So to produce a book where pink and flesh are equated with skin tones and that possibility isn't even considered with beige or brown makes for a complicated reading.  It's an easy mistake to make if you're not thinking about it at first, but you would have thought that someone in the course of editing this thing might have brought the point up with Mr. Daywalt.  Heck, they might have brought it up with Jeffers too, since he's the one who came up with the naked monster picture in the first place.<br /><br />Getting away from brown, beige, and peach crayons entirely, let's look at the book in terms of its other merits.  When I was a kid I definitely ascribed personalities to inanimate objects.  Not just dolls and toys, oh no.  I could turn a game of War into a long drawn out romantic epic, thanks to the personalities ascribed to various playing cards.  And crayons were no exception.  Each one had a different part to play.  They dealt with jealousies and romances, the whole nine yards.  So in that frame of mind, \"The Day the Crayons Quit\" speaks to something very real.  Kids like to believe that the objects that they play with are as invested in the experience as the kids themselves.  So Daywalt has clearly found a unique but necessary niche.  If he follows the book up with a story of playing cards we'll know he's on the right track.<br /><br />This is also an epistolary picture book.  I don't know if Daywalt knows this, but a common assignment given by a variety of different elementary school teachers requires kids to read epistolary books (\"[[ASIN:0439206634 Dear Mrs. LaRue]]\", \"[[ASIN:0152061185 The Journey of Oliver K. Woodman]]\", etc.).  As such, \"The Day the Crayons Quit\" is no doubt destined to remain on multiple children's book lists for decades and decades to come.<br /><br />Which is a bit of a pity since the book itself is tailor made for an adult readership.  Sure, some kids are going to get a real kick out of it.  But as I read through the book I kept thinking that were it not for the art of Oliver Jeffers, this title would be a difficult read.  After all, it's pretty much all about the words.  Jeffers does what he can to give as much life and vitality as he can to the text, but there are twelve letters in here and around the orange and yellow crayons you'll be forgiven if your attention starts to wane.<br /><br />That's why the success of the book (and success it indeed is) can be ascribed primarily to its illustrator.  I began to notice that the childlike style of the art can really, believably be the style of a kid.  This is undoubtedly why Jeffers was picked for the project in the first place.  Aside from David Shannon it can be difficult to find artists that replicate children's art styles without coming off as half-cooked. Jeffers has also taken great pains to put in as many small clever details as possible, and it makes for a very rewarding rereading.  At first you wouldn't notice.  His Santa on a fire truck is straightforward.  The dragon accidentally burning a clump of grapes is cute but for me the book really picks up with (no surprise here) the moment when Jeffers gets to draw a penguin.  Even the paper he chooses for each crayon is interesting and significant.  Admittedly I was a little surprised that the purple crayon's letter wasn't written on lined paper (since it's such a stickler for staying inside the lines) while the gray crayon's was.  His faux coloring books are fun in and of themselves but it's the final picture that's worth it.  There are a lot of hat tips to the crayons' demands to be found here, from black rainbows to white cats.  I think the character of Duncan still totally forgot to pay heed to blue's request, but otherwise it's on the up and up.  You could even ignore that all the humans are drawn with pink or peach or white crayons, if you had half a mind to.<br /><br />That's sort of what makes the problems I have with the book such a bummer.  There's really good stuff going on here!  Oliver Jeffers is fun to watch no matter what he does and Daywalt has the makings of a fine author for kids.  The troubles come when you look at what the book is saying.  Fans of a certain stripe are sure to disregard my concerns with a wave of their hand.  \"She's reading WAY too much into this\", they might say.  Probably.  But it seems to me that you cannot write a book about crayons and mention peach and pink as naked without acknowledging that not every kid in the world thinks of those colors as a flesh tones.  I mean, that's just obvious.  Here's beige again: \"I am BEIGE and I am proud.\"  Beige power, eh?  Come on, little crayon.  Time for you to think outside the box.", "images": [], "asin": "0399255370", "parent_asin": "0399255370", "user_id": "AHF2B6SMLWPQ4RW7FFSHZ6YJBSCA", "timestamp": 1375642741000, "helpful_vote": 18, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Songs are outdated. If you are looking for something somewhat contemporary don't buy this.", "text": "These songs are so dated. I'm 59 and they predate me. If you are looking for songs from the last 50 years you won't find them here (Perhaps the odd one pops up). These are the dreary classics that kids learned to play the piano on 50 years ago. Let's move on.", "images": [], "asin": "0634062883", "parent_asin": "0634062883", "user_id": "AFLQE6NUP6ZPH6OFE25JBUL7DRPA", "timestamp": 1420328088000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "One Star", "text": "I got the wrong code", "images": [], "asin": "0134018613", "parent_asin": "0134018613", "user_id": "AGCQD27SG2SH7HA3UBQQ6INZ3IMQ", "timestamp": 1453937947000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not as good", "text": "Not as good a story as the other little blue truck books. Wouldn't buy it again. Only kept it because my son likes the animals", "images": [], "asin": "0544938097", "parent_asin": "0544938097", "user_id": "AFUJX644PWJGLMT4H7CEIQLQT4IA", "timestamp": 1661742113987, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "An o.k. read", "images": [], "asin": "042526744X", "parent_asin": "042526744X", "user_id": "AEKWHLL7FLFCQXPR3K2GAAHLA7TA", "timestamp": 1524282665416, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "An alternative", "text": "A book with wonderful photos is IN THE JORDAAN by Frank van Paridon.", "images": [], "asin": "9089895744", "parent_asin": "9089895744", "user_id": "AHLZ2NBJPNPFKFT5N4Z4WAT4F4RA", "timestamp": 1621351477082, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Buen Viaje---Audio Activies???", "text": "The workbook was in excellent condition but alittle misleading...when is states Workbook and Audio Activities---there was no CD or audio objects with the order.  So, now I'm on the hunt for the CD's in order to complete the class??  Help!", "images": [], "asin": "0078619521", "parent_asin": "0078619521", "user_id": "AHOB26MJN7K3ATZYX4GEMDDYJ3UQ", "timestamp": 1237221378000, "helpful_vote": 15, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Misses the mark", "text": "I love modst of the authors, but just couldnt finish the audio book.  Why?  It wasnt just the stories, it was the narrators.  I listened to all of the stories in &#34;Working For Bigfoot&#34; narrated by James Marsden and it was amazing.  Whoever was narrating the story in this one was just flat.  Uninteresting.  It was the same with the other stories.  I also found the soft porn rather distasteful.  There was no actual story I could mske out.  Just a title snd an excuse for graphic sex.  I like sex as much as the next girl, but it shouldnt be all there is.  Dotty, but this grouping just wasnt up to what I have come to expect from these authors or audible.", "images": [], "asin": "B0088UUBRQ", "parent_asin": "B0088UUBRQ", "user_id": "AEXNKISG6CLY3GPFJIJWY25VIJYA", "timestamp": 1474780580000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Not great", "text": "Didn't love this one. Story is kind of dumb. There are better books out there.", "images": [], "asin": "0525646132", "parent_asin": "0525646132", "user_id": "AHACUXUW7Y5IBQOCUXZDEGDTAO7A", "timestamp": 1626189249886, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Kinda plain....", "text": "The pictures seem kinda plain and not really exciting to color to me.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/C1TDIx9p2IS._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/C1TDIx9p2IS._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/C1TDIx9p2IS._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/C1dBwNmOyeS._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/C1dBwNmOyeS._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/C1dBwNmOyeS._SL256_.jpg"}], "asin": "1735933007", "parent_asin": "1735933007", "user_id": "AHHJ5NKA4KYJUR2WGG4KZDCNOZCQ", "timestamp": 1625384872052, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Only has more difficult problems", "text": "I have students at a wide variety of levels, and I was hoping this book would help me reach all of them, but it only has the harder levels.", "images": [], "asin": "0983444013", "parent_asin": "0983444013", "user_id": "AHXRPH43SNUXAJNRSP6SWFD3J6UA", "timestamp": 1364144192000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Love the series but", "text": "I love the series but my manga book had a target sticker on it that was not mentioned when buying it. Rather unhappy about that but it will do", "images": [], "asin": "197531137X", "parent_asin": "197531137X", "user_id": "AE6K66Y3EPGK34AVP7FKQ43TRO4Q", "timestamp": 1675129092685, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I've read better.", "text": "This is an ok Star Wars book.  I've read better.", "images": [], "asin": "0345544862", "parent_asin": "0345544862", "user_id": "AGTEJINEZT7UOGRSIGK4GP7IZKWA", "timestamp": 1471893405000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Nice pictures", "text": "I thought this book had complicated directions but I'll have another look at it<br />Not what I thought it would be, as there are no yardages for the one bed sized quilt.", "images": [], "asin": "0945169124", "parent_asin": "0945169124", "user_id": "AGCB3PY4ZQ4TPCODKN6FRCQVPRMA", "timestamp": 1548480386762, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Depressing and Slow", "text": "Due to the good reviews, I gave this book as a gift to my mother, which she returned to me after it was read.  After I read the book, and told her I didn't care for it, she admitted that she didn't enjoy it either.  I kept waiting for the story to improve, and it did slightly, but it wasn't worth my time, and don't recommend it to my friends.", "images": [], "asin": "1476738017", "parent_asin": "1476738017", "user_id": "AGFZUTBLIDE73ZMYVRUAYXP2757Q", "timestamp": 1505963677272, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I did not enjoy this book asmuch as the previous three", "text": "I did not enjoy this book asmuch as the previous three. If you take out all the histoical data you have a very short novel. Some good ideas but not expanded on. Also, did not like the ending. Strange cliff-hanger.", "images": [], "asin": "0345536746", "parent_asin": "0345536746", "user_id": "AFGFSCU3SYTZPZXYXTI54QESZKCQ", "timestamp": 1405364410000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Not in Spanish", "text": "Not in Spanish (misleading title). This used book was extremely old with brown looking pages. Ended up buying a brand new (Spanish version) book on Amazon.", "images": [], "asin": "0394915984", "parent_asin": "0394915984", "user_id": "AG5OSBTY5R4M3C3M5WUVGIPGCY6Q", "timestamp": 1607011013003, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Fifty Shades of Meaningless Sexalogue", "text": "I don't have much else to add, except that I bought this out of curiosity to see what makes a New York Times bestseller. Boy, was I disappointed!<br /><br />I actually read the first book, a couple of chapters of the second, then gave up. The writing is monotonous and repetitive, but if you can make it through all 3 books, all the power to you. I was very disappointed and disillusioned at what the US is putting at the top of it's bestsellers list. Why oh why did I buy the Trilogy?", "images": [], "asin": "034580404X", "parent_asin": "034580404X", "user_id": "AHKAIZHZC2MM6OANMNIU5HXHDHPA", "timestamp": 1356593962000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Well written book but a bit to dark and heavy for me.", "text": "Other reviewers have done an excellent job summarizing the story so I won't go through that.  What I will share is my reaction to the book both as I was reading it and after I finished.<br /><br />I will agree that the book is dark.  The subject matter is deep and heavy and the darkness and heaviness seemed to intensify as the story progressed.  One example of this is in the language choices of the main character, Sergeant DeMarco.  I'm not a cusser so I don't easily overlook the f-word.  It's not a throw-away word to me as it is to many people.  What I noticed is that DeMarco's language became more harsh as the story progressed.  I believe that one of DeMarco's co-workers even pointed that out in the story.  What that said to me was that author wanted to show that this one particular case was taking an unusually great toll on DeMarco.<br /><br />And that to me was really what this story was about.  One troubled person's (DeMarco) struggle with his inner demons and his struggle to deal with them.  It's a very sad story in many ways but not without hope and some resolution.<br /><br />One last thing I'd like to comment on was the author's writing style.  I need to mention that because I struggled with it through the entire time I read the book.  Many of the characters in the book are writers and professors of writing and this book certainly reflects that.  If you are a writer or a writing major of some sort I'm guessing you'll like and appreciate this book more than I did.  I am neither, so I suppose I just didn't get it.  The author is an excellent writer and knows how to turn a phrase and tell a compelling story.  But for some reason I felt like he overdid things, or perhaps tried too hard to use impressive phrases and words.  That, combined with the darkness of the story made it a difficult read.  There were a couple of nights that I was ready and wanting to do a reading binge on this book and just couldn't do it as I needed a break from the story.", "images": [], "asin": "1492639737", "parent_asin": "1492639737", "user_id": "AFWAC4NJFZ55V55ESCI65QLDZOSQ", "timestamp": 1490055677000, "helpful_vote": 5, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Making The Best Of A Bad Decision", "text": "Decisions! We have to make them every day... from the most mundane to those that help define our lives. Have you ever made a decision you regretted? Did you marry the wrong person? Have you made mistakes that hurt others? Perhaps you made a series of wrong choices and feel like it is too late to ever repair the damage. Can you turn those bad decisions around and make a positive change? Maybe you just think it is too late to start fresh or to make amends. You can get forgiveness from God and restore your relationship with Him, and there is always hope of restoring broken relationships with others. Whether it is one mistake or a lifetime habit of mistakes, you can move past your regrets and move forward.  Pastor and bestselling author Erwin Lutzer will show you how to make the best of even your worst decisions.<br /><br />This is a good book, but not a great book. Part of my slight disappointment may be because I feel like I have read these same examples time after time. On the other hand, it is not fair to fault Pastor Lutzer just because I have read many books. It is a honest appraisal of moving beyond the poor decisions, and accepting that there are consequences to face due to those decisions. He is very clear that forgiveness from God does not mean a complete do-over. For example, if you have robbed a bank and are truly repentant to both mankind and God, you are still most likely to spend time in prison. However, God will forgive you for being a thief. Lutzer's final chapter is based on the only truly bad decision you will make, and provides sound advice on how to make the correct decision. The brief discussion guide in the back can be used whether you study alone or with a group, and is most useful in reinforcing the lessons learned.<br /><br />I received a free copy of this book from Tyndale House Publishers  in exchange for this review.", "images": [], "asin": "1414311435", "parent_asin": "1414311435", "user_id": "AFH75OQDZOXFY2YB5YNDDWCQVXWQ", "timestamp": 1305747590000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Disappointed with selection of patterns", "text": "I bought this book because another reviewer said the patterns did not require large pieces of fabric and you could actually make the quilts from small scraps.  That is not true.  Several of the quilts require several yards of fabric, especially the ones with applique. You need several yards for the background. Also, I don't do applique, so right there we have several quilts I would not make.  There is also a quilt called Irish Chain which calls for several yards of green fabric.<br />In addition to the fabric requirements, I found most of the quilts to be ugly and not anything I would want to make.  But that's just my personal taste.<br />One thing I did like about the book is that it has a &#34;how to&#34; at the back.  It has some good information in it.<br />Overall, I was disappointed because I am looking for patterns that I can make using the scraps I already have.", "images": [], "asin": "0848714482", "parent_asin": "0848714482", "user_id": "AHHQBSQID4ANUGFO6ZI2LLRVBB6A", "timestamp": 1445505654000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "not very durable", "text": "I really love this book as a story but it only took my one-year-old a matter of an hour to rip several pages off the ringed binding. It is just not a practical way to make a book designed for young children, especially one that actively encourages a tactile experience with the pages. From now on I guess we will stick with board books.", "images": [], "asin": "0307120007", "parent_asin": "0307120007", "user_id": "AHJALGFL6RSUWIOA4AHUOTJLFGBQ", "timestamp": 1361512407000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Disappointed", "text": "Didn't know this was just a novel to read. Wanted a graphic novel.", "images": [], "asin": "1789093333", "parent_asin": "1789093333", "user_id": "AH2TZPJ2LUANTMDZ72I4ROFNXXHQ", "timestamp": 1590886475406, "helpful_vote": 7, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "If you aren't in debt...", "text": "This book is not for you.  It's great for those who are in debt, but we've always been pretty financially responsible.  I was thinking there would still be some great things here for me, but there's really not a whole lot to be gleaned from this book if you don't need help getting out of debt.", "images": [], "asin": "1595555277", "parent_asin": "1595555277", "user_id": "AHQAG7ATRW7YK5TUB2ZVQWWOXAMA", "timestamp": 1396012090000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Misleading Title", "text": "Disappointed. I'm new to airbrushing and was looking for a technique guide such as blending and shadowing. This is an introduction for new airbrush equipment purchasing, some maintenance tips, and tips on airbrushing guitars. Nothing you can't research online such as, the different types of spray guns i.e. single and dual feed, and equipment specifications. Many photos are black and white; many are grainy and look dated. It is a \"start from scratch\" setup guide. I'll look in my local hobby shop for an airbrush technique guide.", "images": [], "asin": "1453834680", "parent_asin": "1453834680", "user_id": "AHBZ6K4MEOYVTB5BONOOYRJ7ILBA", "timestamp": 1675624628088, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great concept but for the Portia interruptions", "text": "Not sure if book for have satisfied me or not, if it flowed without interruption...", "images": [], "asin": "0316452505", "parent_asin": "0316452505", "user_id": "AFAMI4EZY3F3AKG66IEYRSM7ONOA", "timestamp": 1594144806390, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Tiny print", "text": "I'm sure the book will be very interesting. However, the book has such tiny print it will take me forever to read it!", "images": [], "asin": "1781399115", "parent_asin": "1781399115", "user_id": "AFTGYXLXFI4EZDZTM72ET5PH4FCQ", "timestamp": 1524174001953, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "no video", "text": "I got the book but there is no video with the book nor a way to get to the online video either  I was just wondering if anyone knows how to get a dvd that was supposed to come with the book for that reason I give it a 0 as I can';t use it", "images": [], "asin": "0804841268", "parent_asin": "0804841268", "user_id": "AGUTROO5WASMMO77BXOVK6H6DYCA", "timestamp": 1669298449966, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "What a joke!", "text": "The only way I was able to read this was as a joke, out loud, to my mother, and drunk. It's so blatantly a Twilight fan fiction. Also, the character acts about 10 years younger than she actually is. She's about as knowledgeable about sex as a small child (for instance, she didn't know it was possible to have sex dreams). And yet she takes up a stranger's offer to be involved in BDSM? It's easy to tell the author has never involved herself in BDSM in the slightest, since she makes it seem like a game of total power control, which it's not. Grey's character is possessive and controlling. The erotic scenes made me laugh. You can find better things online written by people half her age. Don't waste your time if you expect good writing and dynamic characters. And, if you hate Twilight, don't touch it with a ten foot pole. You'll only find yourself angry and upset.", "images": [], "asin": "0345803485", "parent_asin": "0345803485", "user_id": "AGW4NNCYOR5NVX444YNC6VHIWBIA", "timestamp": 1356115801000, "helpful_vote": 4, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "A comparison picture is worth a thousand words", "text": "This product did not meet my expectations. My daughter is looking for a notebook that has both graphing paper and lined paper so that she is able to take notes in math class and also easily graph problems next to her notes. While it did have the dual purpose, the product unfortunately has an odd size to each type of paper. I am unsure whether she will be able to use this because the graphing paper is so different than what she is accustomed to.<br />This was not regular quad paper, nor was it college ruled notebook paper. I took a picture to show what the product looks like next to regular graph paper and normal college ruled paper. On the left of each picture is the product and on the right is regular paper.  I should have known that the 10x10 description was different, but I didn’t realize that it would be so different from regular quad paper which is 4x4.  I took a chance that quad paper would be the same, but it wasn’t. Also disappointed that the description does state “college ruled”, but that the product clearly is not.", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61T57+MdWNL._SL1600_.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61T57+MdWNL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61T57+MdWNL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71ZlIvxf4OL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71ZlIvxf4OL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71ZlIvxf4OL._SL256_.jpg"}], "asin": "1976067332", "parent_asin": "1976067332", "user_id": "AGRKROQ6DQX22R3S55XQJT6YYZPQ", "timestamp": 1563466094770, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "You Can Never Christianize the Occult", "text": "Another sad example of trying to make occultic material \"Christian\" and somehow, therefore, acceptable and less offensive to God Almighty. Wrong! The spirit of Harry Potter under any other name and any other religion is still the rebellious occultic spirit of Harry Potter, no matter how \"Christian\" you try to make it. That includes the works of C.S. Lewis and J.R.R. Tolkien. Evangelize the devil and he will still be the devil when all is said and done. Don't let this book deceive you if you are a Christian. The new age movement is sneaking into our churches through this kind of literature. It tries to make the dark occult world look innocent as if by adding scripture or a \"Christian\" theme changes it. It looks innocent on the surface or at a glance, but it isn't. Don't be deceived. Read what the Bible has to say about sorcery and the occult. God is very clear and serious about what He thinks of it. He never changes His mind on moral absolutes. Either Christians believe the Bible and take it for the literal Word of God that it is or they do not. I wouldn't wait until the judgment to find out if my faith and obedience to God is for real. \"Many shall say 'Lord, Lord' to Him, but He will not know them.\" Christians are to avoid the occult and any appearance of evil, no matter how nice it's made to look. If you don't agree, don't argue with me, argue with God. He's the one who said it.", "images": [], "asin": "0899571700", "parent_asin": "0899571700", "user_id": "AGXK325REZIXBVCTKEQLR7WOZ7AA", "timestamp": 1098836389000, "helpful_vote": 10, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Needs to be aimed at a different audience", "text": "I've read this author's books for years and eagerly grabbed this from a real world store. Disappointed I did. Page after page of sex abuse being excused as &#34;dominance&#34;. Never thought I'd skip sex scenes in a book but I'm at the stage I doubt I'll finish it and I'm 3/4 of the way through. Normally I read this author's books in a matter of hours. I've been struggling with this one for weeks hoping it would return to the writer I enjoyed if I just...kept...on.<br /><br />I knew going in that this author often has heroines that need &#34;protecting.&#34; Generally I put up with it for the stories. Right now I'm sick to my stomach from mentally watching a woman suck up abuse in the name of...mating? I can't call this love. Nor is this my sexual fantasy. Had this been marketed as that sort of book, I would have known to skip it.<br /><br />What happened to the paranormal romance? I loved the romance in earlier books by this author.<br /><br /> I know it's very hard work writing a book and it's harder to see your baby bashed. From the length, I figure the author feels passionately about these characters. I think this should have been marketed to people who enjoy women getting off on a cross of Leave It To Beaver housewives orgasm over kitchen stoves meets Deep Throat. I was not the audience for this one.<br /><br />I debated saying nothing. Authors change paths and get tired of series Or even genres. But mid series is not a good place to change voices on your readers. Please, please, please flag for your faithful when you decide to go a different direction.", "images": [], "asin": "051515556X", "parent_asin": "051515556X", "user_id": "AH5WRDOEUGKEGTYTQ6TSSRAVOQTQ", "timestamp": 1440539750000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Ideological, Cliché, Anecdotal, Weak", "text": "I have often read Thomas Sowell's columns and find his views interesting and well-reasoned. I regret that I cannot say that for this book.<br /><br />First of all, the book is primarily an ideological attack on schools in the US. The title suggests that Sowell has some inside view of the system, but he does not. He is not a public school teacher and never was. He is an Ivy-League-educated college professor of economics. He has no insight into the education system of the US. Instead, he has collected three sorts of evidence on which he bases his opinions. The first is statistical reports of various kinds, including those which show American children are outperformed by those in other countries in such areas as mathematics. The second are opinions from an unending stream of books condemning American education for its failures. The third is anecdotes.<br /><br />A good researcher would never rely on anecdotes. They prove nothing at all, and a selection of anecdotes may point to whatever conclusion the author has previously held and wishes to support.<br /><br />A good researcher would set aside the opinions of others, no matter how many might be found, as irrelevant to the facts at hand.<br /><br />A good researcher would be cautious about interpreting statistics. I know from personal experience (I taught in South Korea for eight years) that the amazing success of Korean students on international math exams is due to three factors -- none of which is the quality of public schools in Korea. The first is a culture that for 500 years has used a national exam to determine who would obtain the most coveted positions in the society. This has produced a system in which education is of little importance if it does not lead to high test scores -- and one in which cheating to obtain such scores is far too common. I have seen students who were barely able to speak or write a sentence in English score near the top on the SAT writing test by memorizing passages and learning how to arrange them to respond to a wide variety of questions -- trained by a private test-preparation professional. The second factor is the reliance of an estimated 75% of all students on a system of private businesses which are dedicated to test preparation. Students often spend five nights a week in private classes from 4 pm to 10 pm, and attend additional daytime classes during the vacations. The third is repeated testing which produces test-wise students and is enhanced by private coaching on test-taking methods and the use of countless sample exams.<br /><br />One of the statistics that Sowell relies on is a decline in SAT scores from the 1960s to the 1980s (he was writing in the early 1990s). What is often ignored is that the test changed during this period. So the actual measurement, which might have remained a constant had it been normed each year, but did not, ise a ruler that changed its length in an unpredictable way. It cannot be used to measure comparative performance. One might note that blacks and Hispanics did better during this period, whites did worse -- which might suggest that a shift in cultural bias may have occurred.<br /><br />Those unhappy with US public schools or US universities and colleges, and I am surely one, might be quite pleased with the anecdotes and the prestige of its author if they are willing to read uncritically. Neither will satisfy a critical reader.<br /><br />As for Sowell's prescription for curing the nation of its academic ills, he offers little. He does see the problems, which go far beyond the ideological concerns he expresses, but he has no real clue as to what can reasonably be done about them. Like the many other critics I have read, he has a birds-eye view and can do no more than leave his droppings on the heads of those below.", "images": [], "asin": "0029303303", "parent_asin": "0029303303", "user_id": "AE5FULT73C4657GJFZMSOFSBJKLQ", "timestamp": 1436847856000, "helpful_vote": 11, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Flawed by Factual Errors", "text": "It's hard to believe I first wrote this review almost ten years ago. Since then,  thanks to the miracle of the internet and in research for my own book (in which Grenada will take up a few chapters) of my military experiences, I've learned more about the operation from fellow veterans and Retired Marine Gunnery Sergeant Joe Muccia, who is researching his own book on the battle. In fairness to Major Adkins and the reader I believe I should update my review based on this new information.<br /><br />I've heard numerous times that this is the best book on Operation Urgent Fury, the U.S. led invasion of Grenada. If so, this makes me sad.<br /><br />As a participant of the operation (I was eating my wife's birthday cake when I received the alert notice to go) I bring an eyewitness perspective to many of the events the author describes.  I was a Sergeant assigned as a gunner to a howitzer section with Battery B, 1/320th FA (Airborne), 82nd Airborne Division.  We were part of the first battalion task force from the 82nd to deploy to the island.<br /><br />Most accounts of the battle have been flawed - most unable to even get the order of battle right. My unit is usually listed at Battery B, 2/325 Infantry - which in deployment was tactically true but wrong. Even though we deployed as part of Task Force 2/325, we were still for all intent and purposes B 1/320th. I do like what one 2/325 commander did when he presented us with a guidon calling us D Battery 2/325.  This may seem a minor detail but Truth is like a fine suit, if one thread comes loose, the entire garment can unravel. Others have either hyped the battle to the point of being a mini-Iwo Jima, or worse, demeaned it to the point of being a bad joke. I believe both points of view are both wrong - and unfair.<br /><br />So, having heard about Major Adkins' book on the subject, learning he had been there, and how good it was, I approached this work with some anticipation. There were many questions in my mind which have been unanswered, lo this past (has it really been that long?) twenty-four years; I longed for a good book with an overall point of view to make some of the things make sense. After all, I was a witness to these events, but I had a worm's eye view.<br /><br />And indeed, when I first opened Major Adkin's book I was satisfied. He paints a compelling story of the events leading up to the operation. We were never really briefed on the &#34;why&#34; of why we went, in our briefings. I was aware from our threat briefing that there was unrest on the island, the government had been overthrown, and there was concern for the safety of American students on the island. However, Adkins does an admirable job of filling in the gaps.<br /><br />I am grateful to Major Adkins for making a clear argument that the bombing in Beirut had little or nothing to do with Reagan's decision to go into Grenada. This has been much brought up by those who would love to tarnish Reagan's legacy as President.<br /><br />However, I am disturbed when Adkins describes actions in which I was a participant, and I find his description of events don't match my recollections. If I'm going to criticize hs work, it's only fair I back up my criticism with facts so let me bring up some cases in point:<br /><br />He does an excellent job in describing the confusion surrounding the deployment. My own detachment from my battery was &#34;stood up&#34; and then &#34;stood down&#34; several times before finally being given the &#34;go.&#34; We had even been in the process of putting on parachutes to jump in and then told to take them off and turn them in.<br /><br />When I finally did get the word we were going there was still confusion. In my pocket I had a Xeroxed tourist map of the island (which I now wish I had kept), as there were no military maps available. When I boarded my aircraft as senior man on board I was told we were going to Barbados to link up and organize with the rest of our unit before either jumping or airmobiling in to Grenada. Imagine my surprise when I landed on Grenada in the middle of sniper fire. That was Urgent Fury.<br /><br /> I begin to disagree with his account of the rescue of students at the Grand Anse campus. My battery fired the artillery prep for that mission. I have since learned there were airstrikes, but once again, he neglects the participation of the US Army Airborne Artillery just as he did when he either ignored, or was unaware of, the action of our 3rd Section Howitzer in providing pinpoint fire support for the action in taking the Cuban barracks. Our gunfire was used by the air assets to mark the target. Prior to our gun firing there had been genuine fear of hitting friendlies. Our third sections rounds provided the guide for the jets to hone in on. As at the Cuban barracks, throughout the battle there was a genuine fear of hitting the students or collateral damage, which we did our best to keep at a minimum. This would also explain his swipe at how &#34;slow&#34; we (the 82nd) moved. We were under orders to win the hearts and minds of the Grenadian people; you don't do it by blitzing urban areas and wiping out everything in your path. Frustrating for a soldier, but a political necessity. At Grand Anse the Ranger commander commended us on one of the best artillery preps he'd seen in his entire career. How could we do so well at Grand Anse and so poorly at Calvigny?<br /><br />His assertion we left our aiming circles behind when we deployed is not only untrue, but ludicrous. I don't know where he heard that from. As a gunner I was responsible for &#34;laying&#34; my piece for azimuth of fire. It was Division Standard Operating Procedure (SOP) for both battery commanders - and Executive Officers of  firing batteries to jump in with an Aiming Circle strapped to their legs if we jumped in. I personally saw our aiming circles on the island and used them to lay my piece and have several pictures  of our aiming circles and other aiming equipment on the island.<br /><br />So it was NOT because we on the guns or in the firing batteries failed  to bring proper fire support equipment. I have several pictures of our guns on the island that include our aiming devices and the M-2 aiming circle which was used to &#34;lay&#34; our battery for proper azimuth (direction) of fire. Even had we forgotten or lost our aiming circles or aiming points (collimators and aiming posts) 82nd Field Artillerymen were among the best trained in the Army (and certainly the best I worked with) we could have laid our guns by compass and used any stationary landmark as an aiming reference. (I don't mean to get too technical here, but trying to illustrate how ludicrous this charge is).<br /><br />Which brings us to the foul-up on the Calvigny Mission. At first I found it hard to believe we could have been allowed to expend so many rounds when we were missing the target - particularly after the commendations we received for the great job we did on that particular mission(!). There was an intense discussion with Joe Muccia and several of my fellow artillerymen, some of whom were officers during the battle and in a good position to know.  Joe had closely studied the after-action reports, and had previous discussions with others who were in a better position than I to know what went wrong (including the Fire Support Officer for the Rangers, who later became our battery commander). Further discussion with us led us to the conclusion that the designated targets and fire support plan had been submitted to our Fire Control Centers and they, in turn, created a good fire support plan for the operation. However, someone at the  top changed the data at the last minute which caused our rounds to miss the target. As the three firing batteries involved co-ordinated our fire together, if one was wrong we all were. On the guns, we could only fire the data given us as we could not see our targets. If our rounds missed the target it was because we were given the wrong targets. I will not name who we believe changed the targets and the why remains a mystery to me.<br /><br />The conclusion is, the foul-up was again in command and control, not on the troop level.<br /><br />So I have to agree with Major Adkins the operation was bureaucratic SNAFU at the top. However, he appears to relish every mistake made by the American high command while giving short shrift to the things done right at the bottom.  Perhaps I am overly sensitive to criticism after enduring years of it. But one must remember, we hadn't been to war in over ten years; many of the things learned in Vietnam were forgotten in the years of peace between. The military had just come out of at least four years neglect from 1977 -1981, morale had been low, readiness at an all-time low.<br /><br />As a former commander of the 82nd MG James Lindsay (who I wished had commanded us in Grenada) was fond of saying, &#34;We have eighteen hours to go to war. That's not a lot of time to get smarter, faster, or better - you go with what you got!&#34;  Unlike soldiers in most other wars, we didn't have time to learn from our mistakes. We went with what we had. Major Adkins attributes our victory to pure dumb luck. I've never been much of a believer in dumb luck. I discovered one makes his own luck, usually. I think the troopers and Marines on that island made ours.<br /><br />He appears to have an open disdain, even dislike for the troopers of the 82nd. He neglects to mention the two engineers from the 82nd who jumped in with the rangers and were instrumental in clearing the wreckage from the airstrip in a timely manner.  It is true, that at first, there was problem keeping the guys in proper uniforms. It was hot, we were, indeed, clothed in uniforms ill-suited for a tropical environment (you go with what you got), as an NCO I insisted that my troops at least keep their helmets and flak vests on and that they not have their M-16A1 any farther than arms' length from them at all times.  I believe most NCOs got the guys in line fairly quick. The &#34;magic&#34; helmet, which saved a trooper's life by stopping an AK bullet helped immensely. I never had a problem getting my guys to keep their helmets on after that was passed around.<br /><br /> He does mention the reason the marines were able to move so quickly on the island was the fact they met little or no opposition in the north, while we faced the brunt of the opposition and were moving through an urban environment with strict orders to limit collateral damage and civilian casualties. But we were moving. After Calvigny, the artillery's role was to &#34;lay&#34; on targets to be ready to fire if needed as the infantry would move into a new area and clear it.  When the area was declared &#34;safe&#34; we would adjust accordingly to the next area. We did this frequently. Someone was moving.<br /><br />I also believe the Marine's presence in the North, forming a vice or pincers-like movement did a great deal to reduce casualties by depriving any who had the idea of fleeing into the hills and jungle from having an avenue of escape.<br /><br />There is also some discussion as to the sheer numbers of troops sent to the island. I appreciate his explanation of the reason, though I don't remember him mentioning another real possibility that occurred to us on the island- the idea that Castro might have tried to reinforce his Grenadian allies. Remember, at the time we didn't know what the relationship between Castro and the Coard faction was, we were told by the Grenadian people that the Cubans had helped the PRA terrorize the people. I was told this personally by Grenadian citizens who were grateful we came.<br /><br />When our current leaders are being criticized for not sending enough troops to Iraq, pardon me if I scratch my head in confusion. The Iraq war is being criticized for taking too long and and causing too many casualties, Grenada is ridiculed because it was over too fast and didn't cause many casualties.  Where's the logic in that?<br /><br />His book, written in 1989, criticizes the Army people for wanting to eliminate every pocket of resistance instead of moving rapidly around them and driving on to the main objective. Reading the book in 2007, please excuse me if I find his criticism ironic because our operation in Iraq in 2003 is being criticized for the exact opposite reason: our troops bypassed pockets of resistance allowing them to melt into the landscape and organize a guerilla/terrorist resistance. Perhaps Iraq now proves our commanders on Grenada to be wise? But what do I know?  I'm just a cannon cocker.<br /><br />Also, the book, written and researched in 1989 could not have known the impact Grenada had on our training and doctrine. Glaring shortcomings, particularly in interservice communications and cooperation were shown. These were corrected in the mid to late 80s. My last assignment before being medically retired for a parachute injury from the Army was to work in XVIII Airborne Corps G-3, planning and operations section. The US military conducted numerous interservice exercises and operations and worked hard to correct the deficiencies evident in Grenada. I believe Grenada (and I have discovered since first writing this there are many experts who agree now) paved the way for later victories in Panama and the Persian Gulf.<br /><br />Grenada also served notice to our enemies that the U.S. would no longer cower in the shadow of Vietnam and that there would be no more easy victories for the communists. Remember, we were losing the Cold War in 1980. We'd won it by 1989. I believe Grenada and several other smaller, forgotten actions played a part in that victory. I do know that in 2003, on the twentieth anniversary of the battle, the US Army recognized the battle as the turning point in the Cold War. It was the only time a Communist government was removed by direct military action and it marked the end of Communist expansion during the era after a period in which no less than fifteen nations fell to communist revolutions or coups (1975 fall of Saigon and 1983 Grenada); the importance of the battle far outweighs the number of troops involved or casualties.<br /><br />So, having vented my spleen on this book, what is my final judgment? For the factual errors I have noted above, it is to be approached with care. If he was wrong on these things I know about, what other facts did he get wrong?<br /><br />It is written well, but as stated before, I believe the author appears to have a bias against US special operations troops, this is mentioned by another reviewer, so I was relieved it wasn't just my own sensitivities.  He appears to take great relish in describing the mistakes made by the American high command, while glossing over the things that were done right.<br /><br />If there was a problem with the SpecOps people in Grenada I don't believe it was with the troops - they (as were we all) were sent in with lousy intelligence and a minimum of planning. Perhaps, considering the circumstances, it was unavoidable. True, there was a lot that went wrong in that operation, but there was also a lot that went right. I was told at Bragg before leaving to expect a six month deployment ala the Dominican Republic. I was there ten days. I believe the book doesn't give enough credit to the guys on the ground who prevented the admitted SNAFU from becoming FUBAR.<br /><br />There are those who make snide comments about the &#34;12 hour war,&#34; or those who call the operation a joke. Well, it may not have lasted long, but our dead are still dead, and our maimed are still maimed. And the people of Grenada celebrate October 25, the anniversary of the invasion, as their Thanksgiving Day. I see nothing funny in that.<br /><br />It is sad that this is the best account of the battle to come forth thus far. I eagerly await the publication of Gunny Mooch's book.", "images": [], "asin": "0669207179", "parent_asin": "0669207179", "user_id": "AHRNC3EVCDH6DJAMHT7RNRNTPASA", "timestamp": 1174755855000, "helpful_vote": 57, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Stepping stone book.", "text": "Basic designs, minimal instructions, lots of practice pages but good as a starter book to leap to a more detailed book if interested in furthering knowledge.", "images": [], "asin": "1574219049", "parent_asin": "1574219049", "user_id": "AFLEUCSX2UYNZOT5LQLMAGKN2JCQ", "timestamp": 1438021572000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Missing info", "text": "I needed paper to study from instead is just electronic files but This is missing a lot of information.", "images": [], "asin": "0915777428", "parent_asin": "0915777428", "user_id": "AGTIS7O6G5STYPZPTJYXM7H37IXA", "timestamp": 1608058254194, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "WAS DISAPPOINTED!!", "text": "I have several books by Sherri and so I thought this one was going to be just as good if not better....WRONG!!!! This book looks like it was done by a three year old. It is horrible. The pages all look the same. There is not one page I would color in here. I have sat and look thru the book several times and nothing makes me stop to color.  I am so disappointed, this is by far not one of her good works. I am stuck with the book because it cost to send it back, I just might donate it. I would not recommend this coloring book at all!!!", "images": [], "asin": "194573177X", "parent_asin": "194573177X", "user_id": "AGW2UYVFY2JFMJYKQ6DAXSNUESUA", "timestamp": 1552607305008, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Where's the rest?", "text": "Is this all there is?  No story at all.  Where is the story? Definitely no his usual brilliance. Very disappointed.", "images": [], "asin": "B0B1KBX5T1", "parent_asin": "B0B1KBX5T1", "user_id": "AFTYPIHMAGINALLTDJ7YO4DH46GQ", "timestamp": 1669400031838, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Silly but worth the read", "text": "Weird and silly", "images": [{"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71t1L+2e7nL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71t1L+2e7nL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71t1L+2e7nL._SL256_.jpg"}, {"attachment_type": "IMAGE", "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71wX7PIQdjL.jpg", "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71wX7PIQdjL._SL800_.jpg", "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71wX7PIQdjL._SL256_.jpg"}], "asin": "1481451227", "parent_asin": "1481451227", "user_id": "AH25S6SJHXE3U2ZHSOQX2AUSFPSA", "timestamp": 1551563740751, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Borderline unreadable", "text": "I enjoyed the first book in the Hatching Series a lot and each subsequent book a little less. I appreciated the tight , punchy chapters and changes in point of view which reminded me of World War Z in a highly positive way. I wish I had found out the fate of every character but in the end the broader story was worth it.<br /><br />I say this because The Mansion is the exact opposite. It focuses on a very limited cast of characters in one primary setting. The first chapter was a long, painful, repetitive slog with verbose but uninspiring descriptions of roughing it in a cabin where software was being developed. Sometimes they didn't have electricity but somehow they invented something better than Alexa and better than Google. Ok. Sure.<br /><br />I feel guilty for reviewing something I am having a hard time finishing, but if I can save someone else from this, it's worth it.", "images": [], "asin": "150116550X", "parent_asin": "150116550X", "user_id": "AER7DPM4J7I62HV5TRGECMIPHRUQ", "timestamp": 1552751387467, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Dull in every imaginable way...", "text": "Well, that was a huge struggle.<br /><br />Okay, friends, I'm just going to go there...no beating around the bush.<br /><br />This story was dull in every imaginable way. I actually contemplated not finishing it--something I rarely do, but holy crap, the repetition. I'm read five percent on my Kindle...then give myself a pep talk to read five more. It was tedious.<br /><br />I will say this...the prose was lovely and Zoje Stage absolutely nailed the setting. I felt as though I was personally living in this old, rundown cabin in the middle of the Adirondacks. She perfectly captured the dark, foreboding environment, as well as the feelings of the characters as they adjusted to their new lives...<br /><br />...but that's where my happy thoughts end...<br /><br />Wonderland was horribly slow, painfully repetitive, and the conclusion was bizarre--but not in a good way. And don't even get me started on the character's names. If I have to read the children's names, Eleanor Queen and Tycho, one more time...I think I may scream.<br /><br />I loved Baby Teeth, and I've been eagerly anticipating Stage's sophomore offering for the past 2 years...but man, what a disappointment.<br /><br />1.5 stars", "images": [], "asin": "B07YSNQWTB", "parent_asin": "B07YSNQWTB", "user_id": "AGFHHZIEFIIXJZKWRCLKISPPFGWQ", "timestamp": 1595832130978, "helpful_vote": 4, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not as clear as I'd hoped", "text": "I had hoped this would be super easy and clear but I'd never heard of the game until I had my son. I want to introduce him early-he is 2 1/2- so I got the book and board but while the book said I'd have the basics in half an hour I was still unsure if I understood it correctly several hours in. It is getting clearer after going over it a few more times but I'll be getting another book in the hopes that it suits my learning style more.", "images": [], "asin": "4906574505", "parent_asin": "4906574505", "user_id": "AERREPPTN2X47QRQRQTWVN4TTSAQ", "timestamp": 1396536453000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Great...until the convoluted ending", "text": "I was totally into this book until the final few chapters. It was well-written and suspenseful; I was very invested in it and kept turning the pages to see what would happen.  But then it just went way over the top and became completely contrived and unbelievable. Nothing really made sense; motivations were explained just on the surface—no real depth. It all felt like a big let down. Too bad because it was off to such a promising start.", "images": [], "asin": "1912986728", "parent_asin": "1912986728", "user_id": "AEXMFAL3MFJGNMBCUN74D4NRXSDA", "timestamp": 1601223224704, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Want to be bored out of your skull? Try to read this.", "text": "It was drudgery to read this thing. Repetitive...the same thing over again, and again, and yet again. Time wasted.", "images": [], "asin": "B07G25WF21", "parent_asin": "B07G25WF21", "user_id": "AFG2DBV3JV5QMQKSTM2ZPL5AAVKA", "timestamp": 1553204657769, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Keystone Cops Slapstick Stupidity", "text": "OK, I'm half through, and I'm bored. Seriously, how many times can these two idiots catch then lose their prey? It's like reading a Keystone Cops book. They're all starting to read alike. Fifteen was really bad, and this is better, but that's not saying much. Here's the template: catch a crook while rolling on the ground with or without Lula; lose crook; have sex or fight with Joe; be saved by and tempted to sleep with Ranger; something happens to Grama; Mom suggests new job; Dad grunts; Mooner's high; car gets trashed; add two or three stupid side plots to emphasize how insipidly moronic Ms Plum is. Did I forget anything?", "images": [], "asin": "0312383312", "parent_asin": "0312383312", "user_id": "AFR47OWG2MJ7PJEUFBFGAOC6Z3EA", "timestamp": 1480797084000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Served its' purpose.", "text": "This book was a requirement for a college course.  Although we didn't use the book very much during the course it was good to have, if for no other reason than for reference purposes.", "images": [], "asin": "032119375X", "parent_asin": "032119375X", "user_id": "AEYD7HMTCWY7VZASMIB5MB2H4X5A", "timestamp": 1377710469000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Pull this hatred", "text": "Junk from a professor that promotes death", "images": [], "asin": "1599212862", "parent_asin": "1599212862", "user_id": "AEBRHXKTPH575PY4SQ66JX2Z7V7A", "timestamp": 1538516763360, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Pretty good", "text": "It wasn’t quite as good as I’d hoped, but it’s a decent story.", "images": [], "asin": "1503948951", "parent_asin": "1503948951", "user_id": "AH3AAYMPGCNXNDMUPH65XVDGWI6A", "timestamp": 1636089870346, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "A delightful witchy read, but not quite there", "text": "Since the book has been compared to \"Practical Magic\" and other witchy magical realism novels, I thought it would be a wonderful read for the Halloween season. And for the most part, it was intriguing.<br /><br />The novel is atmospheric -- definitely a plus. But while the plot is unique, the story floats along on the same note for a bit too long without introducing much new action. I kept wanting to skim ahead for something else to happen -- so I believe the book could have been tightened up a bit, or made a little shorter. It was entertaining and I'd recommend it, but it's not quite the calibre of \"Practical Magic.\"", "images": [], "asin": "1481497359", "parent_asin": "1481497359", "user_id": "AGVKJE5Q46NIUCNFPOZUDSORSQYA", "timestamp": 1669044099526, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Wasnt useful", "text": "Need to buy more on it", "images": [], "asin": "1589243056", "parent_asin": "1589243056", "user_id": "AHVUB5SCEFVRZFAO52XZA4N4ELTA", "timestamp": 1537548367495, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "love the concept, the paper dor the daily pages not so much.  The pages aren’t square", "text": "How are you supposed to do origami with not square pages? The concept of this calendar is GREAT. The paper they printed it on is crappy and not square.  I had hoped to use the page of the day before to do each day’s origami exercise.. a reasonable wish, but not only is the paper not square but it’s not good for origami because it doesn’t fold nicely.  Bring back the It’s Different Every Day calendar!", "images": [], "asin": "1523508841", "parent_asin": "1523508841", "user_id": "AEXTL26SU36U37GXKMK4P7K24VPA", "timestamp": 1623261562795, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It's okay.", "text": "I had hoped for a but more 'how to' in the book, but it is more of a month-to-month of what the author does in 'householding' and in a very generalized way.", "images": [], "asin": "0982569157", "parent_asin": "0982569157", "user_id": "AG5WH63ZILHD7S4LPM5DGIAIM6ZQ", "timestamp": 1385395409000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I have enjoyed all the Johnathan Grave books until this one", "text": "I have enjoyed all the Jonathan Grave books until this one. I read purely for pleasure and there's no pleasure in politics. I have picked it up and put it down several times and even though I'm only half way through, I'm done. I'm sorry, Mr. Gilstrap.", "images": [], "asin": "0786035056", "parent_asin": "0786035056", "user_id": "AF4KRBL26SI6ZEOFP5DNVFOS3DDA", "timestamp": 1457561676000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Belzhar", "text": "OVERALL IMPRESSION: I love reading books about boarding schools, and for some reason have this obsession with them, so I was really excited to start reading this.  The students in the Special Topics class this year are studying the works of Sylvia Plath, and because of that after reading this I really want to read &#34;The Bell Jar.&#34;<br /><br />I love the idea behind this story. I haven't ever read anything like it and the topic was something that really stood out to me. I liked the progression of the story and I was really interested to see what was going to happen at the end of the book, but I was disappointed with the last part of the book. The ending itself was find, but the part leading up to the ending where we learn more about what Jam went through was not what I was expecting and I didn't like it at all.<br /><br />CHARACTERS: I feel like there could have been some more character development. I would have liked to know more about all of the students in the Special Topics class as well as Jam's roommate. I liked all of the characters, but I felt like I didn't know them enough.<br /><br />COVER: I love how the cover incorporates so many things from the book.", "images": [], "asin": "0525423052", "parent_asin": "0525423052", "user_id": "AHT5CUJ2KRJ442O7HTMURJJRFK5Q", "timestamp": 1410925830000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Was expecting this book to be better.", "text": "Is OK", "images": [], "asin": "1604187743", "parent_asin": "1604187743", "user_id": "AF2MHBWEWXK4JTDLWI77QZFVGIIQ", "timestamp": 1461865661000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Slow", "text": "I couldn't finish it!  I was supposed to read this for a book club and I couldn't even get half way through.  Everyone said it picked up it's pace halfway through but I didn't want to waste my time with a book I already didn't like and I never leave a book unfinished.", "images": [], "asin": "0812982428", "parent_asin": "0812982428", "user_id": "AHSVH6PM4U3Q3I4VO7LPV3KFAZMQ", "timestamp": 1361204504000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Annoying", "text": "This series is annoying and grating. I'm a fan of Coben's work, but the way he stretches out every bit of suspense for ages is really juvenile. The plot is just silly.", "images": [], "asin": "0147515742", "parent_asin": "0147515742", "user_id": "AHL7KQODIWX7MDJ7RQBYQBURAAIA", "timestamp": 1478932423000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "okay", "text": "it works well but clep is difficult..i recoment instead using one of the online services.  for a small fee that will build a format to teACH AND QUIze you a no brainer", "images": [], "asin": "0878912754", "parent_asin": "0878912754", "user_id": "AEHE5KOUJ7HOJE3ZHOSPUXPPKA5A", "timestamp": 1357006994000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Do Not Waste Your Money", "text": "I’ve been cooking for a very long time, including simple cheeses (some time ago). So to find a cookbook that APPEARED to be very good was interesting. Now, after nearly three months using this book, I find it really, fundamentally disappointing. Here’s what’s wrong:<br /><br />Cons:<br />1) Some recipes carry an incorrect name for the cheese being made. For example, the recipe for Queso Fresco is really for Queso Blanco. There’s a world of difference between the two, as the Fresco is a semi-soft cultured cheese, while Blanco is coagulated with lemon juice, citric acid, or most properly with white vinegar. That the recipe’s title is wrong is inexcusable.<br />2) Many recipes are HEAVY on salt. Salt is supposed to bring out flavor, not BE the flavor.<br />3) Ingredient portions, are sometimes not the proper amount.<br />4) Even carefully following the recipes gives a proper result about half the time.<br /><br />Pros:<br />1) The paperback is recyclable.<br /><br />The foregoing is my opinion. You are welcome to throw your money across the counter. Perhaps you’ll have better results.", "images": [], "asin": "1623157943", "parent_asin": "1623157943", "user_id": "AHRQYYKEOUWW5HJU3RNRCXTXKAMA", "timestamp": 1588112464422, "helpful_vote": 45, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not what I needed but ok.", "text": "I wanted a simple book on steps to prepare the home for a solar flare event that would shut down power grid and electronics.  Basically, how do I protect my home for an extended period of time. This book was too political and just too much of the wrong information for my needs.  He did have a lot of referrals on other books to buy to help with specific issues.  Specifically, I needed the best generator for esstentials and how to have electrician wire it.  And what else do we do to prepare for that event.  It did have some information on assorted things like how much water per person for a certain amount of time.  But I guess I just wanted a book to tell me, here's what to do, steps 1-2-3- to prevent your home from shutting down in a solar flare event when the electrical grid is gone.  I will keep looking for a book that has it laid out easier.", "images": [], "asin": "1933392452", "parent_asin": "1933392452", "user_id": "AGQEOLI5RSQNH52NB6KUVTOX6PUA", "timestamp": 1281202936000, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Not the original 1991 work", "text": "Not the original work(1991) as implied.", "images": [], "asin": "0929385225", "parent_asin": "0929385225", "user_id": "AEKOPOJTVL226HKS3EFKQAVQBC7Q", "timestamp": 1621888106318, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Russian history lessons included.", "text": "An enjoyable read ... More of a mystery than her other books. You have to suspend your concerns with psychic phenomena & just enjoy the story. Nice to learn a bit more history along the way. Seems to ramble a bit in places, hence the 3 stars.", "images": [], "asin": "140227663X", "parent_asin": "140227663X", "user_id": "AE2JFRQESBIRWWHQTVEVBHKLLN7Q", "timestamp": 1413198721000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Slightly Cheesy Beginning to Classic Sc-Fi Comic", "text": "This untranslated story arc is episode 1 of the long-running French comic strip \"Valérian, agent spatio-temporel.\"  \"La Cité des Eaux Mouvantes\" [The City of Moving Water] and \"Terre en Flammes\" [Earth in Flames] originally appeared in 1968 and 1969 in the legendary French cartoon anthology, PILOTE.<br /><br />In the previous adventure, \"Les Mauvais Reves,\" Valérian, space-time agent for 28th-century Earth, rescued the spunky redhead Laureline from the mad scientist Xiombul.  Now Valérian must pursue Xiombul to Earth circa 1986, a dark age about which little is known.  Laureline follows to help Valérian and save Mr. Schroeder, future inventor of time travel, who Xiombul has kidnapped.<br /><br />Mézières artwork is still in its earliest stages and figures, especially, are rather crude.  However there are clear signs of a grand breadth of the imagination both in the artwork and in the story, an early effort by famed French comix scripter Pierre Christin.", "images": [], "asin": "2205004573", "parent_asin": "2205004573", "user_id": "AG6GPIKENPZRBMYKTGNF46XUN7FA", "timestamp": 1115054316000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Will use my internet more on trips", "text": "The book looks nice however I can do just as well with going on the internet and working with AAA. Doesn't go in too much detail about sightseeing on back roads. A little disappointed.", "images": [], "asin": "1426219059", "parent_asin": "1426219059", "user_id": "AEL3CUUIDKP24IXGUK2XHHI2CJNQ", "timestamp": 1581087140402, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Audible Version", "text": "Do not buy the Audible version.  470 pages in 2 hours 40 minutes.  Order from Etsy, and get the unedited version.", "images": [], "asin": "0929385225", "parent_asin": "0929385225", "user_id": "AF7EVEQQXHYYAHICPTI6YAYWSE6A", "timestamp": 1669807098615, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Good but a far cry from Twisted Creek", "text": "I loved Twisted Creek the last novel I read of Jodi Thomas, this one was an easy read, but it just ended.  I felt frustrated by the quick ending.  There were so many characters it was hard to keep track of all of them.  The writing was fast and I never connected to the characters as I have done in the past with Ms. Thomas's other novels.  It is an easy read and it is well written, just would have liked to feel the characters more.", "images": [], "asin": "0425237729", "parent_asin": "0425237729", "user_id": "AFBXDI55GEOEED5P42NJ252QDYUQ", "timestamp": 1300063605000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Worst eroticism ever...if you can call it that!", "text": "Having taken writing courses, I was apalled at the re-usage of the same words (especially 'murmur'!! This writer doesn't know the use of synonyms? How could the publisher have approved this? So many repeats. I began to roll my eyes at the continuous use of that word among others. The girl continuously bites her lip...she orgasms from a look, blushes after screwing herself blind?? It's too unbelievable to get into and too drawn out. It took 196 pages to get past the interviews and texting...just too hoaky. Didn't even finish it.", "images": [], "asin": "B007R07BK8", "parent_asin": "B007R07BK8", "user_id": "AFAHXJLF3Y5VEXMXQP355GM6G23Q", "timestamp": 1354415148000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Nice calendar but didn't realize it's sideways takes up a ...", "text": "Nice calendar but didn't realize it's sideways takes up a lot of space and date part is small which is great to admire the paintings.", "images": [], "asin": "0789331969", "parent_asin": "0789331969", "user_id": "AHBE5K5BHU5M6AHV6OY3PQ6OYWDA", "timestamp": 1490033611000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Lovely book", "text": "You cannot use markers of any kind with this paper.  Not sure how gel pens would work as I have not tried them yet.  Definitely more for color pencils.  I love the art in this book and against a black background.  Just disappointed it will not work with markers well at all.", "images": [], "asin": "1533555281", "parent_asin": "1533555281", "user_id": "AE7ISF3XUEA3BXGYEZRSXCU2NN7Q", "timestamp": 1483069829000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Two Stars", "text": "The author tries to be funny and shocking which makes it harder to learn the material.", "images": [], "asin": "1446249182", "parent_asin": "1446249182", "user_id": "AESZFIJT53Q4IJOAK6EEXLYJ6NLA", "timestamp": 1479506871000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "poorly made", "text": "poor quality  binding.  fell apart as soon as I opened the book.  sent it back.  no problem.", "images": [], "asin": "156898488X", "parent_asin": "156898488X", "user_id": "AHQFX6BMHDZNYUTNUXGSCHJOL2IQ", "timestamp": 1410742671000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It's okay", "text": "Spoilers<br />Like many other reviewers of this book, I too was dismayed when the book switched gears from the present to a hundred years into the post-apocalyptic world.  In fact, I was rather angry and put the book away.  However, about a week later I realized I was curious and started reading again.  I actually ended up enjoying the second part of the book more than the first.  I still would not consider this book better than just &#34;okay&#34; though for these reasons: 1. Moving the events forward in time can be done successfully by a skilled writer; he did not manage that here.  I think the main problem was that he changed not just the time, but the pacing of the story was completely different, and the characters were all new as well.  The main character in the first  part of the book, Amy, plays a secondary role in the latter half.  That doesn't make much sense.  2. He can't get to the point and belabors minute details.  3.  He keeps killing characters.  Even though we have learned about their lives in excruciating detail and have to come to care about them.  It's a bit rude. 4. The ending.  I read The Passage after The Twelve was already out, so I accepted the teaser ending.  However, it still annoying.<br />This should have been 2 different books and it is way too long.  But, overall, I did enjoy the story and the characters despite the mediocre execution of the novel.  (I should also say that The Twelve is really bad and I cannot recommend it at all.  That's a separate review, but knowing that may prevent some from wanting to invest time in The Passage.)", "images": [], "asin": "0345528174", "parent_asin": "0345528174", "user_id": "AHHHS2IQ6CAJXRHL3TTFLMGUP3PA", "timestamp": 1406470092000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "A very skimmable book", "text": "Well if you can get through the rather dull history of all the people that managed George, the prolonged legal case of \"Seven Dirty Words\", numerous irrelevant asides, a total disregard for the problems with his mother and his wife and daughter, then this is the book for you.  I think Wikpedia does a much better job with maybe an HBO special from Netflix to supplement.  How can you write a book about this very influential comic and not include much of his work.  I suppose there are legal problems with including verbatim Carlin's brilliant cultural incites but I certainly missed them.", "images": [], "asin": "B006J3WMHG", "parent_asin": "B006J3WMHG", "user_id": "AHO5AQ7ACP2JHTXVR3JH2WWIDLRQ", "timestamp": 1376945207000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Good but could have been better", "text": "Feminist writing often strikes a chord with boomer women. We've been around the block and have acquired a level of wisdom over the years. We see how much progress has been made, how much is still to be done and can relate to the journey of other women. That's what prompted me to read You Don't Look Your Age . . and Other Fairy Tales by Sheila Nevins. The author is HBO's President of Documentary and Family Programming and although she's slightly order than boomers, I figured her experiences would be worth a read.<br /><br />The book is a series of essays about her life and that of women in her circle. Some people are disguised and others are revealed by name. I wasn't quite sure what to expect and was disappointed the book started off slowly. I almost quit reading as I'm not entirely interested in someone else's perspective on their own facelift. Seems a bit self-serving. But things picked up. I slogged on and I'm glad I did. Parts of the book are enlightening and share confidences about couples who sleep in separate bedrooms, the anguish of parenting a special needs child and the frustrations of aging. Some parts of the book are written in italics, in a sort of blank verse which is odd and could have been fleshed out into a decent essay. Nevins shared a lot but not enough. Her writing is smart and at times funny as well as being  relatable. It was good but could have been better.", "images": [], "asin": "1250111307", "parent_asin": "1250111307", "user_id": "AERXJJOFUWMJCEFRS65EZGQI7APA", "timestamp": 1513870537672, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A Fast Read. Malevolent is a great title.", "text": "Shaye Archer is a newly minted P.I. Just 24 when her first case presents itself. She’s hunting a stalker and it’s a creepy storyline that had me looking over my shoulder more than once. I’m not sure I’ll go on with the series. This one unsettled me a bit.", "images": [], "asin": "B0110X1GM6", "parent_asin": "B0110X1GM6", "user_id": "AFNJ2NR6KJ622NNSVWDXIEPRNOOA", "timestamp": 1581916540142, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Slim Smoothies", "text": "Great recipes.  I was just hoping for more that had just ice, fruits and fruit juices rather than yogurt.", "images": [], "asin": "0761520597", "parent_asin": "0761520597", "user_id": "AERI33XDZTYFBFMJATO4LURJOJAQ", "timestamp": 1185954960000, "helpful_vote": 10, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "God has it Righdt", "text": "Not what I was expecting.  Many good points about life and God's directions.  The short abstracts were not my favorite form of writing,", "images": [], "asin": "1612788327", "parent_asin": "1612788327", "user_id": "AESGLNOOG6D77X3KYOZA3XBBEEHA", "timestamp": 1445114845000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Caution: Do not buy or read!!", "text": "The ending was devastating!! I sold the series immediately! I will never bither with this author again!! The author betrayed her fans with this book!!!!!!", "images": [], "asin": "0062014536", "parent_asin": "0062014536", "user_id": "AEBWS5VAL7UUQNZG7IOBCXON3VEQ", "timestamp": 1394810747000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Okay, there are better", "text": "This is okay. If you buy Bar Breakers, I don't think I would recommend this. It spends part of the book going over the essay method that is much better presented in Bar Breakers.  Then there are the outlines.  However, if you can't afford or find Bar Breakers (I bought mine used) he does have a good method for answering essay questions that is included in this book.<br /><br />The outlines aren't bad per se, they just aren't overly helpful in my opinion. He seems to be repeating the laws rather than writing a &#34;these are the issues and this is how to answer the issue &#34;  I  read it and it's just gobbledygook to me.  There are much better outlines out there.<br /><br />I picked up Mary Basick's Essay Exam Writing for the California Bar Exam and it seems to have much better outlines and issue spotting. She has an issue checklist, an attack sheet and a full outline.  I would recommend that more.", "images": [], "asin": "1882278135", "parent_asin": "1882278135", "user_id": "AF3ODW6NCKEVVTGZNFS6FUQYSGTQ", "timestamp": 1418430071000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good story, but too much sex . . .", "text": "I think the story was interesting, and I liked heroine Riley, but she spent too much time \"in-heat\", and it was a little hard to get into the story because so much time was spent on the sex. I like a story with attraction and heat and lust, and yes even some sex on occasion, but this almost got boring.  The story did keep me interested enough to care how it ended, and I will read the next one - I just hope we can get into the story a little more and leave a few things to the imagination!", "images": [], "asin": "0553804588", "parent_asin": "0553804588", "user_id": "AGLP5HEJMHUS5F7JRFEQPKFL47UA", "timestamp": 1143215595000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Great table of contents... but horribly written. Authors made no effort.", "text": "As I glanced through the table of contents I got very excited. Even prior to reading it I almost wanted to give the book a 5 stars review based on its content alone. But then I actually started reading the book.<br /><br />a) the authors are very bad at writing. It reads very much like they wrote the book, then went back and opened up a thesaurus... and replaced all the words with synonyms and near-rhymes. It's not that the words used are too big and confusing. In replacing all the words with thesaurus words the words are actually used incorrectly, and the meaning has been thrown off.<br /><br />b) the coverage of the various topics is completely shallow and useless. My honest opinion is I don't believe the authors even understand the content they're discussing, I think they were probably given a list of topics to discuss and they just quickly googled some of them and scrapped a paragraph together. It reads like a school paper that you would write 4 hours before the deadline. The thoughts do not flow together, there is no depth at all, in many cases you can't even make out what they're trying to say. It is absolutely horribly done.<br />Many of the sentences are copied word for word from wikipedia, other books on the topic (which I knew because I'd read them), random websites (the first to show up on google when you search the topic), etc.. Just further evidence that the authors threw together some sentences quickly and had no idea what they were saying. Honestly the authors didn't deserve to be paid for writing this book, I could write a better book and I don't even know all this stuff.<br /><br />The best thing about this book, by far, is the table of contents. It's thorough and covers all the essential topics of architectural design patterns. You will not be able to glean any useful information out of this book. But what you could do is go through the table of contents & buy the respected books on these various topics. Then you'll be covering all your bases, and you'll be getting content written by people who know what they're talking about.<br /><br />I buy alot of books, very rarely do I give a book this bad of a review. I can only think of 2 other books out of about a hundred that I've reviewed this badly. The fact Packt actually published this, along with a few other experiences I've had with Packt, makes me very hesitant to buy Packt books in the future.<br /><br />Just absolutely lackluster.", "images": [], "asin": "1787287491", "parent_asin": "1787287491", "user_id": "AHYZHW7YV4734ONWEFUZZX7NN6IA", "timestamp": 1670040371240, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not bad for what is there", "text": "The author states that all of the info in the book is available online.<br /><br />There is nothing special about what it in the book. It is surprisingly short and only has a few examples/tutorials. I expected more about knots and other basic stuff.<br /><br />The 2 stars are for the content that I thought was useful. The list of tools.", "images": [], "asin": "B009E7U1A4", "parent_asin": "B009E7U1A4", "user_id": "AEC7LARJP34EAWCWAI2Q3J5O7UPQ", "timestamp": 1383067785000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Disappointing", "text": "I still like buying cookbooks even tho, there's a vast majority of recipes online. (I've no reservations about going online for a recipes though. )  I read thru some of the ratings and  expected alot from this book.  I think it goes back to, having the book in your hand and looking thru it to see if its worthy of a purchase; if I were to do that,  I'd not made this purchase. I'm not sure where these high ratings came from but personally, for me, there's nothing interesting here. I looked thru the book a few times now, and the only word I can think of is : disappointment. I've made purchases from familiar names, and authors that  I did not know of, some good some bad. This falls under the latter. I expected to be wowed, and if anything, its just a dull recipe book. There wasn't one item that made me, look forward to testing it out. For a cookbook, that's just unheard of! So that's how I rated this book. I'm going to take the book to work and leave it there, w a post it note saying: &#34;Free, please take me home!&#34; I hope there's a dark horse in the midst ready for this cookbook. :)", "images": [], "asin": "0770436803", "parent_asin": "0770436803", "user_id": "AFML2HBQNS73BK3APKKAXUOADROQ", "timestamp": 1465869475000, "helpful_vote": 8, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not Impressed", "text": "I bought this based on the good reviews but I'm not impressed. Cheap quality paperback binding, not much of a story. Two stars only because it has cute illustrations. Save your money, there are better books, hard pass.", "images": [], "asin": "0694012211", "parent_asin": "0694012211", "user_id": "AHI2HKNG6JJ62VTSI6D6Q5SDE2HQ", "timestamp": 1636416948368, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Completely fails to deliver on its basic premise in any way", "text": "Do you have any spare caviar on hand? What about beef tongue? Would you like to marinate pork belly for the next six hours before eating your drunk midnight snack? Do you just randomly happen to have been soaking two pounds of beef tripe for the past 24 hours?<br /><br />No? Then guess what, you can't make any of these \"late night munchie\" recipes.<br /><br />This is easily the most wildly incorrectly named cookbook in the history of cookbooks. Its presented as famous chefs making fun, greasy food in the wee hours of the morn after the bar has closed but the party is still going. That is NOT what you get. These are ludicrous, complicated, and in many cases not even appetizing recipes, and almost NONE of them fill the role of ooey-gooey-cheesy-late-night-munchie.<br /><br />There are maybe 4 - 5 total recipes in this book that actually fit the description of late night meals you'd make while drunk but want something a little more elevated from a serious chef.<br /><br />I got this for my wife for Christmas because she'd been looking at it forever, and when we finally got to reading through it to mine for recipes, I was legitimately angry that I'd spent money on this. Could somebody out there please release a legitimate version of this concept?", "images": [], "asin": "0399580085", "parent_asin": "0399580085", "user_id": "AEIZAERT5KTC4OFRAHP6Z5W6K6UA", "timestamp": 1565018840195, "helpful_vote": 62, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Technological romance?", "text": "For whatever reason, I never could really stick with this story, it was too unusual to keep my interest.  If you are into technological romance this book may be for you.", "images": [], "asin": "0385536186", "parent_asin": "0385536186", "user_id": "AFGSM2IFWCMZCPCORIQEO7SGXIRQ", "timestamp": 1423823008000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Thought provoking...if not a bit preachy", "text": "I am in agreement with many of the recent reviewers...there is quite a bit of philosophical meandering in this collection of the Wick stories. There were parts I struggled to get through, and other parts that I just skimmed over altogether. Ayn Rand meets Red Dawn indeed! Yet I did find myself enjoying the book as a whole, and became quite interested in some of these characters. I came to read these stories after reading Pennsylvania and some of Bunker's other work. I have to admit I find his way of life intriguing! I'd love to hang out with him someday and smoke a cigar.<br /><br />Sadly this story seems pretty plausible (minus the Russian conspiracy plot). I can totally see society devolving in such a manner. Time to stake out a nice piece of property near Amish country!", "images": [], "asin": "1491071982", "parent_asin": "1491071982", "user_id": "AFC6VWQJP2EWMWBZVSD6ZWG5I5KA", "timestamp": 1408754827000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Beautiful artwork on crappy cardstock", "text": "It's a shame that I feel the need to rate this deck only TWO stars when it could easily have been FIVE. Not only are the cards a little uneven (meaning the edges/borders are inconsistent, but they're also the crappiest quality cardstock I've ever seen Tarot cards printed on. Then again I only have fifteen decks in my collection so far. After just one shuffle/reading (yes, that's right - just ONE use) and the corners on the backside of at least 25-30 cards have already peeled/ripped off. More card corners have probably peeled by now since I've done a couple more readings. I don't foresee this deck lasting one year with continuous usage as I've only had this for several days and it's already looking worn out. (Card size is around 4.5-ish x 2.75 inches.)<br /><br />Besides the above however, the alternative artwork is mystically and imaginatively beautiful. I wish these cards were much larger to be able to admire all the little details of the art. Though the companion book shows each work on a larger scale, they're not in color; hence not quite the same. Also, if not for the book, I think beginners may struggle a little with the meanings unless familiar with traditional decks. There are no reversals explained in the book either as the artist did not design her work to be used with them. The Major Arcana meanings are briefly explained but the Minor Arcana do not have meanings included - we must infer them from the artist's poetic description/tale of each scene.<br /><br />A lovely deck to add to your collection if you do not plan on using it often.<br /><br />-UPDATE-<br />I added a third star because my bond with these cards have already been an amazing little journey.", "images": [], "asin": "0738715794", "parent_asin": "0738715794", "user_id": "AGYWM2Q5HVKO2YT4FP33IJZRGOSA", "timestamp": 1468750272000, "helpful_vote": 4, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "It's Ok.", "images": [], "asin": "0793509580", "parent_asin": "0793509580", "user_id": "AERWBKCF4WSJ3QSPM3SPBQHBIOEA", "timestamp": 1491486476000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Minimal Info", "text": "This book gave only very generalized information...for example, it says that one needs good fire making skills, but then gives no information at all on fire making, and not even any links to gaining further information.  Each subject was treated in that manner, and it was just totally minimal info throughout.", "images": [], "asin": "B01BS8D6TY", "parent_asin": "B01BS8D6TY", "user_id": "AHHBMWEFMWUGYU35WMJUOYMKSCZA", "timestamp": 1465696413000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "A Bit Witchy", "text": "At first, I was really into this book.  Lena sounded a lot like me when I was in high school, and I was excited to read a book that didn’t have a pretty, thin girl at the center.  I mean, Lena is even a gym spaz.<br /><br />But I quickly came to the point that I had to force myself to read it.  The whole deal with the guardian angels really confused me.  Were they good, or were they evil?  It seems each chapter told us something different.  I felt like I had come into the story in the second book in the series, but this is the first book in the trilogy.  Some sort of guardian angel “crash course” would really have helped me understand a lot.<br /><br />However, the wild shifts in Lena’s brain, wondering who her allies really were only adds to her authenticity as a teenager.  I can still remember those crazy changes in thinking with only one thing being said.  It was absolutely chaotic, so that part holds true.<br /><br />While I liked Glenn and his brothers, they did seem like a bunch of over-the-top horndogs.  Lena, even as she pretends she doesn’t like the attention, seems to flourish from this attention.  I can’t say I really blame her, as I would have done the same, but it still icked me out a bit.<br /><br />This book was not for me – I think it delved too much into paranormal for my taste, more than I had anticipated.  I’m not a huge fan of paranormal so I bet those that are would enjoy A Bit Witchy.<br /><br />I was given this book in order to provide an honest review. All thoughts are my own.", "images": [], "asin": "1516889231", "parent_asin": "1516889231", "user_id": "AHBF2PAK5AX7LGZNR6S6ALNLRGLA", "timestamp": 1450537890000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "uh-uh", "text": "This book was a complete disappointment!  I should've sent it back, but never got around to it.  Guess I will put it in a garage sale and try to get $1.00.", "images": [], "asin": "1588165213", "parent_asin": "1588165213", "user_id": "AGQID3KUBVEI4GT64I2LNTR56Y7A", "timestamp": 1305633171000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not great", "text": "Many of the pictures are underwater but the content, and intent of this book is superficial.  I am not sure exactly what the purpose of this book.  Perhaps because I live here I expected a bit more.", "images": [], "asin": "1934598054", "parent_asin": "1934598054", "user_id": "AEUKBLBMHP3AZJMVVTNYHUFYMWLA", "timestamp": 1319295537000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Very nice quality but no nutritional values.", "text": "This is a very beautiful book. High quality binding with beautiful color photos of most of the dishes. Also has relatively quick and easy recipes without a bunch of obscure ingredients or required kitchen utensils you might not have. However there is a glaring omission of the nutritional data for each dish. Something that is so basic and fundamental to any athletic cookbook. Even the cheapest straight to kindle-without pictures cookbooks on here have that. There’s plenty of space on the pages of the ingredients and would have been super easy for the authors to just add up the nutritional content from the ingredients. I was actually pretty shocked at this oversight.", "images": [], "asin": "1635651913", "parent_asin": "1635651913", "user_id": "AGPBORUODS3U3XASQDEIJSW4YRNQ", "timestamp": 1620572390634, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "A most disappointing book.", "text": "This book does nothing to connect the i5/iSeries/AS/400 to XML.  It is a rambling, confusing look at XML with some interesting future considerations thrown in.<br /><br />I agree with the other reviewer, buy a book on XML and then go to the IBM web site and find out what you need to accomplish the task.<br /><br />I hope that the author will, in future editions, add concrete i5 (or whatever it will be called next month) information.", "images": [], "asin": "1583470506", "parent_asin": "1583470506", "user_id": "AFNCPL6DZ3YB73ZCTQOWRWFWUTXA", "timestamp": 1138891685000, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Underwhelming", "text": "There are so many reviews for this book and it seemed like mostly everyone raved about it.  After finishing the Grisha Trilogy (Shadow & Bone), I was excited to dive into this.<br /><br />Unfortunately, this was underwhelming. While some of the book (towards the end) was a bit more fast paced, it is mostly just a drag.  This is not as fantasy heavy as Shadow & Bone, and it is more of an action story.  I enjoyed Inej and Kaz - but the other characters were not rounded and seemed to just be fluff.<br /><br />This may be a good option for someone who thought the Shadow & Bone books were too romantic or fairytale-ish.  For me, I could have easily set all 465 pages to the side.  Now that I have read this, I will read the next as I hear it improves on all fronts.", "images": [], "asin": "125007696X", "parent_asin": "125007696X", "user_id": "AHNITAPTVV75BRMM4D2BHEYIKDYQ", "timestamp": 1623089766532, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "I received the book without the", "text": "I received the book without the DVD", "images": [], "asin": "1865159263", "parent_asin": "1865159263", "user_id": "AFHDLH6QLX3HHN5362AUG4MDKE4Q", "timestamp": 1478109793000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I won't be recommending this one...", "text": "An ENTIRE book filled with virtually nothing but internal dialogue.<br /><br />There was a whole lot of telling, but not much doing. The endless rambling became tiresome. The two main character's voices were indistinguishable, despite one being an alcoholic. Their eventual friendship seemed forced and not entirely believable. And the conclusion was not only expected, it absolutely fizzled.<br /><br />This is the third book I've read recently with Covid tie-ins. Honestly, that's becoming tiresome too. I want to escape reality with my books.<br /><br />Anyway...I won't be recommending this one.<br /><br />Available December 31, 2020<br /><br />My sincere appreciation to NetGalley and Hodder & Stoughton for my review copy.", "images": [], "asin": "B08NJJQRCM", "parent_asin": "B08NJJQRCM", "user_id": "AGFHHZIEFIIXJZKWRCLKISPPFGWQ", "timestamp": 1609562671514, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Gift", "text": "This was a gift for a GG fan. I'm sure it will be well received. However, I do wonder why they didn't make it bigger/easier to read as most fans of GG are older & may have trouble reading the small text. Regardless, it looks like something my GG fan will enjoy.", "images": [], "asin": "1925418561", "parent_asin": "1925418561", "user_id": "AH3QNNM6B5FDM4DZZH4KFUXP74XQ", "timestamp": 1574371057049, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Starts off slow", "text": "Not as interesting as I'd hoped", "images": [], "asin": "0062964615", "parent_asin": "0062964615", "user_id": "AEYE3LSUHQEX6BWG224MKVXX6XZQ", "timestamp": 1636123151636, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Flaps torn our", "text": "Super sweet book, but it arrived with flaps torn out.", "images": [], "asin": "1588655385", "parent_asin": "1588655385", "user_id": "AEI4KGUPXOZCG5HVU5QBUXUOTHQQ", "timestamp": 1496411328000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Disappointed, way over-simplified text", "text": "I was looking for a book to introduce Christian stories as part of our world mythology unit for young homeschooled kids. I wanted something simple enough to interest even kindergarteners but this is too simple. The adult involved would have to have extensive Christian background in order to discuss the stories with the children because there is so little information there. It may be useful for Christian parents who can flesh out the stories. I was raised Pagan and even I know more of the stories than is in there but I don't know enough to make it a good book for my kids. I give it two stars because the illustrations portray historically correct skin colors, which is rare in illustrated Bible stories and much appreciated in a multi-racial home. I recommend The Children's Bible in 365 Stories (Mary Batchelor) for a more explanatory edition with lively and kid-friendly writing.", "images": [], "asin": "0310709628", "parent_asin": "0310709628", "user_id": "AEU3FF2QN5LHF3JELYPUCFFZNP7A", "timestamp": 1373339351000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Cult of Personality", "text": "I read this.... It's unfathomable why Ginsberg was adored, except for uniformed identity politics. She wasn't bright enough to figure out that if she didn't allow Obama to replace her, the Supreme Court would likely get filled with deeply conservative appointees under a Republican president, if she were to pass before the Dem's next \"sure thing\" (Hillary) ascended.<br /><br />Obama tried to get her to move on, but she couldn't take a hint.<br />I saw it coming, and I'm not a legal scholar. Why couldn't Ginsberg? Oh well, it's just 40 years of hard-won progressive precedents that will be tossed out of the courts.", "images": [], "asin": "0062415832", "parent_asin": "0062415832", "user_id": "AHVPXEPKBQM7S3ZQCT4RH2XQ7CGA", "timestamp": 1615321379857, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Great item, damaged box", "text": "This is a collector's item, and amazon shipped it to me in a bubble mailer bag! The box was dented and damaged. Thankfully I wanted to display the figure anyway but why on earth would you ship a figure box in a bag?", "images": [], "asin": "1646517547", "parent_asin": "1646517547", "user_id": "AGBDTAC3CR7G7Q4IULNR25E2YHBA", "timestamp": 1677125924236, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "disappointed", "text": "I didn't like it at all. When I read all the great reviews I couldn't wait for our book to arrive.  &#34;Hey dragons why do you like tacos so much?&#34;  Never gives an answer.  I bought it for a 2 year old, maybe older kids would enjoy it, not me", "images": [], "asin": "0803736800", "parent_asin": "0803736800", "user_id": "AGKAI27QWIYIH2CES7KPDKVIZRFQ", "timestamp": 1391208241000, "helpful_vote": 6, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Disjointed and meandering", "text": "Very disjointed and difficult to follow until you get used to it. Too depressing. She has some good points, but failed in delivery. She kept saying hour her editor helped so much because the book was such a mess. Well, that must have been an epic mess, because it is still not put together well. Disappointed. Tough to finish.", "images": [], "asin": "0399588396", "parent_asin": "0399588396", "user_id": "AHBF6XA3LKEU6UA2VLJKHRCZY6UA", "timestamp": 1574454298421, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Not Eisler's best", "text": "First, I am a huge Eisler fan, fascinated by John Rain and his friends. Loving big ol' Dox in the series, this was a book highly anticipated. For me, it started poorly and went downhill. The unnecessary overkill in the vile conversation between Dox/Carl and his father was so bad it made me return the book without finishing. It was as if the Author had some personal angst he needed to dump on his readers instead of a Therapist! No thanks. Hoping for more John Rain featured novels which are always filled with rich details and characters.", "images": [], "asin": "B09C681LRX", "parent_asin": "B09C681LRX", "user_id": "AEC565ZJMGT3JOEFP3OZMNNS7GHQ", "timestamp": 1675279197243, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Great, Fun Series", "text": "I enjoyed this whole series by Nora Roberts.  They are light and fun chick-lit and sometimes I just like to read a well written novel that I can take at face value.  The whole series is about a group of four girl friends running a wedding planner business.  Each book features one of the girls as the main character.  A great set.", "images": [], "asin": "0425233685", "parent_asin": "0425233685", "user_id": "AHWEM7E2PYGW6QCATOWYGZZJ7QPA", "timestamp": 1455560487000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not what I expected", "text": "This book is not what I expected. It is without nice details and repeats the photos. I am not a fan.", "images": [], "asin": "0764337262", "parent_asin": "0764337262", "user_id": "AGJ3XWQI46FTJ77PQHHVT5D56FTA", "timestamp": 1408210973000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Good read", "text": "Good story but got repeative in middle and end. I'm glad I read the book! I still can't believe it was based on true story.", "images": [], "asin": "B003XT60JK", "parent_asin": "B003XT60JK", "user_id": "AEG653S2BRLEHJH54PRUJWYNOFCA", "timestamp": 1392376448000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Not worth reading", "text": "This author keeps repeating himself.  If you take out his complaining about the weather and his doubting himself all the time there isn’t much left.  I found his writing tedious at best and downright boring in places.  I would definitely skip this book", "images": [], "asin": "B005GPWTVM", "parent_asin": "B005GPWTVM", "user_id": "AFBXUPFV6RZ2ZPJLTJEWVDUGTRBA", "timestamp": 1562435316972, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "This book was not it", "text": "I had a really hard time reading this book. It was just annoying I can't think of a better word. I read it cause it's highly recommended but honestly I will never read it again and I would say skip it but everybody learns differently so you might love it.", "images": [], "asin": "158394835X", "parent_asin": "158394835X", "user_id": "AF5IEKLT5QVTU2QXUXI33CZHRRZA", "timestamp": 1642646568626, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "eh...", "text": "I wish i could say i loved this book because i really enjoyed NOS4A2.  I found this story to be extremely slow and some what confusing.  The ending also disappointed me.  Don't dismiss this author though!  I will read his other books even though this one wasn't for me.", "images": [], "asin": "B0036F6WYO", "parent_asin": "B0036F6WYO", "user_id": "AE6JMAGKKXB3XWFTMMIPPHHJJCOA", "timestamp": 1386631689000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Metrometrix is better.", "text": "Plenty of &#34;fluff&#34;, and little of hardcore significance.  Unfortunately, that is also the nature of this test--it is far from hard science or mathematics and thus is quite ethereal and subjective (hence the test allows for &#34;partial credit&#34; on multiple choice questions).<br /><br />That said, I used the flash cards and they were more grounded with principles than this book.<br /><br />This book has 200-pages of text, and 100-pages of questions.  I used a highlighter and reviewed the 200-pages and, all told, had perhaps 40-pages of actual &#34;good information&#34; to learn.  The rest was things like: in a modern classroom, computers are important for learning for a number of reasons such as allowing students with diverse learning patterns to learn at their own level, tracking individual student progress within a classroom setting, permitting a teacher to modify a teaching plan based on computer-based feedback from recent lesson plans, and permitting the teacher to determine the amount of time spent on each question in order to gauge areas where students might be stuck.<br /><br />This type of hogwash is what is on the test, but more importantly, this book is replete with similar ethereal crap that is unlikely to help you navigate the abstruse actual test.<br /><br />Bottom line: the difference between passing and failing the actual IL Teachers Exam is in the few solid questions that they ask (e.g. Piaget, etc.) and to get a grip on those questions--the difference between becoming licensed or not in the Lincoln state--is better served by the flash cards (see other testing supplies) and not the Sharon Wynne materials. This is from a person who bought and used both.", "images": [], "asin": "1581972938", "parent_asin": "1581972938", "user_id": "AEPLHCEMDY74XNN6GUSZWQ74YQEA", "timestamp": 1430405333000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Took a while to get into the plot", "text": "In a world of dragons, magic, and mystical creatures, humans are ranked and put into classes according to their worth. Al is trying to make it through testing day, the day he finds his place in the world and can be whatever they assign him to be. Only this is not how things go. Al is thrust into a life of running from the Cullers, an army doing the Dragon's bidding to rid the world of the trouble-makers.<br /><br />While on the run Al befriends some interesting people and finds himself on the adventure of his lifetime. Destined to be something great and he doesn't even know it.<br /><br />It took me a very long time to get into this book, I think it was mostly because it talks of dragons and an epic fantasy quest and it is/has those things, but not for a while. The first half of the book is about Al on the run and his encounters and strengthening himself for battle, mentally, and emotional for what is to come.<br /><br />The characters are not overly developed and leave a lot to the imagination. They are enjoyable but they lack depth...then again this is a middle grade read, intended for grades 3-7. The story once you move past the initial running and battles gets a little better. There is more detail about the real plot and Al's importance, but again here there is a lot left unsaid or started to late in the book to get really into the details.<br /><br />Don't get me wrong, I really enjoyed the 2nd half of this book, it was wonderful and it did not take me long to get through. It just wasn't as epic as I expected going into it.<br /><br />If you have a young boy, this is an adventure with good versus evil, dragons, swords, fighting... all the goodies they will love, so pick it up for them. If your reader enjoys fantasy, I think it is a good pick all around for a light, easy, read. If you young reader is looking for depth, this one lacks things and leaves a few questions in the end.", "images": [], "asin": "0545450683", "parent_asin": "0545450683", "user_id": "AF4V25WZ4KWQ4N6UCEFHBG6URTJA", "timestamp": 1375498870000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Tracking Dogs for Finding Wounded Deer", "text": "Like Tracking Wounded Deer better that is written by same author", "images": [], "asin": "0972508929", "parent_asin": "0972508929", "user_id": "AHEI4T7B4ESFVEAWLUF7GP2ZZ2LQ", "timestamp": 1455679932000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Just okay", "text": "I had thoroughly enjoyed  the first book and was looking forward to this one too.  Unfortunately the characters and plot was just too far fetched for me.  Way too much was happening way too fast for it to even come close to approaching reality.", "images": [], "asin": "B0074VTH70", "parent_asin": "B0074VTH70", "user_id": "AEFZN6E2EQLRQLGFQU62IM4FRQNA", "timestamp": 1397998868000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Purchased as gift", "text": "Purchased as gift", "images": [], "asin": "0553392263", "parent_asin": "0553392263", "user_id": "AEPDNJHVIJDS3MCX3GO64A62M4IQ", "timestamp": 1646541837695, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "No need to buy a modern ripped-off.", "text": "Look. This overpriced volume may be Cambridge's sincere attempt to update its classical scholarship on Sophocles. But for average students of classics, you will be far better served by looking for a copy of &#34;The Antigone of Sophocles&#34; (with greek text and commentary) by Richard C. Jebb (Author) and E. S. Shuckburgh (abridgment editor). It is an abridged version of Jebb's famous commentary on Antigone. It has the right amount of information for a learner to gain a better comprehension of the greek text. I compared the two commentaries and found myself using Jebb's commentary almost exclusively. Jeff's commentary came out in 1928 and has long been out of print. But if you are quick, there are still used copies in good condition available from Amazon sellers. I got mine for just $ 4.50 and I love it. The current commentary by Griffith is not all that bad. It incorporates &#34;new scholarship&#34; on greek tragedy. But I find it unbearably verbose. The truth is that classics study reached its peak at around the period from the beginning of the 20th century till Second World War. Best commentaries were produced around that time. Modern classical scholarship doesn't quite match the rigor of what it used to be 60-70 years ago. The survival of classics should mean making scholarly works from the first half of the 20th century (whose copyright has expired) available at affordable prices. Sadly, our education institutions have squarely refused to do that. They keep making poorer commentaries and demand exorbitant prices from students all the time.", "images": [], "asin": "0521337011", "parent_asin": "0521337011", "user_id": "AFE4TW336AMTJ4X3X6N57TDIJMTA", "timestamp": 1507597823395, "helpful_vote": 7, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Doesn't help nursing students", "text": "Wasn't useful at all.", "images": [], "asin": "1437708250", "parent_asin": "1437708250", "user_id": "AFMIMF2TFIQIWI5DESQZQW3IAWHQ", "timestamp": 1471392412000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Just okay", "text": "not much fun", "images": [], "asin": "1794482520", "parent_asin": "1794482520", "user_id": "AFXA3ZPBLEWFPTZJDDVVU27F6TZA", "timestamp": 1565108959809, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Picked Up Some Ideas", "text": "I am a seasoned in-person curriculum designer and trainer, but have struggled to transition to the virtual world. I was excited to receive this book, hoping for a guide that would help me in the transition. While I picked up a few activities that I could use for virtual training, the book is not what I expected. Many of the activities felt rehashed, same concept, written differently. I wish each activity had more guidance and had better formatting. I gave it three stars because I implemented two of the activities for a virtual training I delivered after I received the book. I bought Kassy's book on virtual training tech too. I hope that one is better.", "images": [], "asin": "1562869361", "parent_asin": "1562869361", "user_id": "AEGB6DI7GAOKG55BNIKUTZ34Z3XQ", "timestamp": 1617459205022, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Paranormal to the max", "text": "This book wasn't quite what I expected after reading the blurb, but it turned out to be an interesting read with quite lot of elements that made it worth the time. The paranormal abounds in this novel and there is no shortage of creepiness.<br /><br />This is a sort of cozy mystery book with a few good laughs along the way. The main characters make the book worth reading with plenty of fun banter between them. I thought the romance was a bit on the predictable side and there were some events that I saw coming a while before they actually happened, but for the most part the story was enjoyable.<br /><br />I liked that the characters were very different from one another and there was a broad array of personalities to enjoy. I also thought this story had a bit of a Christian feel with a stark contrast between good and evil.<br /><br />Overall this was a good book with plenty of redeeming qualities. If you like paranormal stories where there is some history, some mystery and some humour too, this might be a good one to choose.<br /><br />This review is based on a digital ARC from the publisher and provided by netgalley.", "images": [], "asin": "1594331618", "parent_asin": "1594331618", "user_id": "AFDNLNTANUGENK62RSTAQALJOWPQ", "timestamp": 1382292750000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Virgil: \"stunted\".  Hitch: \"is\"", "text": "In COVID times, I am reading anything I can get my hands on. This is such a book. I have read and re-read Appaloosa 7-10 times. This, I will read once and donate somewhere. I appreciate his efforts to continue the series, but just adding a hundred pages of \"Hot.\" \"is\" to show they are laconic, does not Robert Parker make.", "images": [], "asin": "0399171134", "parent_asin": "0399171134", "user_id": "AFWT5GLMEP4J25CXM2KXUZYYADNA", "timestamp": 1609870366762, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "slow", "text": "I wanted to like this book more but I found it plodding and slow.  The story and times were interesting.", "images": [], "asin": "B08WWZZ9NJ", "parent_asin": "B08WWZZ9NJ", "user_id": "AFSDE7BAY4TQJSOXHYEJWRIOWZAA", "timestamp": 1641050209760, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Not an actual book! Just a photocopy", "text": "This is not an actual book. It's some guy printing it out at Kinkos. The cover is a low-resolution photocopy. I bought this as a gift but couldn't present this crappy copy to my friend. I'm going to drop it off to Goodwill.  Amazon made it right and refunded my money but everyone should be forewarned that if they are looking for an actual book, this is not what they want.", "images": [], "asin": "1494400626", "parent_asin": "1494400626", "user_id": "AHTWTXIACVTKLVFDDCAWPCNE3RPQ", "timestamp": 1418998187000, "helpful_vote": 5, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I Felt Bad for the Characters", "text": "I just felt bad for the characters. It was just about people making bad choices and it pretty much ends how you would expect.", "images": [], "asin": "B07S1XD2YS", "parent_asin": "B07S1XD2YS", "user_id": "AGDI3LGJBMYIAJL27ZTLHPCJUGHQ", "timestamp": 1640753283964, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "You need some experience!", "text": "It's an interesting book but does require you have some previous experience with wood working.  Some of the projects are outdated.  I am a true novice and didn't find one project I feel confident in trying; maybe later.", "images": [], "asin": "B004BCQN22", "parent_asin": "B004BCQN22", "user_id": "AFIXKM7ETI3RSHN5HZOH3X5XW4AA", "timestamp": 1475518919000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Unbelievable....in a bad way", "text": "Not a good book. I'm really surprised by all of the positive reviews. I found the main character to be totally unbelievable amd ridiculous. He is a 20 year old college student,  policeman,  detective,  bar bouncer,  and MacGyver?  I don't think so. He wasn't that likeable. I think this book had a lot of potential. I really think that the author should have focused more on the relationship between Carl and MacGyver...that was where the story was at.", "images": [], "asin": "1616149981", "parent_asin": "1616149981", "user_id": "AH2H7BOPITYJCN5BSMG6KRJU3SNA", "timestamp": 1457414107000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "No Midwife Murders to be Found", "text": "The title is confounding. No midwives we’re murdured, and no midwives committed any murders. What starts out as a crazy pace for Lucy (What? No I can’t possibly take on your celebrity patient with my crazy caseload!) turns into a leisurely afternoon of viewing security footage with another midwife, handling the celebrity patient that was impossible to accommodate,, and vacation days to West Virginia. I just couldn’t buy what was being sold here. Also disheartening to see how easily Lucy is distracted by the males around her. Focus, girl.", "images": [], "asin": "B0841ZR7LW", "parent_asin": "B0841ZR7LW", "user_id": "AG4253O736WKANAQNMV32Y6KSBPA", "timestamp": 1642101150797, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Jury is out", "text": "Probably would have helped if my son used it", "images": [], "asin": "1524758167", "parent_asin": "1524758167", "user_id": "AGDSHL4SR2WDI47VJEOYOFOTGNQQ", "timestamp": 1578770229215, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "(possible spoiler) I also really didn't like the scene between the restaurant owner and Eve when ...", "text": "Not sure why the author chose to include so many derogatory and vulgar words to describe women, It was really distasteful to say the least. I also don't think it's reflective of words used in 1915 nor 1947, people just didn't speak that way. These ladies also didn't have much self esteem or self worth almost flinging themselves at men and using a lot of negative self talk.<br /> (possible spoiler)<br />I also really didn't like the scene between the restaurant owner and Eve when he suspected she was a spy and he wanted to get information from her. That was gruesome, completely unnecessary and difficult to read. Usually I really enjoy WWI and WWII novels this just was very disappointing.", "images": [], "asin": "0062654195", "parent_asin": "0062654195", "user_id": "AGSNP2HHLHS5WNOS3WMGXUE4MWPQ", "timestamp": 1517221171153, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Don't buy, download for free from USPTO", "text": "No value in buying this large and expensive book.  You can download, for free, a searchable PDF directly from the USPTO web site.<br /><br />www.uspto.gov/web/offices/pac/mpep/", "images": [], "asin": "1500927538", "parent_asin": "1500927538", "user_id": "AHFIVVYAXVXAHWC3ZCE6X63WLGFQ", "timestamp": 1434551602000, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Great start. Dreadful decline.", "text": "This book has angered me. It started off brilliantly and had me gripped. And, when the twist came 60% in, despite some silliness, I was still hooked. Then a ridiculous ending, ruined it for me. Thirteen year olds in this day and age are very bright, as is Shane, one of two central characters in this story. To then make him gullible and stupid in the story, lost the book half a star. The other central character, his mother, Jennifer who holds a Masters Degree in psychology mentioning her son to a psychologist and repeatedly calling the investigating detective on a murder case, ruined the twist which lost it a further half star. The biggest disappointment however, that lost a further full star came from the shoddy police work throughout the story including implausible scenarios such as a psychologist in New York leaving his door unlocked at night( he wouldn't even do this in the day), and an unexplained blank letter addressed to the investigating detective, no witnesses or coroner's report on the murdered librarian which in itself struck me as downright idiotic (for a stranger to happily accompany a teenager into a brothel), not to mention unexplained meditation. 3 stars.", "images": [], "asin": "B079WMT3M8", "parent_asin": "B079WMT3M8", "user_id": "AGHFDAIJOJPZBFMCZSEAHQOSGOIQ", "timestamp": 1676563692847, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Terrible", "text": "This was even worse than the Aquarium Show  booklet. it is flimsy, tears easily, not worth the paper it is printed on.", "images": [], "asin": "0486412725", "parent_asin": "0486412725", "user_id": "AEQA4X4524RI4IIXF2NNA2TH6HVQ", "timestamp": 1377355922000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Earplugs", "text": "Sorry, I did receive it, contrary to the email I sent you earlier today.  Had forgotten the name of the CD.  I do like what I can hear, but the earplugs are not a comfy way for me to sleep,so only tried it a couple of times.", "images": [], "asin": "B005IGZ07O", "parent_asin": "B005IGZ07O", "user_id": "AFIBHS4RRGSOCGCCOJH32FNABERA", "timestamp": 1392674087000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Nice sequel", "text": "Very good book. Keeps you guessing. But the dialog was a bit tedious in parts. I'd still recommend it.", "images": [], "asin": "B01CMGPFQ8", "parent_asin": "B01CMGPFQ8", "user_id": "AEESDQVIEUYH7TWEC65ZWKPC2STA", "timestamp": 1481791181000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "camp ellis", "text": "It was an o.k. read and I did enjoy it.  I used to live close to Camp Ellis and it brought back many memories.", "images": [], "asin": "1479236969", "parent_asin": "1479236969", "user_id": "AH2I4G6MYPL6QGUDJXBTFSMEF4DA", "timestamp": 1357827783000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Loony tunes", "text": "This is probably the worst book I have begun in many years.  Besides being utter nonsense, it is so laden with ivory-tower academic-speak that i began to wonder what kind of editor let this thing into print.", "images": [], "asin": "0809224399", "parent_asin": "0809224399", "user_id": "AHRPOGWS4FDBIU6LHAYGE3FOMEVQ", "timestamp": 1363907503000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Fun but \"Scary\"", "text": "My 3-yr old boys like this book but are also a bit scared by it.  They are engrossed by the tune and odd pictures but don't understand why the old lady swallows so many things. Does anyone? Of course, this book follows the tune of the childhood song we all grew up with but she swallows a fly, a spider, a bird, a cat, a dog, a goat, a cow, and a horse.  I don't remember her swallowing such large animals! I think my kids are a bit disturbed by the fact that she swallows things they consider pets and nice animals-cats, dogs, horses.  When we sing it, I change the line, \"perhaps she'll die\" to \"perhaps she'll cry\".  In a way, I wish I would have waited to get this book for them because I don't think they were ready for it but now they ask for it all the time.", "images": [], "asin": "0316930849", "parent_asin": "0316930849", "user_id": "AFK5FYUJAXV4KVKZAUMAK6PCLUGQ", "timestamp": 1110497872000, "helpful_vote": 6, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Too much self pity", "text": "I was expecting a light-hearted romance and instead found a main character that was so depressing I could hardly get through the book.  It was pitiful how the character kept deliberatly defeating herself only to finish strong in the end.  I had a hard time getting involved.", "images": [], "asin": "0743418174", "parent_asin": "0743418174", "user_id": "AGNSN5DYXAEHCVVRTLYFPSBIFE6A", "timestamp": 1024968231000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "The faces...", "text": "The faces in this book appear to be some sort of botox situation. Seriously, the smiles look strained and some of the fairies have pig noses. I'm not sure what the artist was going for, but if cute was the aim..that wasn't the result, at least in my opinion. The rest of the artwork is decent, the flowers and backgrounds are good and would be nice for less advanced colourists. The book has plenty of images, but frankly, I have avoided colouring this book because some of those faces are just...scary.<br /><br />Single sided pages make for better colouring implement choices and the paper is decent quality, but still...those faces.", "images": [], "asin": "0785830405", "parent_asin": "0785830405", "user_id": "AFDNLNTANUGENK62RSTAQALJOWPQ", "timestamp": 1457652907000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Meh", "text": "Meh. Not his best work and not his worse. It was a struggle for me to get through tbh and I’ve read almost all of his books", "images": [], "asin": "1444707825", "parent_asin": "1444707825", "user_id": "AGAXHNHF7HBTCZPEED5POMPMU7MA", "timestamp": 1660775130894, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "I Stopped Reading It", "text": "This book has some extremely gruesome means of murder in it and I was troubled by it so I stopped reading it. True, they have been used in the past but I didn't want those images in my head.", "images": [], "asin": "B07Q47T1K3", "parent_asin": "B07Q47T1K3", "user_id": "AE7NFSW4PNDQURUQKSE3WNEUBKMA", "timestamp": 1638553939398, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Ummmm boring, predictable...cheesy....", "text": "Wow I am really surprised so many readers finds this book so incredibly good. Charming doctor, great sex and boyfriend in a past...with all due respect I think I can write a book just like it...", "images": [], "asin": "1501110365", "parent_asin": "1501110365", "user_id": "AF3ZDH3R2ZSHBMJDWKOIBTD4V3RA", "timestamp": 1644125290942, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "I didn't love it as much as I wanted to", "text": "I am a compulsive baker with an embarrassingly large collection of dessert/baking cookbooks. For another book to make it onto the crowded shelves it has to stand out with unique recipes and techniques. While there are many excellent recipes in this collection that I am thrilled to have is there anyone out there who is thinking; if only I had another recipe for Mexican Wedding Cookies?<br /><br />They are stingy with the photographs and it is very disappointing that of the pictures included none are of some of the more elaborate desserts where you would like to see what the final product looks like. Instead there are pictures of chocolate chip cookies, pots de creme, gingersnaps, flan, bread pudding, sorbet and frozen yogurt. That is just plain annoying. I would gladly pay more for a book that is well photographed.<br /><br />I have a great deal of respect for David Lebovitz and was excited to be one of the first to get a look at his new title. There are some books I can say unequivocally, buy it you will love it. This one I would recommend looking through it first to see if it is something you would enjoy.<br /><br />*Update: Obviously my comments on the book struck a chord among the obsessive bakers/ cookbook collectors out there. It has been bothering me though that other than my comment on the amount of recipes included that I dismissed as too common most were really complaints the publisher was responsible for. I want to update this review with a response to a question on the quality of the recipes in the discussion section for those who don't usually check in on those...<br /><br />All recipes I have tried from this book do work, and they are clearly written. Many of the recipes are adaptations of classics with David's spin. I probably did a disservice to David by focusing on the book from my point of view as an accomplished baker comfortable adapting and tweaking recipes to suit my own taste. I think the real strength and value in this book is the amount of tips and advice David provides. It would be great for anyone who would like a book to teach them about baking and dessert making instead of just providing recipes. David's humorous conversational writing style is a big plus too.", "images": [], "asin": "158008138X", "parent_asin": "158008138X", "user_id": "AEPTRAUZBWKOKWHQKQDIHY3LF2WQ", "timestamp": 1268426435000, "helpful_vote": 270, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Ok", "text": "It was ok, but not great. I had to have it for a web class. It was easy enough to read, but I didn't enjoy it.", "images": [], "asin": "089870605X", "parent_asin": "089870605X", "user_id": "AHA3CENX7BYAXPPOECTD6DWPO7WA", "timestamp": 1353552288000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "DISAPOINTMENT", "text": "I read the first two books of the Tawny Man and was thrilled, but then I read the third.<br /><br />It seemed to me that Hobb was leading us down a certain path with these books, but then at the end of Fool's Fate swurved and tumbled of a cliff.<br /><br />The story is not in keeping with the previous books rhythm! We learn that the majority of his emotions thus far are because he \"dulled\" the edges of his world and he miraculously get them back and the world is once again crystal clear as is his love for Molly, whom was already described as just a youthful love. No, now it is true love and oh! since she's available now (strange coincidence)he can go get her back!<br /><br />Angered? Yes I was, but I could have been fine with this upset that is until she dismissed the Fool. All that happens, all that they were put through and the sacrifices that they made for one another and yet in the end he is completely dismissed form Fitz's life as just another sad memory, another regret? No, that I couldn't stand. The Fool loved him, that was made clear long ago and yet now that they are closer than they have ever been he can simply leave? I understand that he was put under a trumendous ordeal, but even that pales to the sudden attitude the Fool has at the end and really the only word I can think of to describe it is exactly that \"a dismissal\".<br /><br />Starting at the scene before Girl-on-a-Dragon and leading up to the cabin and Fitz's diparture the book begins to fall apart. It feels as if we are being led in a direction and then swiflty turned about the other rode forgotten as well as all the possiblities it held.<br /><br />I dearly loved the Farseer Trilogy, in fact I still do, but this new trilogy has now spoiled it for me. I caution anyone who loved that trilogy as much as me and who loved the Fool, don't read these books. Simply stop at the last trilogy because you'll be dissapointed.<br /><br />Angela.", "images": [], "asin": "0553801546", "parent_asin": "0553801546", "user_id": "AEJGBWCKPHTC3RFAEBOSXCATBFXA", "timestamp": 1107562544000, "helpful_vote": 12, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A little disappointing but still great fun", "text": "This is one of John Mortimer's last contributions to the Rumpole canon, published just two years before his death, and it is not one of his best.<br /><br />Although the story is amusing overall and has a much sharper socio-political edge to it, the storytelling and writing style lack a lot of the spark of Mortimer's earlier work. Some the characters, like Liz Probert and Sam Ballard, have evolved in ways that might seem inconsistent with their earlier personalities, which Mortimer had brought to life so convincingly.<br /><br />John Mortimer experimented further with telling some of the story from Hilda's point of view, which he introduced in earlier works. This technique works particularly well with respect to one of the subplots in this book.", "images": [], "asin": "B000W918QY", "parent_asin": "B000W918QY", "user_id": "AHBT6PRESZ3RDU7MTX7PRW5PAJHA", "timestamp": 1479234677000, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "not for me", "text": "I was not able to finish this book. It was an okay read but just not for me so I didn't finish about halfway through.", "images": [], "asin": "1594205051", "parent_asin": "1594205051", "user_id": "AECQQBG6YRYCOJL2NCB2H3V6LD6Q", "timestamp": 1664911464156, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "The only downfall is that the chager port breaks easily and so now the case isnt waterproof", "text": "I bought this case for my daughter and it has been ran over by 2 cars and not a single crack in her phone. also, she has taken it in the pool and to the beach with her and it worked perfectly. The only downfall is that the chager port breaks easily and so now the case isnt waterproof.", "images": [], "asin": "B01ABH0A6U", "parent_asin": "B01ABH0A6U", "user_id": "AFOLXZL7HZVF7VKNWDG6DKI6EWNA", "timestamp": 1469379204000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Decent listen great narrators", "text": "I did love these narrators. The story was lacking and not as hot as I had hoped. The narrators kept me listening to the end", "images": [], "asin": "B07DDNDQVM", "parent_asin": "B07DDNDQVM", "user_id": "AGS6TOXGQXKJTP6VW2C7367LONDA", "timestamp": 1534336194143, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "good story line but hard to read writing style", "text": "I liked the story line but didn't enjoy William Gibson's writing style.  His sentences often didn't seem complete (missing/implied pronouns) and there were many others from which I could drive no meaning even after repeated readings.<br /><br />The first one hundred or so pages I felt lost with no key to unlocking the secret code.  A glossary of the authors invented terms/processes/items would have helped immensely.  I would have given up early on if I hadn't been reading this for my local book club meeting.  I gave up on trying to understand much of what Mr. Gibson was writing, and settle for following the basics of the plot line, which I did enjoy.<br /><br />The story starts in some point after 2023 in the United States.  Flynne Fisher is an ex-gamer, but just this once she agrees to sub for her brother and work his shift beta testing a game.  Well, she does it again the next night and this time all doesn't go so well.  Some one in the game is killed in a gruesome manner and she begins to question whether it really is a game.<br /><br />The story skips back and forth between Flynne's time and a future time, about seventy years from them.  In the future, Wilf Netherton has some involvement with the death that occurred and it's important to him to protect Flynne from any backlash from that event.<br /><br />The character of Flynne is well developed and I found her down to earth and likable.  She is very family oriented and ethical.  She sticks to her morals even when large amounts of money are waved in front of her face.  My other favourite character is Conner, a long time friend who is ex-military with multiple crippling war injuries.  He's in your face, does what he needs to with no apologies.<br /><br />This story made me ponder the role of technology in society.  Change used to be a long time coming, but now, technology seems to change almost over night.  Download a file, a bam, with a 3D printer you can have a new product in hours.  Who's to decide/determine whether this is good or bad.<br /><br />All things considered, I enjoyed the story line and had no trouble believing the bridging of the time differences, I only wish that it had been easier to read and understand the actual wording.", "images": [], "asin": "0399158448", "parent_asin": "0399158448", "user_id": "AGQJNLHNTHRALVRUPTKQED3DFEVQ", "timestamp": 1460392969000, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "N/A", "text": "Not a big fan of the story", "images": [], "asin": "0803736800", "parent_asin": "0803736800", "user_id": "AHV4CHJIXZMMIAYYOE2KECAIJJAA", "timestamp": 1568237320171, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Not exactly what I expected, but informative.", "images": [], "asin": "1591847214", "parent_asin": "1591847214", "user_id": "AGNRBD2YSJJZN3BBM5RP2MRP7JGQ", "timestamp": 1432130734000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Happy Ending makes for a good read.", "text": "First let me tell you that this is a sequel to another book, I just can't tell you which one.  It doesn't quite stand on it's own.  The story is great, though.  Lot's of intrigue as suspects come and go.  But Annie and Nate get it at the end when it is almost too late.  I know there is another story after this.  The titles just are not marked \"book 1; book 2.", "images": [], "asin": "B00TP1F8ES", "parent_asin": "B00TP1F8ES", "user_id": "AEWOAMIBOVPN5SBAQTBNERFQAK6Q", "timestamp": 1444793872000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Love the man but not the book", "text": "I'm a huge fan of Cesar Millan's television show and find his innate ability to relate to dogs inspirational and fascinating, and I agree with his methods.  I was very anxious to get the book and couldn't wait to start reading it.  However, I'm half way through and don't think I'll be able to trudge to the end.  It's very redundant.....he keeps repeating himself over and over and over.  So far, there's very little useable info for the average dog owner, too much like a story book of his life than an instructional book dog owners can use in their own lives to help them and their dogs.  It doesn't change my respect for Mr. Millan at all, but it does make me think that his skills as an author pale in comparison to his ability to understand dogs and assist them AND their owners.", "images": [], "asin": "0307381668", "parent_asin": "0307381668", "user_id": "AFBOHXRGHO3LQ2PYOB5URT5XESFQ", "timestamp": 1428734981000, "helpful_vote": 19, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Soy in recipes was a bummer", "text": "Soy is so bad for our health, particularly the non fermented kind of soy food, Ie. tofu, edamame. I also don't like the fact that not all recipes have photos. Overall, it's a beautiful book but I'd prefer something more functional - bigger and bolder fonts for ingredients and preparation, especially where the paper is printed in dark charcoal. Titles could be in an easier font, not so organic. And last but not least, the paper could be more 'dirt' friendly/ easier to clean in case of accidents while preparing the meals.", "images": [], "asin": "1465475621", "parent_asin": "1465475621", "user_id": "AEUYHOCMQ5ZLHWIDEBZG2SDVA4NQ", "timestamp": 1554254629972, "helpful_vote": 2, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "It was decent", "text": "I liked it ok but I found it extremely predictable. I still read it and will probably read more. Had a pretty good flow.", "images": [], "asin": "B07HWT7MYS", "parent_asin": "B07HWT7MYS", "user_id": "AHOGQ4AB3S5F4II2454W2YDQWN2Q", "timestamp": 1622866215706, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Great premise, poor execution", "text": "Such a great idea for a WWII Holocaust novel!  This story needed the heavy influence of a good editor before it was offered for sale.  I couldn't finish the book because of the wooden, unsympathetic characters and the dreadful array of cliches throughout.  The idea of a down-on-his-luck, talented Parisian architect during the Nazi occupation getting involved in designing spaces to harbor Jews is ingenious and a story I very much wanted to like.  If the author could have drafted his prose more simply and designed a nuanced change of heart for this architect as cleverly as he designed his buildings, this could have been a bestseller.", "images": [], "asin": "B00DJBXASQ", "parent_asin": "B00DJBXASQ", "user_id": "AGX3J6OPYMXRAVVYJQRYMLF2KX2Q", "timestamp": 1388948194000, "helpful_vote": 17, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "The pictures are poor quality and it's poorly written", "text": "Don't bother. The pictures are poor quality and it's poorly written.", "images": [], "asin": "1620921022", "parent_asin": "1620921022", "user_id": "AFO2O6K27ZBG7DUKQM5NN7UCULIA", "timestamp": 1421447697000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "No textbooks are good, but this one is so dull I felt ...", "text": "This is the most awful textbook I have suffered in a while.  No textbooks are good, but this one is so dull I felt tortured reading it.  Good Luck!  The information is solid, but there is absolutely no effort to make it digestible or interesting.", "images": [], "asin": "8131734048", "parent_asin": "8131734048", "user_id": "AELZDXEPZPBFZ6YIIAR6FANFRQKA", "timestamp": 1434479459000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Soup recipes", "text": "Hmm recipes. Not very many. Story was ok. Nice beach reading book.", "images": [], "asin": "0425251470", "parent_asin": "0425251470", "user_id": "AGS5TZHVIGR5X257HHAUUTZGYWHQ", "timestamp": 1614458689951, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "French Foodies Investigate", "text": "Two newly married snobs enjoy the high life while investigating a murder. The chef/owner of a popular eatery angers his wealthy neighbors with his plans to expand into a courtyard that houses a historically significant fountain. When a skeleton is discovered, it triggers fears of an ancient curse. But the body is of more recent vintage and triggers an investigation into royalists that will take magistrate Verlique and his bride, professor Bonnet, down a twisted trail  of criminal enterprise including human trafficking and drugs.<br /><br />While some may find the slow pace and meandering story enjoyable, I found it boring and aggravating. There are too many characters and lord forbid they pass up any opportunity to eat or drink. I was not charmed by this wine soaked French version of NIck and Nora. Suspense is lacking and the mystery is light. This is the sixth of a series but my first and probably last encounter. If you prefer a leisurely stroll to an suspense filled run, this book is for you. It was just too precious for me.", "images": [], "asin": "0143110942", "parent_asin": "0143110942", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1489180188000, "helpful_vote": 7, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Ok", "text": "3.5 stars<br /><br />Taken by a Sinner is book 1 in the Sinners series and while I didn't love it, I enjoyed it enough to continue the series. While it was pretty predictable for the genre, I did find myself bored at times.", "images": [], "asin": "B09TWPBYYN", "parent_asin": "B09TWPBYYN", "user_id": "AGW5MZALTQMMOJFK5D5Z4WHM4A6Q", "timestamp": 1675197974098, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "book has good information. I wished it were less written in ...", "text": "book has good information. I wished it were less written in to make it more usable but it was used and done in pencil", "images": [], "asin": "0764142593", "parent_asin": "0764142593", "user_id": "AEI5JWWJNKSAB27I3GEY7NCR7KPQ", "timestamp": 1483722003000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Las Vegas's Seedy Underbelly", "text": "I didn't care much for Cassie until the last page.<br />A good read but who was the good guy?<br /><br />&#34;With one breath, with one flow<br />You will know<br />Synchronicity&#34;", "images": [], "asin": "0446609145", "parent_asin": "0446609145", "user_id": "AEYUTWRDI6DZWLXIH45QPEXKKOAA", "timestamp": 1487269576000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Save your time and money", "text": "The main character, Ruby, is the dumbest person on earth. She had to be hit over the head to figure anything out. The narrator of the audiobook whispers the whole book. Super annoying, plot taken from every other book.", "images": [], "asin": "B085LSWS6D", "parent_asin": "B085LSWS6D", "user_id": "AECQQBG6YRYCOJL2NCB2H3V6LD6Q", "timestamp": 1616547520780, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Wish I could give the content a good review", "text": "Not a great read.  Too much country cliches and reminiscing that sounded just like childhood of most baby boomers.  I really wanted to like it but couldnt get past the first couple of chapters. It fid arrive quickly and in very good condition.", "images": [], "asin": "0718074963", "parent_asin": "0718074963", "user_id": "AFWU6SJBZFSLCE4JBXEJ3ENBIZ4Q", "timestamp": 1669232409306, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Decent summary of Padres' history", "text": "Padres Essential: Everything You Need To Know To Be A Real Fan is a short history of the San Diego Padres written by the Padres beat reporter for the San Diego Union-Tribune, Bill Center. This is a concise, entertaining look at the 40-year history of the franchise that you'll read in a couple of sittings. The book was published in 2007 so lame duck team owner, John Moores, who drove the franchise into the ground the last five years is referred to quite positively. Even so, Padres Essential is a valuable read.<br /><br />Padres Essential was published the same year as Bob Chandler's Tales From The San Diego Padres Dugout but it's far and away the superior publication. \"Tales\" was written at an eighth grade level while Padres Essential  was written for adults and has more material. My biggest gripe about \"Tales\" was it never even mentioned the greatest Padres tale; Goose Gossage lambasting team owner Joan Kroc in 1986 for removing beer from the clubhouse. Center at least mentions the incident although not in any detail.<br /><br />Most seasons we Padres fans are only hoping for a .500 season so we've learned not to aim too high. There are no great Padres books out there but Padres Essential is better than nothing (and better than Bob Chandler's Tales From The San Diego Padres Dugout).", "images": [], "asin": "1572439564", "parent_asin": "1572439564", "user_id": "AEBMSOQLX55ISSFOJT37IYIMIQGQ", "timestamp": 1344890070000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Can get just as much info online for free", "text": "overpriced book", "images": [], "asin": "1505890314", "parent_asin": "1505890314", "user_id": "AHEO6HKR54I5C4734T3NI2RJZUXQ", "timestamp": 1443886915000, "helpful_vote": 3, "verified_purchase": true}
{"label": 0, "rating": 1.0, "title": "Don’t recommend", "text": "I love John Grisham.  I hated The Reckoning.  It was not a good story. I read, more like skimmed, the whole thing to find out WHY the main character killed the preacher.  It wasn’t worth the wait.", "images": [], "asin": "0385544154", "parent_asin": "0385544154", "user_id": "AGKJNV4SCVXSHIJYFSEAPE6ZIDQA", "timestamp": 1543502292685, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not what I expected.....", "text": "I don’t know, but I just didn’t get this book. It certainly was not what I expected.<br /><br />There was a lot of scene switching, going from present to past, and sometimes to symbolical or allegorical scenes.<br /><br />Aside from the fascinating views of pre-world war Jewish daily life and the concentration camp scenes, I found the sex scenes and child molestation episodes a bit graphic and mostly unnecessary to the telling of the story.<br /><br />The book was interesting, but not something I would usually read.<br /><br />I received an advance review copy for free, and I am leaving this review voluntarily.", "images": [], "asin": "B08LN5JH8L", "parent_asin": "B08LN5JH8L", "user_id": "AEEBBMSVPL74AVZGE3UITBA6N2VA", "timestamp": 1610283389169, "helpful_vote": 7, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not great, not terrible", "text": "I found it sort of repetitious and just not very helpful, but things like this are different for everyone, might be helpful to others.", "images": [], "asin": "1572244011", "parent_asin": "1572244011", "user_id": "AGWUU7VYMX4WJ6HOYM6D43F3US6A", "timestamp": 1470188008000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Meh.", "text": "I feel like this book had some good, creepy imagery although it was ruined by the rape scenes. I realize the evil in this book was a demonic sex cult so it would have been hard to keep rape out of it but it still felt unnecessary. The characters lacked depth so it was hard to care about them.", "images": [], "asin": "1798852306", "parent_asin": "1798852306", "user_id": "AHNTUS4AT25LVTUV5H2JD7ZA4A4A", "timestamp": 1562804009951, "helpful_vote": 1, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Disapointed with the black and white photos", "text": "The pages inside seemed more like the pages of a simple paper back novel. all the photos are in black and white. the pages are not glossy.", "images": [], "asin": "1434816494", "parent_asin": "1434816494", "user_id": "AHCQWL3AM5ANUFOEQDXIVOWKQG7A", "timestamp": 1563051718023, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "The three stars for the stories only", "text": "I loved the stories but I wish that when one purchases a paperback the sellers had to disclose that it's a Scholastic print. It's terrible. It's printed in brown rough butcher paper, like all of their books (unless they are old, I have decent ones). I don't even know how they are able to sell those the first time. I have purchased many other paperbacks and they are still good quality paper, they just happen to be paperback.", "images": [], "asin": "1554988330", "parent_asin": "1554988330", "user_id": "AHZS5TF7B5WVXQZDMV7OMI6OTCUA", "timestamp": 1600273776821, "helpful_vote": 3, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "not impressed at all the way the dialogue was set the action of the characters is like watching a bad movie made for tv", "text": "the writing of this is something that possibly a 10 year old could write....very hard to keep this book going...not impressed at all the way the dialogue was set the action of the characters is like watching a bad movie made for tv....sorry could not say it kept me interested at all not a complete waste of time as reading any book never is...just not for me", "images": [], "asin": "1521006237", "parent_asin": "1521006237", "user_id": "AFVWIYJTNBHM7VTTE3XRWDTGW7BA", "timestamp": 1525694022984, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "A blood- soaked trail from Mexico to Texas", "text": "&#34; The House of the Rising Sun&#34; by James Lee Burke is a story set in Texas and takes place in the years just after the turn of the 20th. century. It's hero is Hackberry Holland, former Texas Ranger and  town Marshall, though hero may be the wrong word to describe him.<br />In most western stories, the hero is a man who can be described as a good man to have as a friend and a bad one to have as an enemy.  Think of Shane of the classic movie western. Hack Holland, however, is a bad man to have as a friend and worse to have as an enemy.<br />He is a sociopath, possibly a psychopath, an alcoholic with muderous rages in which he is quite likely to beat a man to the ground and keep pounding on him until the red mists before his eyes fades away. Not a man to mess with-- or love. That is the main character of this book.<br />Moreover, there is not one of the important characters in the book who is much better. Lust , greed, revenge, willful pride are the motivating factors of the story, which is saying something, considering it is about a search for the Holy Grail. Yes that Holy Grail. Hack finds it, and the one who had it wants it back and wants it badly enough to kill and torture his way through Mexico and Texas to get it.<br />That being said, &#34;The House of the Rising Sun&#34; is one heck of a novel.<br />Mr. Burke writes beautifully, compelling the reader to pay attention. He paints colorful landscapes for his novel,  with  the hill country of Texas and the sere Mexican  desert hardly big enough to contain the action. His characters,even the supporting players, to use a movie term, live on the pages, at least until someone kills them.Burke somehow, but with great skill, even makes Hack Holland a sympathetic character, as he combats his homicidal urges, wallows in his remorse for his treatment of his family and contemplates a life without one friend to his name.<br />Burke gets a bit of philosophical musing in, writing, &#34;.Was not all mankind adrift on a dark sea, without hope, at the mercy of undercurrents, waves big as mountains....&#34; At one time, when Hack's woman, the mother of his son finds him in a cage, drunk, beaten and filthy, his recent war wounds barely healed over, she &#34;  ...takes his weight across her thighs, his arms hanging loose...the bones of his chest prominent....&#34; A Pieta - like scene. Burke does like to use purple prose to paint a powerful picture.<br /><br />I had not read too much of Burke's  work before this book, maybe one or two of the Robicheaux thrillers. This one was certainly different and I will look into more of the Hack Holland books just to see how he became the man he was.<br /><br />Recommended , with the warning there  violent and sometimes disturbing scenes. Also sexual references, though no graphic sex. Also some late night, last drink before closing the bar down,philosophical musing going on to try to raise the level from a hell-bent western.", "images": [], "asin": "1501107100", "parent_asin": "1501107100", "user_id": "AEZ332RDO5FCMRGT3PD2XFJPP2AQ", "timestamp": 1451879144000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "not great.", "text": "Just ok, not great.", "images": [], "asin": "0794515584", "parent_asin": "0794515584", "user_id": "AGHNRSQZUJM73FY4VNW5DF4GH6IQ", "timestamp": 1483729684000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Book content great, condition?", "text": "I AM PLEASED WITH THE BOOK BUT WAS &#34;AMUSED&#34; AT THE PRICE  ...$21+ ...WHEN THERE WAS A $2.00 CLEARANCE PRICE TAG ON THE COVER.  YIKES!  THERE WAS AN INSCRIPTION WRITTEN ON THE INSIDE TO A PREVIOUS OWNER AND THE BOOK, ALTHOUGH IN FAIRLY GOOD CONDITION, WAS NOT QUITE WHAT WAS TOLD IN THE DESCRIPTION. IF I EVER GET TO ENGLAND I WILL CERTAINLY USE THE BOOK TO SEE ALL THE WONDERFUL TREASURES HELD WITHIN THE PAGES OF THIS BOOK.", "images": [], "asin": "1568522797", "parent_asin": "1568522797", "user_id": "AEKSXLKEDYDGAM52K56MALPV7I5Q", "timestamp": 1389738324000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Nice pictures, but light on content", "text": "Love the pictures.  Beautiful and fun to look at.  A little light on content.  Good for young ones, around age 3-8.  After that age, theyll appreciate some real information which you dont find in this book.  On the positive side: The artists did a beautiful job on the illustrations and designs in the book.", "images": [], "asin": "1465477020", "parent_asin": "1465477020", "user_id": "AHDG5PX6GN3SFGGMIZDF32S4PPRA", "timestamp": 1553561866066, "helpful_vote": 19, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Garbage, straight up", "text": "So let's see. A book claiming to be new, uses old and well established and well known information. Still fails to help explain the important part that is near impossible for people to quantify: how to identify the trigger for an action.<br /><br />Maybe if this book actually helped with that part a whole lot more than they do, it would have been worth the money. As is, I'm disappointed. 90% of the book is just story after story as examples, but they don't add substance to the point of the book at all. The total substance of important things in the book is like the last 10-20 pages. The rest could (and should) be skipped, entirely.<br /><br />In contrast the book \"how we decide\" has much more pertinent information.", "images": [], "asin": "1400069289", "parent_asin": "1400069289", "user_id": "AH5VM7TR3Z2Q2CLUFOC6GMVOMVMA", "timestamp": 1363703821000, "helpful_vote": 13, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Mostly Tedious With Occasional Flashes of Brillance", "text": "1970. A castle in Italy, Three twenty -something Brits are vacationing, Keith who spends his time reading classic British novels of the 18th and 19th centuries, Lily, his girlfriend who frets about not being beautiful enough and Schehrazade, Lily's friend who is tall, exquisitely beautiful and vacuous. A subsidiary cast is also present, Whittaker, a gay man and his Middle Eastern lover Amen, Adriano, a rich midget count who has his eyes on Schehrazade, Gloria who has a superb 'arse' and various others. All of them spend almost 400 boring pages obsessing over Schehrazade's gorgeous breasts. Will Keith get to have sex with her? Will there be consequences? The guys seem perplexed finding themselves in the midst of the sexual revoluation where girls want and have sex as much as they do. As a Baby Boomer who was the same age as these young folk back in 1970 I found this all tedious in the extreme. True every once in awhile there is a flash of brilliant observation by Amis put into the mouth of a now aging Keith giving us a peek into the future. Literary references abound. Yes, I get it Amis is writing a 1970's comedy of manners like the novels read by Keith. Still the slog through this dull book just isn't worth the effort, and Amis makes the Italian castle setting about as interesting as a stay on an iceberg in Antarctica.", "images": [], "asin": "1400044529", "parent_asin": "1400044529", "user_id": "AFQ6GBLHZLQKWNOTOWRSP7QD6RKA", "timestamp": 1276310169000, "helpful_vote": 5, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Good but same cakes as before, just re ycled", "images": [], "asin": "0471469335", "parent_asin": "0471469335", "user_id": "AHTPYUJPAXBSSHCDTIP6UEMBP6BQ", "timestamp": 1405793764000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Well...", "text": "It started out a little slow but I was very interested in the main character Diana, so I kept plugging along.  I almost put it down when the I OWN YOU & YOU DO WHAT I SAY crap started.  Matthew is your typical 1500 year old vampire in a romance.  He hasn't learned over the years that women don't want to be told what to do anymore.  Apparently the author hasn't figured that out either.  I stopped reading when Diana and Matthew got to Diana's family home and her aunts started in as well, that was enough for me.  If you want that kind of crap in your romance pick up the usual paperback romance novels. Don't waste your time on this one, it's too long for that.", "images": [], "asin": "0670022411", "parent_asin": "0670022411", "user_id": "AE2ZHAB3CJJH3YRRZB24DBIKEIVQ", "timestamp": 1312824189000, "helpful_vote": 2, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "Bad Acting", "text": "Was advertised as “if you like Vince Flynn then...”. Well, it’s not VF caliber and the reader is B actor grade.  I’ll try to finish and complete my review.", "images": [], "asin": "B00ZY5OTZ8", "parent_asin": "B00ZY5OTZ8", "user_id": "AGWEIRXBWOVW2URS4E4ALCK44DVQ", "timestamp": 1537099892591, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "good story but, not a fan or the writing style", "text": "I started and stopped this book about 3 times since late summer, and finally finished it last week.  It's an excellent story but, I just had some issues with the writing style. It's a style that one reviewer describes as a &#34;hot mess&#34;. I tend to agree.<br /><br />Commonwealth, begins with a christening party in Southern, CA for Fix and Beverly Keating's second child, Franny. At the party there are far too many people, too much alcohol and an uninvited guest who works with Fix that shows up.  Before the evening is up, two families will be torn apart.<br /><br />Bert Cousins, is the uninvited guest. He's a man who can't deal with spending his weekend with his three small kids and pregnant wife.  He leaves home and shows up at the party with a bottle of gin.  Bert has always been a womanizer and at this event it's Beverly Keating who proves just too irresistible for Bert. One kiss, and a mutual instant attraction and soon two fractured families.  Bert and Beverly move from CA back to Bert's home state of VA.<br /><br />The title &#34;Commonwealth&#34; is significant and, the story follows the children and adults of these marriages through middle and old age.  The family saga is large in scope. It's complicated, dysfunctional and even tragic. Yet, despite the sad parts, at times I found myself laughing as I read. The characters are well drawn and for the most part memorable.<br /><br />The non linear writing style was hard for me to get used to. The story, although very good, kept moving from one character to another and, the constant shift in POV felt off putting after a while.  Despite my struggles with this one, I loved the way that the author chose to end this family drama.<br /><br />3.5/5 stars", "images": [], "asin": "0062491792", "parent_asin": "0062491792", "user_id": "AHAR2ITQ3O2FJJDLIORAQ226KZHQ", "timestamp": 1479086123000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "boring", "text": "couldn't finish it, boring", "images": [], "asin": "B074N9F4MP", "parent_asin": "B074N9F4MP", "user_id": "AFDVDCYR3OAPP3RTG3RSXHFJGGGA", "timestamp": 1518484052944, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "fairy tales", "text": "I love his poetry.  this not so much.  I would not recommend it to anyone.  These tales are not to my liking.", "images": [], "asin": "0871406586", "parent_asin": "0871406586", "user_id": "AGWZ5BZPSXITOOOUP5PI7SHBVVOA", "timestamp": 1394154065000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Overall, pretty good.", "text": "Overall, I liked this book, it was interesting enough that I read it in one day.  However, this book was very predictable to me, which is why I am only giving it three stars. While reading other reviews, I'm shocked that they mention that they couldn't believe how this played out. Really? I guessed it from almost the very beginning.<br />It does have a good pace and storyline and was an overall enjoyable read but I wish I hadn't been able to guess the ending right from the beginning.", "images": [], "asin": "0615966349", "parent_asin": "0615966349", "user_id": "AGHQ6VGUNJWFHTI6FOKJRV422FXQ", "timestamp": 1414023395000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 2.0, "title": "Two Stars", "text": "Very difficult read.", "images": [], "asin": "1421580829", "parent_asin": "1421580829", "user_id": "AEZ4XO5D5TE5PPEX77QWUHXYIAPA", "timestamp": 1527995479148, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not the Best", "text": "This series of books is derivative of the Charlotte and Thomas Pitt novels by Anne Perry but aren't of the same caliber. Three quarters of the way through them all Inspector Blackstone simply has a revelation that solves the crime.  They aren't awful but they aren't great either.", "images": [], "asin": "B00NMOYCPA", "parent_asin": "B00NMOYCPA", "user_id": "AGN255MSZ2LACDTTUMEWE47ZR7MQ", "timestamp": 1456626465000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Well.......", "text": "I have yet to make a recipe from this book.  Not to say I won't but I<br />like simple recipes that don't require herbs I don't like.  It does give<br />interesting information.", "images": [], "asin": "0761132414", "parent_asin": "0761132414", "user_id": "AHUQFX3SK5H7D75G7RIFG3CHD2YQ", "timestamp": 1354915395000, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Not as good as other Tijan books", "text": "You really need to judge this book for yourself. Personally I thought this book was depressing and sad. I felt so bad for Alex. Jesse wasn't a very good guy, but I did read the second book, and I thought it was better. Still sad, but Jesse did get better with Alex", "images": [], "asin": "168230485X", "parent_asin": "168230485X", "user_id": "AEBXJVK4HGB32EJND4US6A3RCJOQ", "timestamp": 1495091385000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "Not my cup of tea. Review of audiobook.", "text": "If you love charming, sweet books, you will enjoy this. It just got a little too cloying for me. Somehow even the bad parts seemed a little saccharine.<br />I listened to half of it and had to put it down.<br />I didn’t give it one star because the writing is beautiful and parts and creative and original and the characters are likable. It’s just not deep enough for me at this stage of life.<br />I have absolutely  no idea what bad language other reviewers are referring to as the audiobook had none of that.<br />The narration was excellent.", "images": [], "asin": "B01N1GCCHI", "parent_asin": "B01N1GCCHI", "user_id": "AHVSKOZXKLW3C4UQA3ACRWHBHFBA", "timestamp": 1583258107729, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "useless", "text": "too general. very few details.", "images": [], "asin": "1563920581", "parent_asin": "1563920581", "user_id": "AFQGPMIP6NSWDUDK6HCL5TAPMJIQ", "timestamp": 1542255793849, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 2.0, "title": "Eh", "text": "Very bias text.", "images": [], "asin": "1284114678", "parent_asin": "1284114678", "user_id": "AGMSWFBU2Z25VBZXODQEU7LXLOHA", "timestamp": 1574038528843, "helpful_vote": 1, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "Three Stars", "text": "Much smaller than I thought it would be but still cute.", "images": [], "asin": "B00ZGA4MVC", "parent_asin": "B00ZGA4MVC", "user_id": "AFAXNYE55OZRQLHHM54RSQ5UZS3Q", "timestamp": 1481215055000, "helpful_vote": 0, "verified_purchase": true}
{"label": 0, "rating": 3.0, "title": "When Life Gives You Lemons", "text": "This is the upbeat telling of an Olympic gymnast's life story. From athletic triumph to confronting cancer, she applies herself one hundred percent. The best parts are when she recounts her Olympic success.  But she tends to gloss over the unpleasant and difficult times in her life including her marital disappointments. There is a lack of depth and introspection and while I certainly applauded her bright and cheerful attitude and  admired her many accomplishments, I did not find myself involved with her or her story at any meaningful level. I suppose that part of the cheerful veneer is being in the public eye at a tender age and part is for protection. She is an appropriate role model for young girls and those with a strong interest in gymnastics will enjoy this book. It is nicely written and readable but for me, the lemonade was just a bit too sweet.", "images": [], "asin": "1250049865", "parent_asin": "1250049865", "user_id": "AH665SQ6SQF6DXAGYIQFCX76LALA", "timestamp": 1424118200000, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 3.0, "title": "It was a chore reading this over-rated book", "text": "Despite having many good ideas, the writing was tedious, pompous, and self-impressed. Reading became a chore.<br />I don't know how this book got so many good reviews. Maybe it is similar to the book A Brief History of Time by Stephen Hawking. People don't actually read it; they just praise it.<br />Any book by Malcolm Gladwell is far more engaging. Or try reading Thinking Fast and Slow by Daniel Kahneman for a really excellent set of ideas.<br />Just nudge the book Nudge aside. It's too ponderous.", "images": [], "asin": "014311526X", "parent_asin": "014311526X", "user_id": "AGJ6KCZJZEJVBYANOQGPKJ7N3DGA", "timestamp": 1604377324976, "helpful_vote": 0, "verified_purchase": false}
{"label": 0, "rating": 1.0, "title": "dont bother", "text": "the worse cook book i ever bought", "images": [], "asin": "0312291647", "parent_asin": "0312291647", "user_id": "AFDK324VPGZTMI7WRDX625YRNSQA", "timestamp": 1464375634000, "helpful_vote": 0, "verified_purchase": true}
